//IBMUSER  JOB (20,FB),ALLOC,REGION=1200M,CLASS=A,MSGCLASS=H, 
//    NOTIFY=IBMUSER 
//* Allocate VSAM LINEAR DATA SET AS ZFS MULTIPLE FILE SYSTEM AGGREGATE 
//ALLOC    EXEC   PGM=IDCAMS,REGION=0M 
//DASD0    DD     DISP=OLD,UNIT=3390,VOL=SER=ZZZZZZ 
//SYSPRINT DD   SYSOUT=* 
//SYSUDUMP DD   SYSOUT=* 
//AMSDUMP  DD     SYSOUT=* 
//SYSIN    DD     * 
 DEFINE CLUSTER (NAME(ZFS.S0W1.test) VOLUMES(ZZZZZZ)  - 
   LINEAR CYLINDERS(4500 450) SHAREOPTIONS(3)) 
//**
//FORMAT   EXEC   PGM=IOEAGFMT,REGION=0M, 
//         PARM=('-aggregate ZFS.S0W1.test     -compat') 
//*STEPLIB DD DISP=SHR,DSN=HLQ.SIOELMOD    <--LOADLIB FOR ZFS 
//SYSPRINT DD   SYSOUT=* 
//STDOUT   DD   SYSOUT=* 
//STDERR   DD   SYSOUT=* 
//SYSUDUMP DD   SYSOUT=* 
//CEEDUMP  DD   SYSOUT=* 
//* 
