****************************************************************
*        This is DIVISION.CPY -  BQ's Easy Divides             *
*        Usage: COPY  DIVISION  (with COPY in column 10)       *
****************************************************************
DIVIDEND DS    0PL16
QUOTIENT DS    PL8
REMAINDR DS    PL8
DIVISOR  DS    PL8
