//XYZ0005  JOB ' ','ADD NEW USERID',MSGCLASS=H,MSGLEVEL=(1,1),
//         REGION=4M,TIME=1440,NOTIFY=&SYSUID,CLASS=A
//S1      EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  DEFINE  ALIAS (NAME(HERMAN) RELATE(USERCAT.XYZ))
//NEWID    EXEC PGM=IKJEFT01,DYNAMNBR=75,TIME=100,REGION=6M
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTERM  DD DUMMY
//SYSUADS  DD DSN=SYS1.UADS,DISP=SHR
//SYSLBC   DD DSN=SYS1.BRODCAST,DISP=SHR
//SYSTSIN  DD *
  DD 'HERMAN.*'
  DU HERMAN
  AU HERMAN NAME('Herman Hollerith') PASSWORD(HERMAN)        -
   OWNER(SYS1) DFLTGRP(SYS1) UACC(READ) OPERATIONS SPECIAL   -
   TSO(ACCTNUM(ACCT#) PROC(ISPFPROC) JOBCLASS(A) MSGCLASS(X) -
      HOLDCLASS(X) SYSOUTCLASS(X) SIZE(4048) MAXSIZE(0))     -
    OMVS(HOME(/u/herman) PROGRAM(/bin/sh) UID(0))
  PERMIT ACCT#     CLASS(ACCTNUM) ID(HERMAN)
  PERMIT ISPFPROC  CLASS(TSOPROC) ID(HERMAN)
  PERMIT DBSPROC   CLASS(TSOPROC) ID(HERMAN)
  PERMIT JCL       CLASS(TSOAUTH) ID(HERMAN)
  PERMIT OPER      CLASS(TSOAUTH) ID(HERMAN)
  PERMIT ACCT      CLASS(TSOAUTH) ID(HERMAN)
  PERMIT MOUNT     CLASS(TSOAUTH) ID(HERMAN)
  AD 'HERMAN.*'   OWNER(HERMAN) UACC(READ) GENERIC
  SETROPTS REFRESH RACLIST(TSOPROC)
  MKDIR '/u/herman'
LOGOFF
