//XYZ0014  JOB ' ',NOTIFY=&SYSUID                                       00010000
//ICKDSF   EXEC PGM=ICKDSF,REGION=4096K
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
    REFORMAT UNITADDRESS(038B) NOVERIFY VOLID(RESTOR)
