//XYZ0000  JOB ' ',NOTIFY=&SYSUID                                       00010000
//RESETPW  EXEC PGM=IKJEFT01,DYNAMNBR=75,TIME=100,REGION=6M
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTERM  DD DUMMY
//SYSUADS  DD DSN=SYS1.UADS,DISP=SHR
//SYSLBC   DD DSN=SYS1.BRODCAST,DISP=SHR
//SYSTSIN  DD *
  ALU P390A PASSWORD(TEST) RESUME
  ALU P390B PASSWORD(TEST) RESUME
  ALU P390C PASSWORD(TEST) RESUME
  ALU P390D PASSWORD(TEST) RESUME
  ALU P390E PASSWORD(TEST) RESUME
  ALU P390F PASSWORD(TEST) RESUME
  ALU P390G PASSWORD(TEST) RESUME
  ALU P390H PASSWORD(TEST) RESUME
  ALU P390I PASSWORD(TEST) RESUME
  ALU P390J PASSWORD(TEST) RESUME
  ALU P390K PASSWORD(TEST) RESUME
  ALU P390L PASSWORD(TEST) RESUME
  ALU P390M PASSWORD(TEST) RESUME
  ALU P390N PASSWORD(TEST) RESUME
  ALU P390O PASSWORD(TEST) RESUME
  ALU P390P PASSWORD(TEST) RESUME
  ALU P390Q PASSWORD(TEST) RESUME
  ALU P390R PASSWORD(TEST) RESUME
  ALU P390S PASSWORD(TEST) RESUME
  ALU P390T PASSWORD(TEST) RESUME
  ALU P390U PASSWORD(TEST) RESUME
  ALU P390V PASSWORD(TEST) RESUME
  ALU P390W PASSWORD(TEST) RESUME
  ALU P390X PASSWORD(TEST) RESUME
  ALU P390Y PASSWORD(TEST) RESUME
  ALU P390Z PASSWORD(TEST) RESUME
  ALU OPEN1 PASSWORD(SYS1) RESUME
  ALU OPEN2 PASSWORD(SYS1) RESUME
  ALU OPEN3 PASSWORD(SYS1) RESUME
  ALU TESTER PASSWORD(TEST) RESUME
