*        ULTRA GOTHIC                                                   00010000
*        / CHANGES COLOR                                                00020000
*        # DELIMITS SIGNIFICANT SPACES AT END OF LINE                   00030000
*        _ PRINTS PARALLEL LINES                                        00040017
*        ¬ DOESN'T PRINTS PARALLEL LINES                                00050017
*          AND TREATS FOLLOWING CARD AS CONTINUATION OF PREVIOUS        00060010
*                                                                       00070000
*        VALID CHARACTER SET:                                           00080000
*        UPPER AND LOWER CASE A-Z 0-9 ,.?;':"!$¢&()-                    00090010
*                                                                       00100000
GOTHIC   CSECT                                                          00110000
         USING GOTHIC,R15                                               00120000
         STM   R14,R12,12(R13)                                          00130000
         LR    R12,R13                                                  00140000
         BALR  R0,0                                                     00150000
         BAL   R13,BEGIN                                                00160000
         DROP  R15                                                      00170000
         USING *,R13                                                    00180000
         DS    18F                                                      00190000
BEGIN    ST    R13,8(,R12)                                              00200000
         ST    R12,4(,R13)                                              00210000
         OPEN  (INDCB,(INPUT),OUTDCB,(OUTPUT))                          00220000
         MVI   CLEAR+1,C' '                                             00230010
         MVI   FILL+1,C'W'                                              00240010
RDCARD   GET   INDCB,CARD                                               00250000
         LA    R12,72                                                   00260000
         LA    R2,CARD+71                                               00270000
FINDEND  CLI   0(R2),C' '                                               00280000
         BNE   OUT                                                      00290000
         BCTR  R2,0                                                     00300000
         BCT   R12,FINDEND                                              00310000
         B     RDCARD             SKIP BLANK CARDS                      00320000
OUT      CLI   0(R2),C'#'                                               00330000
         BNE   HOP                                                      00340000
         BCTR  R12,0                                                    00350000
HOP      LA    R9,1                                                     00360000
         CLI   NEWPG,C'N'                                               00370011
         BE    CONTPG                                                   00380010
         MVI   CLEAR+1,C' '                                             00390010
         MVI   FILL+1,C'W'                                              00400010
         BAL   R3,CLEAR                                                 00410010
         MVI   OUTREC,C'1'                                              00420000
         BAL   R3,PRINT                                                 00430000
CONTPG   MVI   OUTREC,C' '                                              00440010
         MVI   NEWPG,C'Y'                                               00450011
         CLI   0(R2),C'#'                                               00460012
         BNE   NEW1                                                     00470011
         MVI   NEWPG,C'N'                                               00480011
NEW1     TR    CARD(80),TABLE                                           00490011
         LA    R2,CARD                                                  00500000
TOP      CLI   0(R2),X'FC'                                              00510017
         BE    LINED                                                    00520017
         CLI   0(R2),X'FD'                                              00530017
         BE    UNLINED                                                  00540017
         CLI   0(R2),X'FE'                                              00550017
         BE    INVALID                                                  00560000
         BL    NEWCHAR                                                  00570000
         LCR   R9,R9                                                    00580000
         BM    WHTONBLK                                                 00590000
BLKONWHT MVI   CLEAR+1,C' '                                             00600000
         MVI   FILL+1,C'W'                                              00610000
         B     NEXT                                                     00620000
UNLINED  L     R0,=A(PATUNLIN)                                          00630017
         ST    R0,PATBASE                                               00640017
         B     NEXT                                                     00650017
LINED    L     R0,=A(PATLIN)                                            00660017
         ST    R0,PATBASE                                               00670017
         B     NEXT                                                     00680017
WHTONBLK MVI   CLEAR+1,C'W'                                             00690000
         MVI   FILL+1,C' '                                              00700000
         B     NEXT                                                     00710000
INVALID  ABEND 1000                                                     00720000
NEWCHAR  SR    R3,R3                                                    00730000
         IC    R3,0(,R2)                                                00740000
         LH    R5,OFFSET+2(R3)                                          00750000
         LH    R4,OFFSET(R3)                                            00760000
         SR    R5,R4                                                    00770000
         SRL   R5,4                                                     00780000
         LA    R4,15(,R4)                                               00790017
         A     R4,PATBASE                                               00800017
         L     R15,NUMCHAR                                              00810014
         LA    R15,1(,R15)                                              00820014
         ST    R15,NUMCHAR                                              00830014
         BAL   R3,CLEAR                                                 00840000
         BAL   R3,FMT                                                   00850000
         BAL   R3,CLEAR                                                 00860000
         L     R4,PATBASE                                               00870017
         A     R4,=A(PATSP-PATS)                                        00880017
         LA    R4,15(,R4)                                               00890000
         LA    R5,2                                                     00900000
         BAL   R3,FMT                                                   00910000
NEXT     LA    R2,1(,R2)                                                00920000
         BCT   R12,TOP                                                  00930000
         B     RDCARD                                                   00940000
EOFSYSIN CLOSE (INDCB,,OUTDCB)                                          00950000
         L     R15,NUMCHAR                                              00960014
         L     R13,4(,R13)                                              00970000
         L     R14,12(,R13)                                             00980014
         LM    R0,R12,20(R13)                                           00990014
         BR    R14                                                      01000000
         EJECT                                                          01010000
FMT      ST    R3,FMTRET                                                01020000
         SR    R10,R10                                                  01030000
NEWLINE  LA    R6,16                                                    01040000
         LA    R8,LINE+130                                              01050000
         SR    R11,R11                                                  01060000
NEWBYTE  IC    R10,0(,R4)                                               01070000
         LA    R7,8                                                     01080000
DO       LTR   R10,R10                                                  01090000
         BZ    SKP                                                      01100000
         SRDL  R10,1                                                    01110000
         LTR   R11,R11                                                  01120000
         BZ    ENDO                                                     01130000
FILL     MVI   0(R8),C' '                                               01140000
         SR    R11,R11                                                  01150000
ENDO     BCTR  R8,0                                                     01160000
         BCT   R7,DO                                                    01170000
BACK     BCTR  R4,0                                                     01180000
         BCT   R6,NEWBYTE                                               01190000
         B     ENDLINE                                                  01200000
SKP      SR    R8,R7                                                    01210000
         B     BACK                                                     01220000
ENDLINE  BAL   R3,PRINT                                                 01230000
         LA    R4,32(,R4)                                               01240000
         BCT   R5,NEWLINE                                               01250000
         L     R3,FMTRET                                                01260000
         BR    R3                                                       01270000
         SPACE 3                                                        01280000
PRINT    PUT   OUTDCB,OUTREC                                            01290000
         TR    LINE(132),SWITCH                                         01300000
         MVI   OUTREC,C'+'                                              01310000
         PUT   OUTDCB,OUTREC                                            01320000
         TR    LINE(132),SWITCH                                         01330000
         PUT   OUTDCB,OUTREC                                            01340000
         MVI   OUTREC,C' '                                              01350000
CLEAR    MVI   LINE,C' '                                                01360000
         MVC   LINE+1(131),LINE                                         01370000
         BR    R3                                                       01380000
         EJECT                                                          01390000
R0       EQU   0                                                        01400000
R1       EQU   1                                                        01410000
R2       EQU   2                                                        01420000
R3       EQU   3                                                        01430000
R4       EQU   4                                                        01440000
R5       EQU   5                                                        01450000
R6       EQU   6                                                        01460000
R7       EQU   7                                                        01470000
R8       EQU   8                                                        01480000
R9       EQU   9                                                        01490000
R10      EQU   10                                                       01500000
R11      EQU   11                                                       01510000
R12      EQU   12                                                       01520000
R13      EQU   13                                                       01530000
R14      EQU   14                                                       01540000
R15      EQU   15                                                       01550000
INDCB    DCB   DSORG=PS,MACRF=(GM),EODAD=EOFSYSIN,DDNAME=SYSIN          01560000
OUTDCB   DCB   BLKSIZE=1330,LRECL=133,RECFM=FBA,MACRF=(PM),            X01570000
               DSORG=PS,DDNAME=SYSPRINT                                 01580000
FMTRET   DC    A(0)                                                     01590000
NUMCHAR  DC    A(0)                                                     01600014
PATBASE  DC    A(PATLIN)                                                01610017
CARD     DC    CL80' '                                                  01620014
OUTREC   DS    0CL133                                                   01630000
         DC    C'1'                                                     01640000
LINE     DC    CL132' '                                                 01650000
NEWPG    DC    C'Y'                                                     01660011
SWITCH   DC    CL230' '                                                 01670000
         DC    C'XO'                                                    01680000
         DC    CL24' '                                                  01690000
*                 0 1 2 3 4 5 6 7 8 9 A B C D E F                       01700009
TABLE    DC    X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE' 0                    01710009
         DC    X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE' 1                    01720009
         DC    X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE' 2                    01730009
         DC    X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE' 3                    01740009
         DC    X'98FEFEFEFEFEFEFEFEFE0002FE04FEFE' 4                    01750009
         DC    X'06FEFEFEFEFEFEFEFEFE080AFE0C0EFD' 5                    01760017
         DC    X'10FFFEFEFEFEFEFEFEFEFE12FEFCFE14' 6                    01770017
         DC    X'FEFEFEFEFEFEFEFEFEFE16FEFE18FE1A' 7                    01780009
         DC    X'FE1C1E20222426282A2CFEFEFEFEFEFE' 8                    01790009
         DC    X'FE2E30323436383A3C3EFEFEFEFEFEFE' 9                    01800009
         DC    X'FEFE40424446484A4C4EFEFEFEFEFEFE' A                    01810009
         DC    X'FEFEFEFEFEFEFEFEFEFEFEFEFEFEFEFE' B                    01820009
         DC    X'FE50525456585A5C5E60FEFEFEFEFEFE' C                    01830009
         DC    X'FE626466686A6C6E7072FEFEFEFEFEFE' D                    01840009
         DC    X'FEFE7476787A7C7E8082FEFEFEFEFEFE' E                    01850009
         DC    X'8486888A8C8E90929496FEFEFEFEFEFE' F                    01860009
         DC    0A(0)                                                    01870014
OFFSET   DC    AL2(PATCNT-PATS)                                         01880013
         DC    AL2(PATPER-PATS)                                         01890013
         DC    AL2(PATLP-PATS)                                          01900013
         DC    AL2(PATAMP-PATS)                                         01910013
         DC    AL2(PATEXC-PATS)                                         01920013
         DC    AL2(PATDOL-PATS)                                         01930013
         DC    AL2(PATRP-PATS)                                          01940013
         DC    AL2(PATSEM-PATS)                                         01950013
         DC    AL2(PATDSH-PATS)                                         01960013
         DC    AL2(PATCOM-PATS)                                         01970013
         DC    AL2(PATQUE-PATS)                                         01980013
         DC    AL2(PATCOL-PATS)                                         01990013
         DC    AL2(PATQUO-PATS)                                         02000013
         DC    AL2(PATDQU-PATS)                                         02010013
         DC    AL2(PATAL-PATS)                                          02020013
         DC    AL2(PATBL-PATS)                                          02030013
         DC    AL2(PATCL-PATS)                                          02040013
         DC    AL2(PATDL-PATS)                                          02050013
         DC    AL2(PATEL-PATS)                                          02060013
         DC    AL2(PATFL-PATS)                                          02070013
         DC    AL2(PATGL-PATS)                                          02080013
         DC    AL2(PATHL-PATS)                                          02090013
         DC    AL2(PATIL-PATS)                                          02100013
         DC    AL2(PATJL-PATS)                                          02110013
         DC    AL2(PATKL-PATS)                                          02120013
         DC    AL2(PATLL-PATS)                                          02130013
         DC    AL2(PATML-PATS)                                          02140013
         DC    AL2(PATNL-PATS)                                          02150013
         DC    AL2(PATOL-PATS)                                          02160013
         DC    AL2(PATPL-PATS)                                          02170013
         DC    AL2(PATQL-PATS)                                          02180013
         DC    AL2(PATRL-PATS)                                          02190013
         DC    AL2(PATSL-PATS)                                          02200013
         DC    AL2(PATTL-PATS)                                          02210013
         DC    AL2(PATUL-PATS)                                          02220013
         DC    AL2(PATVL-PATS)                                          02230013
         DC    AL2(PATWL-PATS)                                          02240013
         DC    AL2(PATXL-PATS)                                          02250013
         DC    AL2(PATYL-PATS)                                          02260013
         DC    AL2(PATZL-PATS)                                          02270013
         DC    AL2(PATAU-PATS)                                          02280013
         DC    AL2(PATBU-PATS)                                          02290013
         DC    AL2(PATCU-PATS)                                          02300013
         DC    AL2(PATDU-PATS)                                          02310013
         DC    AL2(PATEU-PATS)                                          02320013
         DC    AL2(PATFU-PATS)                                          02330013
         DC    AL2(PATGU-PATS)                                          02340013
         DC    AL2(PATHU-PATS)                                          02350013
         DC    AL2(PATIU-PATS)                                          02360013
         DC    AL2(PATJU-PATS)                                          02370013
         DC    AL2(PATKU-PATS)                                          02380013
         DC    AL2(PATLU-PATS)                                          02390013
         DC    AL2(PATMU-PATS)                                          02400013
         DC    AL2(PATNU-PATS)                                          02410013
         DC    AL2(PATOU-PATS)                                          02420013
         DC    AL2(PATPU-PATS)                                          02430013
         DC    AL2(PATQU-PATS)                                          02440013
         DC    AL2(PATRU-PATS)                                          02450013
         DC    AL2(PATSU-PATS)                                          02460013
         DC    AL2(PATTU-PATS)                                          02470013
         DC    AL2(PATUU-PATS)                                          02480013
         DC    AL2(PATVU-PATS)                                          02490013
         DC    AL2(PATWU-PATS)                                          02500013
         DC    AL2(PATXU-PATS)                                          02510013
         DC    AL2(PATYU-PATS)                                          02520013
         DC    AL2(PATZU-PATS)                                          02530013
         DC    AL2(PAT0-PATS)                                           02540013
         DC    AL2(PAT1-PATS)                                           02550013
         DC    AL2(PAT2-PATS)                                           02560013
         DC    AL2(PAT3-PATS)                                           02570013
         DC    AL2(PAT4-PATS)                                           02580013
         DC    AL2(PAT5-PATS)                                           02590013
         DC    AL2(PAT6-PATS)                                           02600013
         DC    AL2(PAT7-PATS)                                           02610013
         DC    AL2(PAT8-PATS)                                           02620013
         DC    AL2(PAT9-PATS)                                           02630013
         DC    AL2(PATBLK-PATS)                                         02640013
         DC    AL2(PATSP-PATS)                                          02650013
HEAD     DC    CL22'     ULTRA-GOTHIC'                                  02660000
         DC    CL22'      WRITTEN BY'                                   02670000
         DC    CL22'   JOHN R. ANDREWS'                                 02680000
         DC    CL22'        OF THE'                                     02690000
         DC    CL22'UNIVERSITY OF ILLINOIS'                             02700000
         DC    CL22'          AT'                                       02710000
         DC    CL22'    CHICAGO CIRCLE'                                 02720000
         LTORG                                                          02730000
PATS     DS    0D                                                       02740001
PATLIN   EQU   *                                                        02750017
PATCNT   DC    X'404040404040FFFFF840404040404040'                      02760017
         DC    X'404040404001FFFFFC40404040404040'                      02770017
         DC    X'404040404003FFFFFE40404040404040'                      02780017
         DC    X'404040404007FFFFFF40404040404040'                      02790017
         DC    X'40404040400FFFFFFF80404040404040'                      02800017
         DC    X'40404040401FE04040C0404040404040'                      02810017
         DC    X'40404040403FC0404060404040404040'                      02820017
         DC    X'40404040407F80404030404040404040'                      02830017
         DC    X'4040404040FF40404018404040404040'                      02840017
         DC    X'4040404001FE4040400C404040404040'                      02850017
         DC    X'4040404003FC4040401E404040404040'                      02860017
         DC    X'4040403FFFF84040403FFFC040404040'                      02870017
         DC    X'4040403FFFF04040407FFFC040404040'                      02880017
         DC    X'4040404007F8404040FF404040404040'                      02890017
         DC    X'4040404003FC404001FE404040404040'                      02900017
         DC    X'4040404001FE404003FC404040404040'                      02910017
         DC    X'4040404040FF404007F8404040404040'                      02920017
         DC    X'40404040407F804007F0404040404040'                      02930017
         DC    X'40404040403E404001E0404040404040'                      02940017
         DC    X'40404040401840404040404040404040'                      02950017
PATPER   DC    X'40404001404040404040404040404040'                      02960017
         DC    X'40404001C04040404040404040404040'                      02970017
         DC    X'40404003F04040404040404040404040'                      02980017
         DC    X'4040400FFC4040404040404040404040'                      02990017
         DC    X'4040403FFE4040404040404040404040'                      03000017
         DC    X'4040403FFE4040404040404040404040'                      03010017
         DC    X'4040401FF84040404040404040404040'                      03020017
         DC    X'40404007E04040404040404040404040'                      03030017
         DC    X'40404001C04040404040404040404040'                      03040017
PATLP    DC    X'40404040404040404040402040404040'                      03050017
         DC    X'4040404040FFFFFFFFFFFFF040404040'                      03060017
         DC    X'4040404001FFFFFFFFFFFFF840404040'                      03070017
         DC    X'4040404003FFFFFFFFFFFFFC40404040'                      03080017
         DC    X'4040404007FFFFFFFFFFFFFE40404040'                      03090017
         DC    X'404040400FFFFFFFFFFFFFFF40404040'                      03100017
         DC    X'40404040184040404040400180404040'                      03110017
         DC    X'404040403040404040404040C0404040'                      03120017
         DC    X'40404040604040404040404060404040'                      03130017
         DC    X'40404040C04040404040404030404040'                      03140017
         DC    X'40404001804040404040404018404040'                      03150017
         DC    X'4040400340404040404040400C404040'                      03160017
         DC    X'40404006404040404040404006404040'                      03170017
         DC    X'4040400C404040404040404003404040'                      03180017
         DC    X'40404018404040404040404001804040'                      03190017
         DC    X'40404030404040404040404040C04040'                      03200017
PATAMP   DC    X'40404040404040404020401040404040'                      03210017
         DC    X'4040404001FFFFF0403FFFF840404040'                      03220017
         DC    X'4040404003FFFFF8403FFFFC40404040'                      03230017
         DC    X'4040404007FFFFFC407FFFFE40404040'                      03240017
         DC    X'404040400FFFFFFE40FFFFFF40404040'                      03250017
         DC    X'404040401FFFFFFF40FFFFFF80404040'                      03260017
         DC    X'404040403FFFFFFFC1FFFFFFC0404040'                      03270017
         DC    X'404040407FE04040C3FE404060404040'                      03280017
         DC    X'40404040FFC0404067FC4001F0404040'                      03290017
         DC    X'40404001FF8040403FF84007F8404040'                      03300017
         DC    X'40404003FF4040407FF0400FFC404040'                      03310017
         DC    X'40404007FE404001FFE0403FFE404040'                      03320017
         DC    X'4040400FFC40400FFFC0407FFF404040'                      03330017
         DC    X'4040401FF84040FFFF8040FFFF804040'                      03340017
         DC    X'4040403FF0400FFFFE4040FFFFC04040'                      03350017
         DC    X'4040401FE001FFFFF84041FFF8404040'                      03360017
         DC    X'4040400FC01FFFFFC04041FFE0404040'                      03370017
         DC    X'40404007C1FFFFFF404041FF80404040'                      03380017
         DC    X'404040031FFFFFC0404043FE40404040'                      03390017
         DC    X'40404001FFFFFC40404043FC40404040'                      03400017
         DC    X'40404003FFFFC040404043F840404040'                      03410017
         DC    X'4040400FFFF84040404043F040404040'                      03420017
         DC    X'4040403FFF804040404041E040404040'                      03430017
         DC    X'4040403FF8404040404041C040404040'                      03440017
         DC    X'4040403FEFFFFE404040408040404040'                      03450017
         DC    X'4040403FC7FFFF404040404040404040'                      03460017
         DC    X'4040403FC3FFFF804040404040404040'                      03470017
         DC    X'4040403FC1FFFFC04040404040404040'                      03480017
         DC    X'4040400F80FFFFE04040404040404040'                      03490017
         DC    X'40404007804040404040404040404040'                      03500017
         DC    X'40404001804040404040404040404040'                      03510017
PATEXC   DC    X'404040014040404040404041E0404040'                      03520017
         DC    X'40404001C040404040404040FC404040'                      03530017
         DC    X'40404003F040404040404040FF404040'                      03540017
         DC    X'4040400FFC4040404003FFFFFF804040'                      03550017
         DC    X'4040403FFE1FFFFFFFFFFFFFFFC04040'                      03560017
         DC    X'4040403FFE1FFFFFFFFFFFFFFFC04040'                      03570017
         DC    X'4040401FF8401FFFFFFFFFFFFF804040'                      03580017
         DC    X'40404007E04040403FFFFFFFFF804040'                      03590017
         DC    X'40404001C040404040401FFFFF404040'                      03600017
         DC    X'40404040404040404040407FFC404040'                      03610017
PATDOL   DC    X'404040400E40401FF040404040404040'                      03620017
         DC    X'4040404003C0407FFE40404040404040'                      03630017
         DC    X'4040404001F001FFFFC0404040404040'                      03640017
         DC    X'4040404040F801FF4030404040404040'                      03650017
         DC    X'4040404040FC01FE407C404040404040'                      03660017
         DC    X'4040404040FE03FC40FE404040404040'                      03670017
         DC    X'4040404040FE03FC01FF804040404040'                      03680017
         DC    X'4040403FFFFFFFFFFFFFFFC040404040'                      03690017
         DC    X'4040403FFFFFFFFFFFFFFFC040404040'                      03700017
         DC    X'4040404040FF03FC07FC404040404040'                      03710017
         DC    X'4040404001FF03FC07F8404040404040'                      03720017
         DC    X'4040403FFFFFFFFFFFFFFFC040404040'                      03730017
         DC    X'4040403FFFFFFFFFFFFFFFC040404040'                      03740017
         DC    X'404040400FFC03FC03F8404040404040'                      03750017
         DC    X'4040404003F803FC03F8404040404040'                      03760017
         DC    X'4040404001F007F801F8404040404040'                      03770017
         DC    X'4040404040600FF840F8404040404040'                      03780017
         DC    X'40404040401FFFF8407C404040404040'                      03790017
         DC    X'404040404003FFF0401E404040404040'                      03800017
         DC    X'404040404040FF804047404040404040'                      03810017
PATRP    DC    X'40404030404040404040404040C04040'                      03820017
         DC    X'40404018404040404040404001804040'                      03830017
         DC    X'4040400C404040404040404003404040'                      03840017
         DC    X'40404006404040404040404006404040'                      03850017
         DC    X'4040400340404040404040400C404040'                      03860017
         DC    X'40404001804040404040404018404040'                      03870017
         DC    X'40404040C04040404040404030404040'                      03880017
         DC    X'40404040604040404040404060404040'                      03890017
         DC    X'404040403040404040404040C0404040'                      03900017
         DC    X'40404040184040404040400180404040'                      03910017
         DC    X'404040400FFFFFFFFFFFFFFF40404040'                      03920017
         DC    X'4040404007FFFFFFFFFFFFFE40404040'                      03930017
         DC    X'4040404003FFFFFFFFFFFFFC40404040'                      03940017
         DC    X'4040404001FFFFFFFFFFFFF840404040'                      03950017
         DC    X'4040404040FFFFFFFFFFFFF040404040'                      03960017
         DC    X'40404040404040404040402040404040'                      03970017
PATSEM   DC    X'40404040804040014040404040404040'                      03980017
         DC    X'40404040C0404001C040404040404040'                      03990017
         DC    X'4040404060404003F040404040404040'                      04000017
         DC    X'404048007040400FFC40404040404040'                      04010017
         DC    X'40404C00F840403FFE40404040404040'                      04020017
         DC    X'40404701FC40403FFE40404040404040'                      04030017
         DC    X'404043FFFE40401FF840404040404040'                      04040017
         DC    X'404041FFFC404007E040404040404040'                      04050017
         DC    X'404040FFF8404001C040404040404040'                      04060017
         DC    X'4040403FF04040404040404040404040'                      04070017
         DC    X'40404007E04040404040404040404040'                      04080017
PATDSH   DC    X'4040404040403E404040404040404040'                      04090017
         DC    X'4040404040400FC04040404040404040'                      04100017
         DC    X'40404040404007F04040404040404040'                      04110017
         DC    X'40404040404007F84040404040404040'                      04120017
         DC    X'40404040404007F84040404040404040'                      04130017
         DC    X'40404040404007F84040404040404040'                      04140017
         DC    X'40404040404007F84040404040404040'                      04150017
         DC    X'40404040404007F84040404040404040'                      04160017
         DC    X'40404040404007F84040404040404040'                      04170017
         DC    X'40404040404007F84040404040404040'                      04180017
         DC    X'40404040404007F84040404040404040'                      04190017
         DC    X'40404040404007F84040404040404040'                      04200017
         DC    X'40404040404007F84040404040404040'                      04210017
         DC    X'40404040404007F84040404040404040'                      04220017
         DC    X'40404040404003F84040404040404040'                      04230017
         DC    X'40404040404040FC4040404040404040'                      04240017
         DC    X'404040404040401F4040404040404040'                      04250017
PATCOM   DC    X'40404040804040404040404040404040'                      04260017
         DC    X'40404040C04040404040404040404040'                      04270017
         DC    X'40404040604040404040404040404040'                      04280017
         DC    X'40404800704040404040404040404040'                      04290017
         DC    X'40404C00F84040404040404040404040'                      04300017
         DC    X'40404701FC4040404040404040404040'                      04310017
         DC    X'404043FFFE4040404040404040404040'                      04320017
         DC    X'404041FFFC4040404040404040404040'                      04330017
         DC    X'404040FFF84040404040404040404040'                      04340017
         DC    X'4040403FF04040404040404040404040'                      04350017
         DC    X'40404007E04040404040404040404040'                      04360017
PATQUE   DC    X'40404040404040404040400440404040'                      04370017
         DC    X'40404040404040404007FFFE40404040'                      04380017
         DC    X'4040404040404040400FFFFF40404040'                      04390017
         DC    X'4040404040404040401FFFFF80404040'                      04400017
         DC    X'4040404040404040403FFFFFC0404040'                      04410017
         DC    X'4040404040404040407FFFFFE0404040'                      04420017
         DC    X'4040404040404040403FFFFFF0404040'                      04430017
         DC    X'40404001404003F8401FC04018404040'                      04440017
         DC    X'40404001C0403FFF800F80400C404040'                      04450017
         DC    X'40404003F001FFFFF00740401E404040'                      04460017
         DC    X'4040400FFC07FFFFF80240403F404040'                      04470017
         DC    X'4040403FFE1FFFFFFE4040407F804040'                      04480017
         DC    X'4040403FFE38407FFF404040FFC04040'                      04490017
         DC    X'4040401FF860401FFF804001FF804040'                      04500017
         DC    X'40404007E0404007FF804003FF404040'                      04510017
         DC    X'40404001C0404001FFC04007FE404040'                      04520017
         DC    X'4040404040404040FFE0400FFC404040'                      04530017
         DC    X'40404040404040407FE0401FF8404040'                      04540017
         DC    X'40404040404040403FFFFFFFF0404040'                      04550017
         DC    X'40404040404040401FFFFFFFE0404040'                      04560017
         DC    X'40404040404040401FFFFFFFC0404040'                      04570017
         DC    X'40404040404040400FFFFFFF80404040'                      04580017
         DC    X'40404040404040400FFFFFFF40404040'                      04590017
         DC    X'40404040404040404040404240404040'                      04600017
PATCOL   DC    X'40404001404040014040404040404040'                      04610017
         DC    X'40404001C0404001C040404040404040'                      04620017
         DC    X'40404003F0404003F040404040404040'                      04630017
         DC    X'4040400FFC40400FFC40404040404040'                      04640017
         DC    X'4040403FFE40403FFE40404040404040'                      04650017
         DC    X'4040403FFE40403FFE40404040404040'                      04660017
         DC    X'4040401FF840401FF840404040404040'                      04670017
         DC    X'40404007E0404007E040404040404040'                      04680017
         DC    X'40404001C0404001C040404040404040'                      04690017
PATQUO   DC    X'40404040404040404040404048404040'                      04700017
         DC    X'4040404040404040404040404C404040'                      04710017
         DC    X'4040404040404040404041404E404040'                      04720017
         DC    X'4040404040404040404041801F404040'                      04730017
         DC    X'4040404040404040404040E03F804040'                      04740017
         DC    X'40404040404040404040407FFFC04040'                      04750017
         DC    X'40404040404040404040403FFF804040'                      04760017
         DC    X'40404040404040404040401FFF404040'                      04770017
         DC    X'404040404040404040404007FE404040'                      04780017
         DC    X'404040404040404040404041FC404040'                      04790017
PATDQU   DC    X'404040404040404040404041F8404040'                      04800017
         DC    X'404040404040404040404047FE404040'                      04810017
         DC    X'40404040404040404040401FFF404040'                      04820017
         DC    X'40404040404040404040403FFF804040'                      04830017
         DC    X'40404040404040404040407FFFC04040'                      04840017
         DC    X'4040404040404040404040E03F804040'                      04850017
         DC    X'4040404040404040404041801F404040'                      04860017
         DC    X'4040404040404040404041400E404040'                      04870017
         DC    X'4040404040404040404040400C404040'                      04880017
         DC    X'40404040404040404040404008404040'                      04890017
         DC    X'40404040404040404040404040404040'                      04900017
         DC    X'404040404040404040404041F8404040'                      04910017
         DC    X'404040404040404040404047FE404040'                      04920017
         DC    X'40404040404040404040401FFF404040'                      04930017
         DC    X'40404040404040404040403FFF804040'                      04940017
         DC    X'40404040404040404040407FFFC04040'                      04950017
         DC    X'4040404040404040404040E03F804040'                      04960017
         DC    X'4040404040404040404041801F404040'                      04970017
         DC    X'4040404040404040404041400E404040'                      04980017
         DC    X'4040404040404040404040400C404040'                      04990017
         DC    X'40404040404040404040404008404040'                      05000017
PATAL    DC    X'404040407FFF80064040404040404040'                      05010017
         DC    X'40404040FFFF80034040404040404040'                      05020017
         DC    X'40404001FFFFC0018040404040404040'                      05030017
         DC    X'40404003FFFFC040C040404040404040'                      05040017
         DC    X'40404007FFFFE0406040404040404040'                      05050017
         DC    X'4040400FF04020403040404040404040'                      05060017
         DC    X'4040401FE04030407840404040404040'                      05070017
         DC    X'4040403FC0401040FC40404040404040'                      05080017
         DC    X'4040401F80401801FE40404040404040'                      05090017
         DC    X'4040400F40400803FC40404040404040'                      05100017
         DC    X'4040400740400C07F840404040404040'                      05110017
         DC    X'404040038040040FF040404040404040'                      05120017
         DC    X'40404001FFFFFFFFE040404040404040'                      05130017
         DC    X'40404003FFFFFFFFC040404040404040'                      05140017
         DC    X'40404007FFFFFFFF8040404040404040'                      05150017
         DC    X'4040400FFFFFFFFF4040404040404040'                      05160017
         DC    X'4040401FFFFFFFFE4040404040404040'                      05170017
         DC    X'4040403FC04040404040404040404040'                      05180017
         DC    X'4040400F804040404040404040404040'                      05190017
         DC    X'40404003404040404040404040404040'                      05200017
PATBL    DC    X'40404040404040404040401040404040'                      05210017
         DC    X'40404040404040404040403840404040'                      05220017
         DC    X'404040407FFFFFFFFFFFFFFC40404040'                      05230017
         DC    X'40404040FFFFFFFFFFFFFFFE40404040'                      05240017
         DC    X'40404001FFFFFFFFFFFFFFFF40404040'                      05250017
         DC    X'40404003FFFFFFFFFFFFFFFE40404040'                      05260017
         DC    X'40404007FFFFFFFFFFFFFFFC40404040'                      05270017
         DC    X'4040400FF0404040C040403840404040'                      05280017
         DC    X'4040401FE04040406040401040404040'                      05290017
         DC    X'4040403FC04040403040404040404040'                      05300017
         DC    X'4040401F804040407840404040404040'                      05310017
         DC    X'4040400F40404040FC40404040404040'                      05320017
         DC    X'4040400640404001FE40404040404040'                      05330017
         DC    X'4040400340404003FC40404040404040'                      05340017
         DC    X'4040400180404007F840404040404040'                      05350017
         DC    X'40404040FFFFFFFFF040404040404040'                      05360017
         DC    X'404040407FFFFFFFE040404040404040'                      05370017
         DC    X'404040403FFFFFFFC040404040404040'                      05380017
         DC    X'404040401FFFFFFF8040404040404040'                      05390017
         DC    X'404040400FFFFFFF4040404040404040'                      05400017
PATCL    DC    X'4040404003FFFFE04040404040404040'                      05410017
         DC    X'4040404007FFFFF04040404040404040'                      05420017
         DC    X'404040400FFFFFF84040404040404040'                      05430017
         DC    X'404040401FFFFFFC4040404040404040'                      05440017
         DC    X'404040403FFFFFFE4040404040404040'                      05450017
         DC    X'404040407F8040034040404040404040'                      05460017
         DC    X'40404040FF4040018040404040404040'                      05470017
         DC    X'40404001FE404040C040404040404040'                      05480017
         DC    X'40404003FC4040406040404040404040'                      05490017
         DC    X'40404007F84040403040404040404040'                      05500017
         DC    X'4040400FF04040407840404040404040'                      05510017
         DC    X'4040401FE0404040FC40404040404040'                      05520017
         DC    X'4040403FC0404001FE40404040404040'                      05530017
         DC    X'4040401FE0404003FC40404040404040'                      05540017
         DC    X'4040400FF0404007F840404040404040'                      05550017
         DC    X'40404007F840400FF040404040404040'                      05560017
         DC    X'40404003FC40401FE040404040404040'                      05570017
         DC    X'40404001FE40401FC040404040404040'                      05580017
         DC    X'40404040F84040078040404040404040'                      05590017
         DC    X'40404040604040410040404040404040'                      05600017
PATDL    DC    X'404040407FFFFFF84040404040404040'                      05610017
         DC    X'40404040FFFFFFFC4040402040404040'                      05620017
         DC    X'40404001FFFFFFFE404040F840404040'                      05630017
         DC    X'40404003FFFFFFFF404003FE40404040'                      05640017
         DC    X'40404007FFFFFFFF80400FFF40404040'                      05650017
         DC    X'4040400FF0404040C0403FFE40404040'                      05660017
         DC    X'4040401FE04040406040FFF840404040'                      05670017
         DC    X'4040403FC04040403003FFE040404040'                      05680017
         DC    X'4040401F80404040180FFF8040404040'                      05690017
         DC    X'4040400F404040400C3FFE4040404040'                      05700017
         DC    X'404040064040404006FFF84040404040'                      05710017
         DC    X'404040034040404003FFE04040404040'                      05720017
         DC    X'40404001804040400FFF804040404040'                      05730017
         DC    X'40404003FFFFFFFFFFFE404040404040'                      05740017
         DC    X'40404007FFFFFFFFFFF8404040404040'                      05750017
         DC    X'4040400FFFFFFFFFFFE0404040404040'                      05760017
         DC    X'4040401FFFFFFFFFFF80404040404040'                      05770017
         DC    X'4040403FFFFFFFFFFE40404040404040'                      05780017
         DC    X'4040400F404040404040404040404040'                      05790017
         DC    X'40404002404040404040404040404040'                      05800017
PATEL    DC    X'4040404003FFFFE04040404040404040'                      05810017
         DC    X'4040404007FFFFF04040404040404040'                      05820017
         DC    X'404040400FFFFFF84040404040404040'                      05830017
         DC    X'404040401FFFFFFC4040404040404040'                      05840017
         DC    X'404040403FFFFFFE4040404040404040'                      05850017
         DC    X'404040407F80C0034040404040404040'                      05860017
         DC    X'40404040FF4060018040404040404040'                      05870017
         DC    X'40404001FE403040C040404040404040'                      05880017
         DC    X'40404003FC4018406040404040404040'                      05890017
         DC    X'40404007F8400C403040404040404040'                      05900017
         DC    X'4040400FF04006407840404040404040'                      05910017
         DC    X'4040401FE0400340FC40404040404040'                      05920017
         DC    X'4040403FC04001C1FE40404040404040'                      05930017
         DC    X'4040401FE04040C3FC40404040404040'                      05940017
         DC    X'4040400FF0404067F840404040404040'                      05950017
         DC    X'40404007F840403FF040404040404040'                      05960017
         DC    X'40404003FC40401FE040404040404040'                      05970017
         DC    X'40404001FE40400FC040404040404040'                      05980017
         DC    X'40404040F84040078040404040404040'                      05990017
         DC    X'40404040304040410040404040404040'                      06000017
PATFL    DC    X'40404040404040044040404040404040'                      06010017
         DC    X'40404040404040074040404040404040'                      06020017
         DC    X'4040404040404007C040404040404040'                      06030017
         DC    X'4040404040404007F040404040404040'                      06040017
         DC    X'4040400440404007F840404040404040'                      06050017
         DC    X'4040400FFFFFFFFFFFFFFE4040404040'                      06060017
         DC    X'4040401FFFFFFFFFFFFFFF4040404040'                      06070017
         DC    X'4040403FFFFFFFFFFFFFFF8040404040'                      06080017
         DC    X'4040401FFFFFFFFFFFFFFFC040404040'                      06090017
         DC    X'4040400FFFFFFFFFFFFFFFE040404040'                      06100017
         DC    X'4040400440404007F840403040404040'                      06110017
         DC    X'4040404040404007F840401840404040'                      06120017
         DC    X'4040404040404003F840403C40404040'                      06130017
         DC    X'4040404040404040F840407E40404040'                      06140017
         DC    X'4040404040404040384040FF40404040'                      06150017
         DC    X'404040404040404008403FFE40404040'                      06160017
         DC    X'404040404040404040403FFC40404040'                      06170017
         DC    X'404040404040404040403FF840404040'                      06180017
         DC    X'404040404040404040403FF040404040'                      06190017
         DC    X'404040404040404040403FE040404040'                      06200017
PATGL    DC    X'403F40407FFFFFF84040404040404040'                      06210017
         DC    X'407F4040FFFFFFFC4040404040404040'                      06220017
         DC    X'40FF4001FFFFFFFE4040404040404040'                      06230017
         DC    X'01FF4003FFFFFFFF4040404040404040'                      06240017
         DC    X'03FF4007FFFFFFFF8040404040404040'                      06250017
         DC    X'07F0400FF0404040C040404040404040'                      06260017
         DC    X'0FE0401FE04040406040404040404040'                      06270017
         DC    X'1FC0403FC04040403040404040404040'                      06280017
         DC    X'3F80401F804040407840404040404040'                      06290017
         DC    X'7F40400F40404040FC40404040404040'                      06300017
         DC    X'3E40400640404001FE40404040404040'                      06310017
         DC    X'1C40400340404003FC40404040404040'                      06320017
         DC    X'0C40400180404007F840404040404040'                      06330017
         DC    X'07FFFFFFFFFFFFFFF040404040404040'                      06340017
         DC    X'03FFFFFFFFFFFFFFE040404040404040'                      06350017
         DC    X'01FFFFFFFFFFFFFFC040404040404040'                      06360017
         DC    X'40FFFFFFFFFFFFFF8040404040404040'                      06370017
         DC    X'407FFFFFFFFFFFFF4040404040404040'                      06380017
PATHL    DC    X'40404040404040404040401040404040'                      06390017
         DC    X'40404004404040404040403840404040'                      06400017
         DC    X'4040400FFFFFFFFFFFFFFFFC40404040'                      06410017
         DC    X'4040401FFFFFFFFFFFFFFFFE40404040'                      06420017
         DC    X'4040403FFFFFFFFFFFFFFFFF40404040'                      06430017
         DC    X'4040401FFFFFFFFFFFFFFFFE40404040'                      06440017
         DC    X'4040400FFFFFFFFFFFFFFFFC40404040'                      06450017
         DC    X'40404004404040018040403840404040'                      06460017
         DC    X'40404040404040406040401040404040'                      06470017
         DC    X'40404040404040403040404040404040'                      06480017
         DC    X'40404040404040407840404040404040'                      06490017
         DC    X'4040404040404040FC40404040404040'                      06500017
         DC    X'4040404040404001FE40404040404040'                      06510017
         DC    X'4040400440404003FC40404040404040'                      06520017
         DC    X'4040400FFFFFFFFFF840404040404040'                      06530017
         DC    X'4040401FFFFFFFFFF040404040404040'                      06540017
         DC    X'4040403FFFFFFFFFE040404040404040'                      06550017
         DC    X'4040401FFFFFFFFFC040404040404040'                      06560017
         DC    X'4040400FFFFFFFFF8040404040404040'                      06570017
         DC    X'40404004404040404040404040404040'                      06580017
PATIL    DC    X'40404040404040401004404040404040'                      06590017
         DC    X'40404003FFFFFFFFF80E404040404040'                      06600017
         DC    X'40404007FFFFFFFFFC1F404040404040'                      06610017
         DC    X'4040400FFFFFFFFFFE3F804040404040'                      06620017
         DC    X'4040401FFFFFFFFFFC1F404040404040'                      06630017
         DC    X'4040403FFFFFFFFFF80E404040404040'                      06640017
         DC    X'4040401FC04040401004404040404040'                      06650017
         DC    X'4040400F804040404040404040404040'                      06660017
         DC    X'40404007404040404040404040404040'                      06670017
         DC    X'40404003404040404040404040404040'                      06680017
PATJL    DC    X'407F4040404040404040404040404040'                      06690017
         DC    X'40FF4040404040404040404040404040'                      06700017
         DC    X'01FF4040404040404040404040404040'                      06710017
         DC    X'03FF4040404040404040404040404040'                      06720017
         DC    X'07FF4040404040404040404040404040'                      06730017
         DC    X'0FE04040404040404040404040404040'                      06740017
         DC    X'1FC04040404040404040404040404040'                      06750017
         DC    X'3F804040404040404040404040404040'                      06760017
         DC    X'7F404040404040404040404040404040'                      06770017
         DC    X'3E404040404040404040404040404040'                      06780017
         DC    X'1C404040404040404040404040404040'                      06790017
         DC    X'0C404040404040404040404040404040'                      06800017
         DC    X'06404040404040401004404040404040'                      06810017
         DC    X'03FFFFFFFFFFFFFFF80E404040404040'                      06820017
         DC    X'01FFFFFFFFFFFFFFFC1F404040404040'                      06830017
         DC    X'40FFFFFFFFFFFFFFFE3F804040404040'                      06840017
         DC    X'407FFFFFFFFFFFFFFC1F404040404040'                      06850017
         DC    X'403FFFFFFFFFFFFFF80E404040404040'                      06860017
         DC    X'40404040404040401004404040404040'                      06870017
PATKL    DC    X'40404040404040404040401040404040'                      06880017
         DC    X'40404004404040404040403840404040'                      06890017
         DC    X'4040400FFFFFFFFFFFFFFFFC40404040'                      06900017
         DC    X'4040401FFFFFFFFFFFFFFFFE40404040'                      06910017
         DC    X'4040403FFFFFFFFFFFFFFFFF40404040'                      06920017
         DC    X'4040401FFFFFFFFFFFFFFFFE40404040'                      06930017
         DC    X'4040400FFFFFFFFFFFFFFFFC40404040'                      06940017
         DC    X'404040044040C040C040403840404040'                      06950017
         DC    X'40404040404040406040401040404040'                      06960017
         DC    X'404040404040E0403040404040404040'                      06970017
         DC    X'404040404001E0407840404040404040'                      06980017
         DC    X'404040404003F040FC40404040404040'                      06990017
         DC    X'404040404007F001FE40404040404040'                      07000017
         DC    X'40404004400FF803FC40404040404040'                      07010017
         DC    X'4040400FFFFFE807F840404040404040'                      07020017
         DC    X'4040401FFFFFCFFFF040404040404040'                      07030017
         DC    X'4040403FFFFFC7FFE040404040404040'                      07040017
         DC    X'4040401FFFFF07FFC040404040404040'                      07050017
         DC    X'4040400FFFFE03FF8040404040404040'                      07060017
         DC    X'40404004404003FF0040404040404040'                      07070017
PATLL    DC    X'40404004404040404040400840404040'                      07080017
         DC    X'4040400FFFFFFFFFFFFFFFFC40404040'                      07090017
         DC    X'4040401FFFFFFFFFFFFFFFFE40404040'                      07100017
         DC    X'4040403FFFFFFFFFFFFFFFFF40404040'                      07110017
         DC    X'4040401FFFFFFFFFFFFFFFFE40404040'                      07120017
         DC    X'4040400FFFFFFFFFFFFFFFFC40404040'                      07130017
         DC    X'40404004404040404040400840404040'                      07140017
PATML    DC    X'40404040404040408040404040404040'                      07150017
         DC    X'4040400440404040E040404040404040'                      07160017
         DC    X'4040400FFFFFFFFFF840404040404040'                      07170017
         DC    X'4040401FFFFFFFFFFE40404040404040'                      07180017
         DC    X'4040403FFFFFFFFFFE40404040404040'                      07190017
         DC    X'4040401FFFFFFFFFF840404040404040'                      07200017
         DC    X'4040400FFFFFFFFFE040404040404040'                      07210017
         DC    X'40404004404040018040404040404040'                      07220017
         DC    X'4040404040404040C040404040404040'                      07230017
         DC    X'40404040404040406040404040404040'                      07240017
         DC    X'40404040404040403040404040404040'                      07250017
         DC    X'40404040404040407840404040404040'                      07260017
         DC    X'4040404040404040FC40404040404040'                      07270017
         DC    X'4040400440404001FE40404040404040'                      07280017
         DC    X'4040400FFFFFFFFFFC40404040404040'                      07290017
         DC    X'4040401FFFFFFFFFF840404040404040'                      07300017
         DC    X'4040403FFFFFFFFFF040404040404040'                      07310017
         DC    X'4040401FFFFFFFFFE040404040404040'                      07320017
         DC    X'4040400FFFFFFFFFC040404040404040'                      07330017
         DC    X'40404004404040406040404040404040'                      07340017
         DC    X'40404040404040403040404040404040'                      07350017
         DC    X'40404040404040407840404040404040'                      07360017
         DC    X'4040404040404040FC40404040404040'                      07370017
         DC    X'4040400440404001FE40404040404040'                      07380017
         DC    X'4040400FFFFFFFFFFC40404040404040'                      07390017
         DC    X'4040401FFFFFFFFFF840404040404040'                      07400017
         DC    X'4040403FFFFFFFFFF040404040404040'                      07410017
         DC    X'4040401FFFFFFFFFE040404040404040'                      07420017
         DC    X'4040400FFFFFFFFFC040404040404040'                      07430017
         DC    X'40404004404040404040404040404040'                      07440017
PATNL    DC    X'40404040404040408040404040404040'                      07450017
         DC    X'4040400440404040E040404040404040'                      07460017
         DC    X'4040400FFFFFFFFFF840404040404040'                      07470017
         DC    X'4040401FFFFFFFFFFE40404040404040'                      07480017
         DC    X'4040403FFFFFFFFFFE40404040404040'                      07490017
         DC    X'4040401FFFFFFFFFF840404040404040'                      07500017
         DC    X'4040400FFFFFFFFFE040404040404040'                      07510017
         DC    X'40404004404040018040404040404040'                      07520017
         DC    X'4040404040404040C040404040404040'                      07530017
         DC    X'40404040404040406040404040404040'                      07540017
         DC    X'40404040404040403040404040404040'                      07550017
         DC    X'40404040404040407840404040404040'                      07560017
         DC    X'4040404040404040FC40404040404040'                      07570017
         DC    X'4040400440404001FE40404040404040'                      07580017
         DC    X'4040400FFFFFFFFFFC40404040404040'                      07590017
         DC    X'4040401FFFFFFFFFF840404040404040'                      07600017
         DC    X'4040403FFFFFFFFFF040404040404040'                      07610017
         DC    X'4040401FFFFFFFFFE040404040404040'                      07620017
         DC    X'4040400FFFFFFFFFC040404040404040'                      07630017
         DC    X'40404004404040404040404040404040'                      07640017
PATOL    DC    X'404040401FFFFFF84040404040404040'                      07650017
         DC    X'404040403FFFFFFC4040404040404040'                      07660017
         DC    X'404040407FFFFFFE4040404040404040'                      07670017
         DC    X'40404040FFFFFFFF4040404040404040'                      07680017
         DC    X'40404001FFFFFFFF8040404040404040'                      07690017
         DC    X'40404003FC404040C040404040404040'                      07700017
         DC    X'40404007F84040406040404040404040'                      07710017
         DC    X'4040400FF04040403040404040404040'                      07720017
         DC    X'4040401FE04040407840404040404040'                      07730017
         DC    X'4040403FC0404040FC40404040404040'                      07740017
         DC    X'4040401F80404001FE40404040404040'                      07750017
         DC    X'4040400F40404003FC40404040404040'                      07760017
         DC    X'4040400640404007F840404040404040'                      07770017
         DC    X'404040034040400FF040404040404040'                      07780017
         DC    X'404040018040401FE040404040404040'                      07790017
         DC    X'40404040FFFFFFFFC040404040404040'                      07800017
         DC    X'404040407FFFFFFF8040404040404040'                      07810017
         DC    X'404040403FFFFFFF4040404040404040'                      07820017
         DC    X'404040401FFFFFFE4040404040404040'                      07830017
         DC    X'404040400FFFFFFC4040404040404040'                      07840017
PATPL    DC    X'04404040404040402040404040404040'                      07850017
         DC    X'0E404040404040407040404040404040'                      07860017
         DC    X'1FFFFFFFFFFFFFFFF840404040404040'                      07870017
         DC    X'3FFFFFFFFFFFFFFFFC40404040404040'                      07880017
         DC    X'7FFFFFFFFFFFFFFFFE40404040404040'                      07890017
         DC    X'3FFFFFFFFFFFFFFFF840404040404040'                      07900017
         DC    X'1FFFFFFFFFFFFFFFE040404040404040'                      07910017
         DC    X'0E40400FF0404040C040404040404040'                      07920017
         DC    X'0440401FE04040406040404040404040'                      07930017
         DC    X'4040403FC04040403040404040404040'                      07940017
         DC    X'4040401F804040407840404040404040'                      07950017
         DC    X'4040400F40404040FC40404040404040'                      07960017
         DC    X'4040400640404001FE40404040404040'                      07970017
         DC    X'4040400340404003FC40404040404040'                      07980017
         DC    X'4040400180404007F840404040404040'                      07990017
         DC    X'40404040FFFFFFFFF040404040404040'                      08000017
         DC    X'404040407FFFFFFFE040404040404040'                      08010017
         DC    X'404040403FFFFFFFC040404040404040'                      08020017
         DC    X'404040401FFFFFFF8040404040404040'                      08030017
         DC    X'404040400FFFFFFF0040404040404040'                      08040017
PATQL    DC    X'404040407FFFFFF84040404040404040'                      08050017
         DC    X'40404040FFFFFFFC4040404040404040'                      08060017
         DC    X'40404001FFFFFFFE4040404040404040'                      08070017
         DC    X'40404003FFFFFFFF4040404040404040'                      08080017
         DC    X'40404007FFFFFFFF8040404040404040'                      08090017
         DC    X'4040400FF0404040C040404040404040'                      08100017
         DC    X'4040401FE04040406040404040404040'                      08110017
         DC    X'4040403FC04040403040404040404040'                      08120017
         DC    X'4040401F804040407840404040404040'                      08130017
         DC    X'4040400F40404040FC40404040404040'                      08140017
         DC    X'4040400640404001FE40404040404040'                      08150017
         DC    X'0440400340404003FC40404040404040'                      08160017
         DC    X'0E40400180404007F840404040404040'                      08170017
         DC    X'1FFFFFFFFFFFFFFFF040404040404040'                      08180017
         DC    X'3FFFFFFFFFFFFFFFE040404040404040'                      08190017
         DC    X'7FFFFFFFFFFFFFFFC040404040404040'                      08200017
         DC    X'3FFFFFFFFFFFFFFF8040404040404040'                      08210017
         DC    X'1FFFFFFFFFFFFFFF4040404040404040'                      08220017
         DC    X'0E404040404040404040404040404040'                      08230017
         DC    X'04404040404040404040404040404040'                      08240017
PATRL    DC    X'40404040404040408040404040404040'                      08250017
         DC    X'4040400440404040E040404040404040'                      08260017
         DC    X'4040400FFFFFFFFFF840404040404040'                      08270017
         DC    X'4040401FFFFFFFFFFE40404040404040'                      08280017
         DC    X'4040403FFFFFFFFFFE40404040404040'                      08290017
         DC    X'4040401FFFFFFFFFF840404040404040'                      08300017
         DC    X'4040400FFFFFFFFFE040404040404040'                      08310017
         DC    X'40404004404040018040404040404040'                      08320017
         DC    X'4040404040404040C040404040404040'                      08330017
         DC    X'40404040404040406040404040404040'                      08340017
         DC    X'40404040404040403040404040404040'                      08350017
         DC    X'40404040404040407840404040404040'                      08360017
         DC    X'4040404040404040FC40404040404040'                      08370017
         DC    X'4040404040404001FE40404040404040'                      08380017
         DC    X'4040404040404003FC40404040404040'                      08390017
         DC    X'404040404040403FF840404040404040'                      08400017
         DC    X'404040404040403FF040404040404040'                      08410017
         DC    X'404040404040403FE040404040404040'                      08420017
         DC    X'404040404040403FC040404040404040'                      08430017
         DC    X'404040404040403F8040404040404040'                      08440017
PATSL    DC    X'4040403840407FC04040404040404040'                      08450017
         DC    X'4040400F4001FFF84040404040404040'                      08460017
         DC    X'40404007C007FFFF4040404040404040'                      08470017
         DC    X'40404003E007FC40C040404040404040'                      08480017
         DC    X'40404003F007F801F040404040404040'                      08490017
         DC    X'40404003F80FF003F840404040404040'                      08500017
         DC    X'40404003F80FF007FE40404040404040'                      08510017
         DC    X'40404003FC0FF00FFC40404040404040'                      08520017
         DC    X'40404003FC0FF00FF840404040404040'                      08530017
         DC    X'40404003FC0FF01FF040404040404040'                      08540017
         DC    X'40404007FC0FF01FE040404040404040'                      08550017
         DC    X'4040400FF80FF01FE040404040404040'                      08560017
         DC    X'4040401FF80FF01FE040404040404040'                      08570017
         DC    X'4040403FF00FF00FE040404040404040'                      08580017
         DC    X'4040400FE00FF00FE040404040404040'                      08590017
         DC    X'40404007C01FE007E040404040404040'                      08600017
         DC    X'40404001803FE003E040404040404040'                      08610017
         DC    X'404040407FFFE001F040404040404040'                      08620017
         DC    X'404040400FFFC0407840404040404040'                      08630017
         DC    X'4040404001FF80400C40404040404040'                      08640017
PATTL    DC    X'40404040404040400440404040404040'                      08650017
         DC    X'40404040404040400640404040404040'                      08660017
         DC    X'40404040404040400740404040404040'                      08670017
         DC    X'40404040404040400780404040404040'                      08680017
         DC    X'404040404040404007C0404040404040'                      08690017
         DC    X'404040404040404007E0404040404040'                      08700017
         DC    X'404040404040404007F0404040404040'                      08710017
         DC    X'40404003FFFFFFFFFFFFF04040404040'                      08720017
         DC    X'40404007FFFFFFFFFFFFF84040404040'                      08730017
         DC    X'4040400FFFFFFFFFFFFFFC4040404040'                      08740017
         DC    X'4040401FFFFFFFFFFFFFFE4040404040'                      08750017
         DC    X'4040403FFFFFFFFFFFFFFF4040404040'                      08760017
         DC    X'4040401F8040404007F0404040404040'                      08770017
         DC    X'4040400F4040404003F0404040404040'                      08780017
         DC    X'404040064040404001F0404040404040'                      08790017
         DC    X'404040034040404040F0404040404040'                      08800017
         DC    X'40404001804040404070404040404040'                      08810017
         DC    X'40404040404040404030404040404040'                      08820017
         DC    X'40404040404040404010404040404040'                      08830017
PATUL    DC    X'40404040404040402040404040404040'                      08840017
         DC    X'40404040404040407840404040404040'                      08850017
         DC    X'40404003FFFFFFFFFE40404040404040'                      08860017
         DC    X'40404007FFFFFFFFFC40404040404040'                      08870017
         DC    X'4040400FFFFFFFFFF840404040404040'                      08880017
         DC    X'4040401FFFFFFFFFF040404040404040'                      08890017
         DC    X'4040403FFFFFFFFFE040404040404040'                      08900017
         DC    X'4040401F804040404040404040404040'                      08910017
         DC    X'4040400F404040404040404040404040'                      08920017
         DC    X'40404006404040404040404040404040'                      08930017
         DC    X'40404003404040404040404040404040'                      08940017
         DC    X'40404001804040402040404040404040'                      08950017
         DC    X'40404001C04040407840404040404040'                      08960017
         DC    X'40404003FFFFFFFFFE40404040404040'                      08970017
         DC    X'4040400FFFFFFFFFFC40404040404040'                      08980017
         DC    X'4040403FFFFFFFFFF840404040404040'                      08990017
         DC    X'4040403FFFFFFFFFF040404040404040'                      09000017
         DC    X'4040400FFFFFFFFFE040404040404040'                      09010017
         DC    X'40404003804040404040404040404040'                      09020017
         DC    X'40404001004040404040404040404040'                      09030017
PATVL    DC    X'40404040404040402040404040404040'                      09040017
         DC    X'40404040404040407840404040404040'                      09050017
         DC    X'404040403FFFFFFFFE40404040404040'                      09060017
         DC    X'404040407FFFFFFFFC40404040404040'                      09070017
         DC    X'40404040FFFFFFFFF840404040404040'                      09080017
         DC    X'40404001FFFFFFFFF040404040404040'                      09090017
         DC    X'40404003FFFFFFFFE040404040404040'                      09100017
         DC    X'40404007F84040401040404040404040'                      09110017
         DC    X'4040400FF04040400840404040404040'                      09120017
         DC    X'4040401FE04040400C40404040404040'                      09130017
         DC    X'4040403FC04040401E40404040404040'                      09140017
         DC    X'4040401F804040403F40404040404040'                      09150017
         DC    X'4040400F404040407F80404040404040'                      09160017
         DC    X'4040400340404040FFC0404040404040'                      09170017
         DC    X'40404001E0404003FFE0404040404040'                      09180017
         DC    X'404040407840401FFFC0404040404040'                      09190017
         DC    X'404040401F8001FFFF80404040404040'                      09200017
         DC    X'4040404007FFFFFFFE40404040404040'                      09210017
         DC    X'4040404040FFFFFFF840404040404040'                      09220017
         DC    X'40404040401FFFFFC040404040404040'                      09230017
         DC    X'404040404003FFFE0040404040404040'                      09240017
PATWL    DC    X'40404040404040401040404040404040'                      09250017
         DC    X'40404001FFFFFFFFF840404040404040'                      09260017
         DC    X'40404003FFFFFFFFFC40404040404040'                      09270017
         DC    X'40404007FFFFFFFFFE40404040404040'                      09280017
         DC    X'4040400FFFFFFFFFFC40404040404040'                      09290017
         DC    X'4040401FFFFFFFFFF840404040404040'                      09300017
         DC    X'4040403FC04040401040404040404040'                      09310017
         DC    X'4040401F804040404040404040404040'                      09320017
         DC    X'4040400F404040404040404040404040'                      09330017
         DC    X'40404006404040404040404040404040'                      09340017
         DC    X'40404003404040401040404040404040'                      09350017
         DC    X'40404001FFFFFFFFF840404040404040'                      09360017
         DC    X'40404003FFFFFFFFFC40404040404040'                      09370017
         DC    X'40404007FFFFFFFFFE40404040404040'                      09380017
         DC    X'4040400FFFFFFFFFFC40404040404040'                      09390017
         DC    X'4040401FFFFFFFFFF840404040404040'                      09400017
         DC    X'4040403FC04040401040404040404040'                      09410017
         DC    X'4040400F404040404040404040404040'                      09420017
         DC    X'40404006404040404040404040404040'                      09430017
         DC    X'40404003404040401040404040404040'                      09440017
         DC    X'40404001FFFFFFFFF840404040404040'                      09450017
         DC    X'40404040FFFFFFFFFC40404040404040'                      09460017
         DC    X'404040407FFFFFFFFE40404040404040'                      09470017
         DC    X'404040403FFFFFFFFC40404040404040'                      09480017
         DC    X'404040401FFFFFFFF840404040404040'                      09490017
         DC    X'40404040404040401040404040404040'                      09500017
PATXL    DC    X'40404020404040400840404040404040'                      09510017
         DC    X'40404018404040400C40404040404040'                      09520017
         DC    X'4040400E404040400E40404040404040'                      09530017
         DC    X'4040401F404040401E40404040404040'                      09540017
         DC    X'4040403F404040403E40404040404040'                      09550017
         DC    X'40404007E0404040FC40404040404040'                      09560017
         DC    X'404040403E404007F840404040404040'                      09570017
         DC    X'4040404007C00FFFF040404040404040'                      09580017
         DC    X'40404040407FFFFFE040404040404040'                      09590017
         DC    X'404040401FFFFFFF8040404040404040'                      09600017
         DC    X'40404040FFFFFFFC4040404040404040'                      09610017
         DC    X'40404003FFFFFF804040404040404040'                      09620017
         DC    X'40404007FFFC01F04040404040404040'                      09630017
         DC    X'4040400FF840403E4040404040404040'                      09640017
         DC    X'4040401F80404003F040404040404040'                      09650017
         DC    X'4040403E404040407E40404040404040'                      09660017
         DC    X'4040403C404040407C40404040404040'                      09670017
         DC    X'40404038404040403840404040404040'                      09680017
         DC    X'40404018404040400C40404040404040'                      09690017
         DC    X'40404004404040400440404040404040'                      09700017
PATYL    DC    X'40404040404040402040404040404040'                      09710017
         DC    X'40404040404040407840404040404040'                      09720017
         DC    X'40FF4003FFFFFFFFFE40404040404040'                      09730017
         DC    X'01FF4007FFFFFFFFFC40404040404040'                      09740017
         DC    X'03FF400FFFFFFFFFF840404040404040'                      09750017
         DC    X'07FF401FFFFFFFFFF040404040404040'                      09760017
         DC    X'0FFF403FFFFFFFFFE040404040404040'                      09770017
         DC    X'1FC0401E404040404040404040404040'                      09780017
         DC    X'3F80400C404040404040404040404040'                      09790017
         DC    X'7F404006404040404040404040404040'                      09800017
         DC    X'3E404003404040404040404040404040'                      09810017
         DC    X'1C404001804040402040404040404040'                      09820017
         DC    X'0C404040C04040407840404040404040'                      09830017
         DC    X'07FFFFFFFFFFFFFFFE40404040404040'                      09840017
         DC    X'03FFFFFFFFFFFFFFFC40404040404040'                      09850017
         DC    X'01FFFFFFFFFFFFFFF840404040404040'                      09860017
         DC    X'40FFFFFFFFFFFFFFF040404040404040'                      09870017
         DC    X'407FFFFFFFFFFFFFE040404040404040'                      09880017
PATZL    DC    X'40404038404040014040404040404040'                      09890017
         DC    X'4040403E40404001C040404040404040'                      09900017
         DC    X'4040401F80404001F040404040404040'                      09910017
         DC    X'4040401F60404003FC40404040404040'                      09920017
         DC    X'4040400F8C404003FE40404040404040'                      09930017
         DC    X'4040400FC3404003FC40404040404040'                      09940017
         DC    X'4040400FC0C04003F840404040404040'                      09950017
         DC    X'4040400FC0184003F840404040404040'                      09960017
         DC    X'4040400FE0064003F840404040404040'                      09970017
         DC    X'4040400FE0018003F840404040404040'                      09980017
         DC    X'4040400FE0403003F840404040404040'                      09990017
         DC    X'4040400FE0400C03F840404040404040'                      10000017
         DC    X'4040400FE04001C1F840404040404040'                      10010017
         DC    X'4040400FE0404061F840404040404040'                      10020017
         DC    X'4040401FE0404018F840404040404040'                      10030017
         DC    X'4040403FE0404006F840404040404040'                      10040017
         DC    X'4040401FE0404001FC40404040404040'                      10050017
         DC    X'40404007C04040403C40404040404040'                      10060017
         DC    X'40404001C04040400E40404040404040'                      10070017
         DC    X'40404040804040400240404040404040'                      10080017
PATAU    DC    X'4040403C404040404040404040404040'                      10090017
         DC    X'4040400F404040404040404040404040'                      10100017
         DC    X'40404007C04040404040404040404040'                      10110017
         DC    X'40404003E04040404040404040404040'                      10120017
         DC    X'40404003F04040404040404040404040'                      10130017
         DC    X'40404003F84040404040404040404040'                      10140017
         DC    X'40404003F84040400640404040404040'                      10150017
         DC    X'40404007FC4040400380404040404040'                      10160017
         DC    X'4040400FFFE0404001E0404040404040'                      10170017
         DC    X'4040400FF07F404040F8404040404040'                      10180017
         DC    X'4040401FE003FC4040FE404040404040'                      10190017
         DC    X'4040401FE0400FF040FF404040404040'                      10200017
         DC    X'4040403FC040403FC0FF804040404040'                      10210017
         DC    X'4040403FC0404007FFFFC04020404040'                      10220017
         DC    X'4040403FC0404007FFFFE04018404040'                      10230017
         DC    X'4040403FC0404007F87FE0400E404040'                      10240017
         DC    X'4040401FC0404007F801FF800F404040'                      10250017
         DC    X'40404007E0404007F84007FC0F804040'                      10260017
         DC    X'40404040F0404007F840401FFFC04040'                      10270017
         DC    X'404040400C404007F8404040FFC04040'                      10280017
         DC    X'4040404040404007F840400FFFC04040'                      10290017
         DC    X'4040404040404007F84007FFFF804040'                      10300017
         DC    X'4040404040404007F803FFFFFF404040'                      10310017
         DC    X'4040404040404007F9FFFFFFFC404040'                      10320017
         DC    X'4040404040404007FFFFFFFFE0404040'                      10330017
         DC    X'404040404040407FFFFFFFF840404040'                      10340017
         DC    X'4040404040403FFFFFFFFC4040404040'                      10350017
         DC    X'40404040401FFFFFFFFE404040404040'                      10360017
         DC    X'404040400FFFFFFFFF40404040404040'                      10370017
         DC    X'40404040FFFFFFFFC040404040404040'                      10380017
         DC    X'40404003FFFFFFC04040404040404040'                      10390017
         DC    X'4040400FFFFFE0404040404040404040'                      10400017
         DC    X'4040401FFFF040404040404040404040'                      10410017
         DC    X'4040403FFC4040404040404040404040'                      10420017
         DC    X'4040403FC04040404040404040404040'                      10430017
         DC    X'4040403F804040404040404040404040'                      10440017
         DC    X'4040403F804040404040404040404040'                      10450017
         DC    X'4040401F804040404040404040404040'                      10460017
         DC    X'40404007C04040404040404040404040'                      10470017
         DC    X'40404001F04040404040404040404040'                      10480017
PATBU    DC    X'4040402040404040404001E040404040'                      10490017
         DC    X'4040401C404040404040407E40404040'                      10500017
         DC    X'4040400E404040404040400FC0404040'                      10510017
         DC    X'4040400F8040401040404007F0404040'                      10520017
         DC    X'40404007C040400E40404003F8404040'                      10530017
         DC    X'40404007E0404007C0404001FC404040'                      10540017
         DC    X'40404007F0404003F0404001FE404040'                      10550017
         DC    X'40404003F8404003F8404001FE404040'                      10560017
         DC    X'40404003F8404003FC404001FE404040'                      10570017
         DC    X'40404003FC404003FE404003FC404040'                      10580017
         DC    X'40404003FC404003FF404003FC404040'                      10590017
         DC    X'40404003FE404007FF404003FC404040'                      10600017
         DC    X'40404003FFFFFFFFFFFFFFFDFE404040'                      10610017
         DC    X'40404003FEFFFFFFFFFFFFFEFE404040'                      10620017
         DC    X'40404003FF7FFFFFFFFFFFFF7F404040'                      10630017
         DC    X'40404003FF1FFFFFFFFFFFFF9F404040'                      10640017
         DC    X'40404003FFC7FFFFFFFFFFFFE3804040'                      10650017
         DC    X'40404003FF80FFFFFFFFFFFFFCC04040'                      10660017
         DC    X'40404003FF80404040304003FFC04040'                      10670017
         DC    X'40404003FFC0404040304003FFC04040'                      10680017
         DC    X'40404003FFC0404040304003FFC04040'                      10690017
         DC    X'40404003FFC0404040304003FF804040'                      10700017
         DC    X'40404003FFC0404040304003FF804040'                      10710017
         DC    X'40404003FFC0404040704007FF804040'                      10720017
         DC    X'40404003FF80404040F04007FF404040'                      10730017
         DC    X'40404003FF80404001F04007FE404040'                      10740017
         DC    X'40404003FF80404003F0400FFE404040'                      10750017
         DC    X'40404007FF80404007F0400FFC404040'                      10760017
         DC    X'40404007FF4040400FF0401FFC404040'                      10770017
         DC    X'4040400FFF4040401FF0401FF8404040'                      10780017
         DC    X'4040400FFF4040407FB0403FF0404040'                      10790017
         DC    X'4040401FFE404040FFB0403FE0404040'                      10800017
         DC    X'4040403FFE404003FF18407FC0404040'                      10810017
         DC    X'4040401FFE40400FFE1C01FF80404040'                      10820017
         DC    X'40404007FC40403FFE1F03FF40404040'                      10830017
         DC    X'40404001FC4040FFFC0FFFFE40404040'                      10840017
         DC    X'40404040F84003FFF807FFFC40404040'                      10850017
         DC    X'4040404038401FFFF003FFF040404040'                      10860017
         DC    X'404040400707FFFFC001FFC040404040'                      10870017
         DC    X'4040404001FFFFFF40403E4040404040'                      10880017
         DC    X'40404040403FFFFC4040404040404040'                      10890017
         DC    X'404040404007FFE04040404040404040'                      10900017
PATCU    DC    X'404040404040401FF040404040404040'                      10910017
         DC    X'40404040404007FFFFC0404040404040'                      10920017
         DC    X'404040404040FFFFFFFE404040404040'                      10930017
         DC    X'404040404007FFFFFFFFC04040404040'                      10940017
         DC    X'40404040403FFFFFFFFFF84040404040'                      10950017
         DC    X'4040404040FFFFFFFFFFFE4040404040'                      10960017
         DC    X'4040404003FFFFF83003FF8040404040'                      10970017
         DC    X'404040400FFFFF401E401FE040404040'                      10980017
         DC    X'404040403FFFF0400F8001F040404040'                      10990017
         DC    X'404040407FFF80400FE040B840404040'                      11000017
         DC    X'40404040FFFE40400FF0404E40404040'                      11010017
         DC    X'40404001FFF840401FF8402340404040'                      11020017
         DC    X'40404003FFFFFFFFFFFFFFF180404040'                      11030017
         DC    X'40404007FFDFFFFFFFFFFFF8C0404040'                      11040017
         DC    X'4040400FFF0FFFFFFFFFFFFC20404040'                      11050017
         DC    X'4040401FFE07FFFFFFFFFFFE40404040'                      11060017
         DC    X'4040401FFC03FFFFFFFFFFFF40404040'                      11070017
         DC    X'4040401FF801FFFFFFFFFFFF80404040'                      11080017
         DC    X'4040403FF040404040404001E0404040'                      11090017
         DC    X'4040403FE040404040404003F8404040'                      11100017
         DC    X'4040403FC040404040404007FE404040'                      11110017
         DC    X'4040403FC04040404040400FFFC04040'                      11120017
         DC    X'4040403F804040404040401FFF804040'                      11130017
         DC    X'4040403F804040404040403FFF404040'                      11140017
         DC    X'4040403F404040404040407FFE404040'                      11150017
         DC    X'4040403F40404040404040FFFC404040'                      11160017
         DC    X'4040403E40404040404001FFF8404040'                      11170017
         DC    X'4040403E40404040404003FFF0404040'                      11180017
         DC    X'4040403E40404040404007FFE0404040'                      11190017
         DC    X'4040401E40404040404007FFC0404040'                      11200017
         DC    X'4040401E40404040404007FF80404040'                      11210017
         DC    X'4040400E40404040404007FF80404040'                      11220017
         DC    X'4040400F40404040404007FF40404040'                      11230017
         DC    X'4040400740404040404003FE40404040'                      11240017
         DC    X'4040400380404040404001FE40404040'                      11250017
         DC    X'4040400180404040404040FE40404040'                      11260017
         DC    X'40404040C04040404040407E40404040'                      11270017
         DC    X'40404040604040404040401E40404040'                      11280017
         DC    X'40404040104040404040400740404040'                      11290017
PATDU    DC    X'4040402040404040404001E040404040'                      11300017
         DC    X'4040401C404040404040407E40404040'                      11310017
         DC    X'4040400E404040404040400FC0404040'                      11320017
         DC    X'4040400F8040401040404007F0404040'                      11330017
         DC    X'40404007C040400E40404003F8404040'                      11340017
         DC    X'40404007E0404007C0404001FC404040'                      11350017
         DC    X'40404007F0404003F0404001FE404040'                      11360017
         DC    X'40404003F8404003F8404001FE404040'                      11370017
         DC    X'40404003F8404003FC404001FE404040'                      11380017
         DC    X'40404003FC404003FE404003FC404040'                      11390017
         DC    X'40404003FC404003FF404003FC404040'                      11400017
         DC    X'40404003FE404007FF404003FC404040'                      11410017
         DC    X'40404003FFFFFFFFFFFFFFFDFE404040'                      11420017
         DC    X'40404003FEFFFFFFFFFFFFFEFE404040'                      11430017
         DC    X'40404003FF7FFFFFFFFFFFFF7F404040'                      11440017
         DC    X'40404003FF1FFFFFFFFFFFFF9F404040'                      11450017
         DC    X'40404003FFC7FFFFFFFFFFFFE3804040'                      11460017
         DC    X'40404003FF80FFFFFFFFFFFFFCC04040'                      11470017
         DC    X'40404003FF80404040404003FFC04040'                      11480017
         DC    X'40404003FFC0404040404003FFC04040'                      11490017
         DC    X'40404003FFC0404040404007FF804040'                      11500017
         DC    X'40404003FFC040404040400FFF804040'                      11510017
         DC    X'40404003FFC040404040400FFF404040'                      11520017
         DC    X'40404003FFC040404040401FFF404040'                      11530017
         DC    X'40404003FF8040404040403FFF404040'                      11540017
         DC    X'40404003FF8040404040407FFE404040'                      11550017
         DC    X'40404003FF804040404040FFFC404040'                      11560017
         DC    X'40404007FF804040404001FFF8404040'                      11570017
         DC    X'40404007FF404040404007FFF0404040'                      11580017
         DC    X'4040400FFF40404040400FFFE0404040'                      11590017
         DC    X'4040400FFF40404040403FFFC0404040'                      11600017
         DC    X'4040401FFE40404040407FFF40404040'                      11610017
         DC    X'4040403FFE4040404001FFFE40404040'                      11620017
         DC    X'4040401FFE4040404007FFF840404040'                      11630017
         DC    X'40404007FC404040401FFFF040404040'                      11640017
         DC    X'40404001FC404040407FFFC040404040'                      11650017
         DC    X'40404040F840404003FFFF4040404040'                      11660017
         DC    X'40404040384040401FFFFC4040404040'                      11670017
         DC    X'4040404007404001FFFFE04040404040'                      11680017
         DC    X'4040404040F8407FFFFC404040404040'                      11690017
         DC    X'404040404007FFFFFF80404040404040'                      11700017
         DC    X'4040404040003FFFF000404040404040'                      11710017
PATEU    DC    X'4040402040404040404001E040404040'                      11720017
         DC    X'40404038404040404040407E40404040'                      11730017
         DC    X'4040401E404040404040400FC0404040'                      11740017
         DC    X'4040400F4040401040404007F0404040'                      11750017
         DC    X'404040078040400E40404003F8404040'                      11760017
         DC    X'40404003E0404007C0404001FC404040'                      11770017
         DC    X'40404003F0404003F0404001FE404040'                      11780017
         DC    X'40404003F8404003F8404001FE404040'                      11790017
         DC    X'40404003FC404003FC404001FE404040'                      11800017
         DC    X'40404003FE404003FE404003FC404040'                      11810017
         DC    X'40404001FE404003FF404003FC404040'                      11820017
         DC    X'40404001FF404007FF404003FC404040'                      11830017
         DC    X'40404001FFFFFFFFFFFFFFFDFE404040'                      11840017
         DC    X'40404003FFFFFFFFFFFFFFFEFE404040'                      11850017
         DC    X'40404003FFBFFFFFFFFFFFFF7F404040'                      11860017
         DC    X'40404003FF8FFFFFFFFFFFFF9F404040'                      11870017
         DC    X'40404007FFC3FFFFFFFFFFFFE3804040'                      11880017
         DC    X'4040400FFF407FFFFFFFFFFFFCC04040'                      11890017
         DC    X'4040400FFF404040E0404003FFC04040'                      11900017
         DC    X'4040401FFF40404078404007FF804040'                      11910017
         DC    X'4040401FFE404040FE404007FF404040'                      11920017
         DC    X'4040401FFE404001FF804007FE404040'                      11930017
         DC    X'4040403FFE404003FF404007FE404040'                      11940017
         DC    X'4040403FFC404007FE404007FE404040'                      11950017
         DC    X'4040403FFC40400FFC404003FC404040'                      11960017
         DC    X'4040403FFC40401FF8404003FC404040'                      11970017
         DC    X'4040403FF8404007F8404001FC404040'                      11980017
         DC    X'4040403FF8404001F8404001FC404040'                      11990017
         DC    X'4040403FF8404040F0404040FC404040'                      12000017
         DC    X'4040403FF840404030404040FC404040'                      12010017
         DC    X'4040403FF8404040404040407E404040'                      12020017
         DC    X'4040403FF8404040404040403E404040'                      12030017
         DC    X'4040400FF8404040404040401E404040'                      12040017
         DC    X'40404003F8404040404040400F404040'                      12050017
         DC    X'40404040FC4040404040404003804040'                      12060017
         DC    X'404040403E4040404040404040C04040'                      12070017
         DC    X'404040400E4040404040404040404040'                      12080017
         DC    X'40404040034040404040404040404040'                      12090017
         DC    X'4040404000C040404040404040404040'                      12100017
PATFU    DC    X'4040402040404040404001E040404040'                      12110017
         DC    X'40404038404040404040407E40404040'                      12120017
         DC    X'4040401E404040404040400FC0404040'                      12130017
         DC    X'4040400F4040401040404007F0404040'                      12140017
         DC    X'404040078040400E40404003F8404040'                      12150017
         DC    X'40404003E0404007C0404001FC404040'                      12160017
         DC    X'40404003F0404003F0404001FE404040'                      12170017
         DC    X'40404003F8404003F8404001FE404040'                      12180017
         DC    X'40404003FC404003FC404001FE404040'                      12190017
         DC    X'40404003FE404003FE404003FC404040'                      12200017
         DC    X'40404003FF404003FF404003FC404040'                      12210017
         DC    X'40404001FF404007FF404003FC404040'                      12220017
         DC    X'40404001FFFFFFFFFFFFFFFDFE404040'                      12230017
         DC    X'40404040FFFFFFFFFFFFFFFEFE404040'                      12240017
         DC    X'404040407FFFFFFFFFFFFFFF7F404040'                      12250017
         DC    X'404040403FFFFFFFFFFFFFFF9F404040'                      12260017
         DC    X'404040400FFFFFFFFFFFFFFFE3804040'                      12270017
         DC    X'4040404003FFFFFFFFFFFFFFFCC04040'                      12280017
         DC    X'4040404040404040E0404003FFC04040'                      12290017
         DC    X'404040404040404078404007FF804040'                      12300017
         DC    X'4040404040404040FE404007FF404040'                      12310017
         DC    X'4040404040404001FF804007FE404040'                      12320017
         DC    X'4040404040404003FF404007FE404040'                      12330017
         DC    X'4040404040404007FE404007FE404040'                      12340017
         DC    X'404040404040400FFC404003FC404040'                      12350017
         DC    X'404040404040401FF8404003FC404040'                      12360017
         DC    X'4040404040404007F8404001FC404040'                      12370017
         DC    X'4040404040404001F8404001FC404040'                      12380017
         DC    X'4040404040404040F0404040FC404040'                      12390017
         DC    X'404040404040404060404040FC404040'                      12400017
         DC    X'4040404040404040404040407E404040'                      12410017
         DC    X'4040404040404040404040403E404040'                      12420017
         DC    X'4040404040404040404040401E404040'                      12430017
         DC    X'4040404040404040404040400F404040'                      12440017
         DC    X'40404040404040404040404003804040'                      12450017
         DC    X'40404040404040404040404040C04040'                      12460017
PATGU    DC    X'404040404040401FF040404040404040'                      12470017
         DC    X'40404040404007FFFFC0404040404040'                      12480017
         DC    X'404040404040FFFFFFFE404040404040'                      12490017
         DC    X'404040404007FFFFFFFFC04040404040'                      12500017
         DC    X'40404040403FFFFFFFFFF84040404040'                      12510017
         DC    X'4040404040FFFFFFFFFFFE4040404040'                      12520017
         DC    X'4040404003FFFFF83003FF8040404040'                      12530017
         DC    X'404040400FFFFF401E401FE040404040'                      12540017
         DC    X'404040403FFFF0400F8001F040404040'                      12550017
         DC    X'404040407FFF80400FE040B840404040'                      12560017
         DC    X'40404040FFFE40400FF0404E40404040'                      12570017
         DC    X'40404001FFF840401FF8402340404040'                      12580017
         DC    X'40404003FFFFFFFFFFFFFFF180404040'                      12590017
         DC    X'40404007FFDFFFFFFFFFFFF8C0404040'                      12600017
         DC    X'4040400FFF0FFFFFFFFFFFFC20404040'                      12610017
         DC    X'4040401FFE07FFFFFFFFFFFE40404040'                      12620017
         DC    X'4040401FFC03FFFFFFFFFFFF40404040'                      12630017
         DC    X'4040401FF801FFFFFFFFFFFF80404040'                      12640017
         DC    X'4040403FF040400340404001E0404040'                      12650017
         DC    X'4040403FE0404001C0404003F8404040'                      12660017
         DC    X'4040403FC0404040F8404007FE404040'                      12670017
         DC    X'4040403FC04040407E40400FFFC04040'                      12680017
         DC    X'4040403F804040403EC0401FFF804040'                      12690017
         DC    X'4040403F804040403F30403FFF404040'                      12700017
         DC    X'4040403F404040401F9C407FFE404040'                      12710017
         DC    X'4040403F404040401FCE40FFFC404040'                      12720017
         DC    X'4040403E404040401FC701FFF8404040'                      12730017
         DC    X'4040403E404040401FE3C3FFF0404040'                      12740017
         DC    X'4040401E404040401FE1C7FFE0404040'                      12750017
         DC    X'4040401E404040401FE1C7FFC0404040'                      12760017
         DC    X'4040400E404040401FE1C7FF80404040'                      12770017
         DC    X'4040400F404040403FC1C7FF40404040'                      12780017
         DC    X'40404007404040403FC0E7FE40404040'                      12790017
         DC    X'40404003404040407F80E3FE40404040'                      12800017
         DC    X'4040400180404040FF40E1FE40404040'                      12810017
         DC    X'40404040C0404003FE4070FE40404040'                      12820017
         DC    X'404040402040400FFC40387E40404040'                      12830017
         DC    X'404040401840403FF0400E1E40404040'                      12840017
         DC    X'40404040064001FFC04003C640404040'                      12850017
         DC    X'4040404001C07FFF8040407340404040'                      12860017
         DC    X'40404040403FFFF84040400C40404040'                      12870017
         DC    X'404040404001FF804040404040404040'                      12880017
PATHU    DC    X'4040403840404040404001E040404040'                      12890017
         DC    X'4040400F404040404040407E40404040'                      12900017
         DC    X'40404007C04040404040400FC0404040'                      12910017
         DC    X'40404007F040401040404007F0404040'                      12920017
         DC    X'40404007F840400E40404003F8404040'                      12930017
         DC    X'40404003FC404007C0404001FC404040'                      12940017
         DC    X'40404003FC404003F0404001FE404040'                      12950017
         DC    X'40404003FE404003F8404001FE404040'                      12960017
         DC    X'40404003FE404003FC404001FE404040'                      12970017
         DC    X'40404007FC404003FE404003FC404040'                      12980017
         DC    X'40404007FC404003FF404003FC404040'                      12990017
         DC    X'40404007F8404007FF404003FC404040'                      13000017
         DC    X'40404007FFFFFFFFFFFFFFFDFE404040'                      13010017
         DC    X'4040400FF7FFFFFFFFFFFFFEFE404040'                      13020017
         DC    X'4040401FF3FFFFFFFFFFFFFF7F404040'                      13030017
         DC    X'4040401FE0FFFFFFFFFFFFFF9F404040'                      13040017
         DC    X'4040403FC03FFFFFFFFFFFFFE3804040'                      13050017
         DC    X'3040403FC003FFFFFFFF8003FFC04040'                      13060017
         DC    X'1C40403FC0404040400C4007FF804040'                      13070017
         DC    X'0E40403FC040404040064007FF404040'                      13080017
         DC    X'0F80403FC040404040074007FE404040'                      13090017
         DC    X'07C0403FC0404040400F8007FE404040'                      13100017
         DC    X'03E0401FE0404040401FC007FE404040'                      13110017
         DC    X'01F8400FE0404040403FE003FC404040'                      13120017
         DC    X'40FE4003F0404040403FF003FC404040'                      13130017
         DC    X'407F804078404040407FF801FC404040'                      13140017
         DC    X'403FE0400E404040407FF001FC404040'                      13150017
         DC    X'401FFC4040404040407FE040FC404040'                      13160017
         DC    X'4007FF804040404040FFE040FC404040'                      13170017
         DC    X'4003FFFFFFFFFFFFFFFFC0407E404040'                      13180017
         DC    X'4040FFFFFFFFFFFFFFFFC0403E404040'                      13190017
         DC    X'40401FFFFFFFFFFFFFFF80401E404040'                      13200017
         DC    X'404007FFFFFFFFFFFFFF80400F404040'                      13210017
         DC    X'404001FFFFFFFFFFFFFF804003804040'                      13220017
         DC    X'4040401FFFFFFFFFFFFF804040C04040'                      13230017
         DC    X'4040404040404040400FC04040404040'                      13240017
         DC    X'40404040404040404003E04040404040'                      13250017
         DC    X'40404040404040404040704040404040'                      13260017
         DC    X'40404040404040404040084040404040'                      13270017
PATIU    DC    X'4040402040404040404001E040404040'                      13280017
         DC    X'40404038404040404040407E40404040'                      13290017
         DC    X'4040401E404040404040400FC0404040'                      13300017
         DC    X'4040400F4040401040404007F0404040'                      13310017
         DC    X'404040078040400E40404003F8404040'                      13320017
         DC    X'40404003E0404007C0404001FC404040'                      13330017
         DC    X'40404003F0404003F0404001FE404040'                      13340017
         DC    X'40404003F8404003F8404001FE404040'                      13350017
         DC    X'40404003FC404003FC404001FE404040'                      13360017
         DC    X'40404003FE404003FE404003FC404040'                      13370017
         DC    X'40404007FF404003FF404003FC404040'                      13380017
         DC    X'40404007FF404007FF404003FC404040'                      13390017
         DC    X'4040400FFFFFFFFFFFFFFFFDFE404040'                      13400017
         DC    X'4040401FFFFFFFFFFFFFFFFEFE404040'                      13410017
         DC    X'4040401FFFFFFFFFFFFFFFFF7F404040'                      13420017
         DC    X'4040403FFFFFFFFFFFFFFFFF9F404040'                      13430017
         DC    X'4040400FFFFFFFFFFFFFFFFFE3804040'                      13440017
         DC    X'40404001FFFFFFFFFFFFFFFFF8C04040'                      13450017
PATJU    DC    X'404040401FFF40404040404040404040'                      13460017
         DC    X'40404001FFFFE0404040404040404040'                      13470017
         DC    X'40404007FFFFF8404040404040404040'                      13480017
         DC    X'4040400FFFFFFE40404001E040404040'                      13490017
         DC    X'4040400FFFE3FF404040407E40404040'                      13500017
         DC    X'4040401FFE401F804040400FC0404040'                      13510017
         DC    X'4040401FF04003E010404007F0404040'                      13520017
         DC    X'4040403FC04040F860404003F8404040'                      13530017
         DC    X'4040403F8040403FC0404001FC404040'                      13540017
         DC    X'4040403F4040400F40404001FE404040'                      13550017
         DC    X'4040401E4040404040404001FE404040'                      13560017
         DC    X'4040401E4040404040404001FE404040'                      13570017
         DC    X'4040400F404040404003FC03FC404040'                      13580017
         DC    X'404040078040404007FFFFC3FC404040'                      13590017
         DC    X'40404003C0404040FFFFFFFBFC404040'                      13600017
         DC    X'40404001F04040FFFFFFFFFDFE404040'                      13610017
         DC    X'404040407FFFFFFFFFFFFFFEFE404040'                      13620017
         DC    X'404040401FFFFFFFFFFFFFFF7F404040'                      13630017
         DC    X'4040404007FFFFFFFF80407F9F404040'                      13640017
         DC    X'4040404040FFFFFFC040400FE3804040'                      13650017
         DC    X'404040404007FFE040404001F8C04040'                      13660017
         DC    X'4040404040404040404040403E404040'                      13670017
         DC    X'40404040404040404040404003404040'                      13680017
PATKU    DC    X'4040403840404040404001E040404040'                      13690017
         DC    X'4040400F404040404040407E40404040'                      13700017
         DC    X'40404007C04040404040400FC0404040'                      13710017
         DC    X'40404007F040401040404007F0404040'                      13720017
         DC    X'40404007F840400E40404003F8404040'                      13730017
         DC    X'40404003FC404007C0404001FC404040'                      13740017
         DC    X'40404003FC404003F0404001FE404040'                      13750017
         DC    X'40404003FE404003F8404001FE404040'                      13760017
         DC    X'40404003FE404003FC404001FE404040'                      13770017
         DC    X'40404007FC404003FE404003FC404040'                      13780017
         DC    X'40404007FC404003FF404003FC404040'                      13790017
         DC    X'40404007F8404007FF404003FC404040'                      13800017
         DC    X'40404007FFFFFFFFFFFFFFFDFE404040'                      13810017
         DC    X'4040400FF7FFFFFFFFFFFFFEFE404040'                      13820017
         DC    X'4040401FF3FFFFFFFFFFFFFF7F404040'                      13830017
         DC    X'4040401FE0FFFFFFFFFFFFFF9F404040'                      13840017
         DC    X'4040403FC03FFFFFFFFFFFFFE3804040'                      13850017
         DC    X'4040403FC003FFFFFFFFFFFFFCC04040'                      13860017
         DC    X'4040403FC040401840064003FFC04040'                      13870017
         DC    X'4040403FC040400C40034007FF804040'                      13880017
         DC    X'4040403FC040400E40018007FF404040'                      13890017
         DC    X'4040403FC040400F4003C007FE404040'                      13900017
         DC    X'4040403FC040400F800FE007FE404040'                      13910017
         DC    X'4040401FE040400FC03FF007FE404040'                      13920017
         DC    X'4040400FE040401FE0FFF803FC404040'                      13930017
         DC    X'40404003F040403FF3FFFC03FC404040'                      13940017
         DC    X'40404040784040FFDFFFF001FC404040'                      13950017
         DC    X'404040400E4007FF8FFFC001FC404040'                      13960017
         DC    X'404040404007FFFFC7FF4040FC404040'                      13970017
         DC    X'404040400FFFFFFF03FC4040FC404040'                      13980017
         DC    X'40404040FFFFFFFE01F040407E404040'                      13990017
         DC    X'40404003FFFFFFFC40C040403E404040'                      14000017
         DC    X'40404007FFFFFFE0404040401E404040'                      14010017
         DC    X'4040400FFFFFE040404040400F404040'                      14020017
         DC    X'4040401FFFE040404040404003804040'                      14030017
         DC    X'4040401FFC4040404040404040C04040'                      14040017
         DC    X'4040403FE04040404040404040404040'                      14050017
         DC    X'4040403F804040404040404040404040'                      14060017
         DC    X'4040403F404040404040404040404040'                      14070017
         DC    X'4040401E404040404040404040404040'                      14080017
         DC    X'40404003404040404040404040404040'                      14090017
PATLU    DC    X'4040402040404040404001E040404040'                      14100017
         DC    X'40404038404040404040407E40404040'                      14110017
         DC    X'4040401E404040404040400FC0404040'                      14120017
         DC    X'4040400F4040401040404007F0404040'                      14130017
         DC    X'404040078040400E40404003F8404040'                      14140017
         DC    X'40404007E0404007C0404001FC404040'                      14150017
         DC    X'40404003F0404003F0404001FE404040'                      14160017
         DC    X'40404001F8404003F8404001FE404040'                      14170017
         DC    X'40404001FC404003FC404001FE404040'                      14180017
         DC    X'40404040FE404003FE404003FC404040'                      14190017
         DC    X'40404040FF404003FF404003FC404040'                      14200017
         DC    X'40404040FF404007FF404003FC404040'                      14210017
         DC    X'40404040FFFFFFFFFFFFFFFDFE404040'                      14220017
         DC    X'40404001FF7FFFFFFFFFFFFEFE404040'                      14230017
         DC    X'40404001FFBFFFFFFFFFFFFF7F404040'                      14240017
         DC    X'40404003FF8FFFFFFFFFFFFF9F404040'                      14250017
         DC    X'40404003FFC3FFFFFFFFFFFFE3804040'                      14260017
         DC    X'40404007FF407FFFFFFFFFFFFCC04040'                      14270017
         DC    X'40404007FF40404040404003FFC04040'                      14280017
         DC    X'4040400FFF40404040404007FE404040'                      14290017
         DC    X'4040400FFE40404040404007FC404040'                      14300017
         DC    X'4040401FFE40404040404003F8404040'                      14310017
         DC    X'4040401FFC40404040404001F0404040'                      14320017
         DC    X'4040401FF840404040404040F0404040'                      14330017
         DC    X'4040403FF04040404040404070404040'                      14340017
         DC    X'4040403FF04040404040404038404040'                      14350017
         DC    X'4040403FE0404040404040400C404040'                      14360017
         DC    X'4040403FE04040404040404040404040'                      14370017
         DC    X'4040401FE04040404040404040404040'                      14380017
         DC    X'4040401FE04040404040404040404040'                      14390017
         DC    X'4040400FE04040404040404040404040'                      14400017
         DC    X'4040400FE04040404040404040404040'                      14410017
         DC    X'40404007E04040404040404040404040'                      14420017
         DC    X'40404003E04040404040404040404040'                      14430017
         DC    X'40404001E04040404040404040404040'                      14440017
         DC    X'40404040704040404040404040404040'                      14450017
         DC    X'40404040184040404040404040404040'                      14460017
         DC    X'40404040064040404040404040404040'                      14470017
PATMU    DC    X'4040403040404040404001E040404040'                      14480017
         DC    X'4040400E404040404040407E40404040'                      14490017
         DC    X'40404007804040404040400FC0404040'                      14500017
         DC    X'40404003C040401040404007F0404040'                      14510017
         DC    X'40404003F040400E40404003F8404040'                      14520017
         DC    X'40404003F8404007C0404001FC404040'                      14530017
         DC    X'40404003FC404003F0404001FE404040'                      14540017
         DC    X'40404003FE404003F8404001FE404040'                      14550017
         DC    X'40404003FE404003FC404001FE404040'                      14560017
         DC    X'40404003FF404003FE404003FC404040'                      14570017
         DC    X'40404003FF404003FF404003FC404040'                      14580017
         DC    X'40404007FF404007FF404003FC404040'                      14590017
         DC    X'4040400FFFFFFFFFFFFFFFFDFE404040'                      14600017
         DC    X'4040403FFFFFFFFFFFFFFFFEFE404040'                      14610017
         DC    X'4040401FFFFFFFFFFFFFFFFF7F404040'                      14620017
         DC    X'40404007FFFFFFFFFFFFFFFF9F404040'                      14630017
         DC    X'40404001FFFFFFFFFFFFFFFFE3804040'                      14640017
         DC    X'404040401FFFFFFFFFFFFFFFFCC04040'                      14650017
         DC    X'404040404040404040404003FFC04040'                      14660017
         DC    X'404040404040404040404007FF804040'                      14670017
         DC    X'40404040404040104040400FFF404040'                      14680017
         DC    X'404040404040400E4040401FFE404040'                      14690017
         DC    X'4040404040404007C040403FFC404040'                      14700017
         DC    X'4040404040404003F040407FF8404040'                      14710017
         DC    X'4040404040404003F84040FFF0404040'                      14720017
         DC    X'4040404040404003FC4001FFE0404040'                      14730017
         DC    X'4040400140404003FE4003FFC0404040'                      14740017
         DC    X'4040400380404003FF4007FF80404040'                      14750017
         DC    X'40404007C0404007FF400FFF40404040'                      14760017
         DC    X'4040400FFFFFFFFFFFFFFFFE40404040'                      14770017
         DC    X'4040401FFFFFFFFFFFFFFFFC40404040'                      14780017
         DC    X'4040403FFFFFFFFFFFFFFFF840404040'                      14790017
         DC    X'4040401FFFFFFFFFFFFFFFF040404040'                      14800017
         DC    X'4040400FFFFFFFFFFFFFFFE040404040'                      14810017
         DC    X'40404007FFFFFFFFFFFFFFC040404040'                      14820017
         DC    X'40404003E040400FFC40407040404040'                      14830017
         DC    X'40404001C040400FF840401C40404040'                      14840017
         DC    X'4040404080404007F840400740404040'                      14850017
         DC    X'4040404040404003F8404001C0404040'                      14860017
         DC    X'4040404040404001F8404040F0404040'                      14870017
         DC    X'4040404040404040F8404001FC404040'                      14880017
         DC    X'40404040404040407C404001FF404040'                      14890017
         DC    X'40404040404040400E404003FFC04040'                      14900017
         DC    X'404040014040404001404003FF804040'                      14910017
         DC    X'404040038040404040404007FF404040'                      14920017
         DC    X'40404007C040404040404007FE404040'                      14930017
         DC    X'4040400FFFFFFFFFFFFFFFFFFC404040'                      14940017
         DC    X'4040401FFFFFFFFFFFFFFFFFFC404040'                      14950017
         DC    X'4040403FFFFFFFFFFFFFFFFFFC404040'                      14960017
         DC    X'4040401FFFFFFFFFFFFFFFFFFC404040'                      14970017
         DC    X'4040400FFFFFFFFFFFFFFFFFFE404040'                      14980017
         DC    X'40404007FFFFFFFFFFFFFFFFFE404040'                      14990017
         DC    X'40404003E0404040404040401F404040'                      15000017
         DC    X'40404001C0404040404040400F404040'                      15010017
         DC    X'40404040804040404040404003804040'                      15020017
         DC    X'40404040404040404040404000C04040'                      15030017
PATNU    DC    X'404040304040400380404040C0404040'                      15040017
         DC    X'4040401C40404040F040404070404040'                      15050017
         DC    X'4040400F404040407C4040403C404040'                      15060017
         DC    X'40404007C04040403F4040403E404040'                      15070017
         DC    X'40404007E04040403F8040403F404040'                      15080017
         DC    X'40404003F04040403FC040407F804040'                      15090017
         DC    X'40404003F84040407FE04040FFC04040'                      15100017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      15110017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      15120017
         DC    X'40404003FFFFFFFFFFFFFFFFFF804040'                      15130017
         DC    X'40404003FF404040404001FFFF404040'                      15140017
         DC    X'40404007FF40404040401FFFFC404040'                      15150017
         DC    X'40404007FF8040404040FFFFF0404040'                      15160017
         DC    X'4040400FFF8040404007FFFF80404040'                      15170017
         DC    X'4040403FFF804040403FFFFC40404040'                      15180017
         DC    X'4040400FFF80404001FFFFE040404040'                      15190017
         DC    X'40404003FF8040400FFFFF4040404040'                      15200017
         DC    X'40404040FF8040407FFFF84040404040'                      15210017
         DC    X'404040407F804003FFFFC04040404040'                      15220017
         DC    X'404040400F40401FFFFE404040404040'                      15230017
         DC    X'40404040024040FFFFF0400440404040'                      15240017
         DC    X'40404040404007FFFF80400F40404040'                      15250017
         DC    X'4040404040403FFFFC40401FC0404040'                      15260017
         DC    X'404040404001FFFFE040401FF0404040'                      15270017
         DC    X'40404040400FFFFF4040401FFC404040'                      15280017
         DC    X'40404040407FFFF84040401FFF404040'                      15290017
         DC    X'4040404003FFFFC04040401FFFC04040'                      15300017
         DC    X'404040401FFFFE404040401FFF404040'                      15310017
         DC    X'40404040FFFFF0404040401FFE404040'                      15320017
         DC    X'40404007FFFF80404040400FFE404040'                      15330017
         DC    X'4040400FFFFC40404040400FFC404040'                      15340017
         DC    X'4040401FFFFFFFFFFFFFFFFFFC404040'                      15350017
         DC    X'4040403FFFFFFFFFFFFFFFFFFC404040'                      15360017
         DC    X'4040403FFFFFFFFFFFFFFFFFFC404040'                      15370017
         DC    X'4040403FF840404040404001FC404040'                      15380017
         DC    X'4040403FF040404040404040FC404040'                      15390017
         DC    X'4040401FE0404040404040407E404040'                      15400017
         DC    X'40404007E0404040404040403E404040'                      15410017
         DC    X'40404001E0404040404040400F404040'                      15420017
         DC    X'40404040704040404040404003804040'                      15430017
         DC    X'404040400C4040404040404000C04040'                      15440017
PATOU    DC    X'404040404040401FF040404040404040'                      15450017
         DC    X'40404040404003FFFFE0404040404040'                      15460017
         DC    X'404040404040FFFFFFFE404040404040'                      15470017
         DC    X'404040404007FFFFFFFFE04040404040'                      15480017
         DC    X'40404040403FFFFFFFFFF84040404040'                      15490017
         DC    X'4040404040FFFFFFFFFFFE4040404040'                      15500017
         DC    X'4040404003FFFFF81803FF8040404040'                      15510017
         DC    X'404040400FFFFF400E406FE040404040'                      15520017
         DC    X'404040403FFFF0400F8030F840404040'                      15530017
         DC    X'404040407FFF80400FC0183C40404040'                      15540017
         DC    X'40404040FFFE40400FE00C0E40404040'                      15550017
         DC    X'40404001FFF840401FF0060340404040'                      15560017
         DC    X'40404003FFFFFFFFFFFFFF4040404040'                      15570017
         DC    X'40404007FF8FFFFFFFFFFF8040404040'                      15580017
         DC    X'4040400FFF07FFFFFFFFFFC040404040'                      15590017
         DC    X'4040400FFE03FFFFFFFFFFF040404040'                      15600017
         DC    X'4040401FFC40FFFFFFFFFFF840404040'                      15610017
         DC    X'4040401FF8400FFFFFFFFFFE40404040'                      15620017
         DC    X'4040403FF04040404040400380404040'                      15630017
         DC    X'4040401FE040404040404007E0404040'                      15640017
         DC    X'40404007C04040404040400FFC404040'                      15650017
         DC    X'40404003804040404040401FFFC04040'                      15660017
         DC    X'40404001804040404040401FFF804040'                      15670017
         DC    X'40404040C04040404040403FFF404040'                      15680017
         DC    X'40404040304040404040407FFF404040'                      15690017
         DC    X'4040404018404040404040FFFE404040'                      15700017
         DC    X'4040404006404040404003FFFC404040'                      15710017
         DC    X'4040404003804040404007FFF8404040'                      15720017
         DC    X'4040404040F0404040400FFFF0404040'                      15730017
         DC    X'40404040407E404040403FFFE0404040'                      15740017
         DC    X'40404040401FC0404001FFFF80404040'                      15750017
         DC    X'404040404007F840400FFFFE40404040'                      15760017
         DC    X'404040404001FFC040FFFFF840404040'                      15770017
         DC    X'4040404040407FFFFFFFFFC040404040'                      15780017
         DC    X'4040404040400FFFFFFFFF4040404040'                      15790017
         DC    X'40404040404003FFFFFFF84040404040'                      15800017
         DC    X'404040404040407FFFFFC04040404040'                      15810017
         DC    X'404040404040400FFFFE404040404040'                      15820017
         DC    X'40404040404040407FC0404040404040'                      15830017
PATPU    DC    X'4040403840404040404001E040404040'                      15840017
         DC    X'4040400F404040404040407E40404040'                      15850017
         DC    X'40404007C04040404040400FC0404040'                      15860017
         DC    X'40404007F040401040404007F0404040'                      15870017
         DC    X'40404007F840400E40404003F8404040'                      15880017
         DC    X'40404003FC404007C0404001FC404040'                      15890017
         DC    X'40404003FC404003F0404001FE404040'                      15900017
         DC    X'40404003FE404003F8404001FE404040'                      15910017
         DC    X'40404003FE404003FC404001FE404040'                      15920017
         DC    X'40404007FC404003FE404003FC404040'                      15930017
         DC    X'40404007FC404003FF404003FC404040'                      15940017
         DC    X'40404007F8404007FF404003FC404040'                      15950017
         DC    X'40404007FFFFFFFFFFFFFFFDFE404040'                      15960017
         DC    X'4040400FF7FFFFFFFFFFFFFEFE404040'                      15970017
         DC    X'4040401FF3FFFFFFFFFFFFFF7F404040'                      15980017
         DC    X'4040401FE0FFFFFFFFFFFFFF9F404040'                      15990017
         DC    X'4040403FC03FFFFFFFFFFFFFE3804040'                      16000017
         DC    X'4040403FC003FFFFFFFFFFFFFCC04040'                      16010017
         DC    X'4040403FC040404078404003FFC04040'                      16020017
         DC    X'4040403FC0404040FE404003FF804040'                      16030017
         DC    X'4040403FC0404001FF804007FF404040'                      16040017
         DC    X'4040403FC0404003FFE04007FF404040'                      16050017
         DC    X'4040403FC0404003FF80400FFE404040'                      16060017
         DC    X'4040401FE0404007FE40400FFE404040'                      16070017
         DC    X'4040400FE040400FF840401FFC404040'                      16080017
         DC    X'40404003F040400FF040401FFC404040'                      16090017
         DC    X'404040407840400FE040403FF8404040'                      16100017
         DC    X'404040400E40401FC040403FF0404040'                      16110017
         DC    X'404040404040401F8040407FE0404040'                      16120017
         DC    X'404040404040401F404040FFC0404040'                      16130017
         DC    X'404040404040401F404001FF80404040'                      16140017
         DC    X'404040404040400E404003FF40404040'                      16150017
         DC    X'404040404040400E404007FC40404040'                      16160017
         DC    X'404040404040400E40401FF840404040'                      16170017
         DC    X'404040404040400640407FE040404040'                      16180017
         DC    X'40404040404040034001FF8040404040'                      16190017
         DC    X'40404040404040018007FC4040404040'                      16200017
         DC    X'40404040404040407FFFE04040404040'                      16210017
         DC    X'40404040404040403FFE004040404040'                      16220017
PATQU    DC    X'404040404040401FF040404040404040'                      16230017
         DC    X'40404040404003FFFFE0404040404040'                      16240017
         DC    X'404040404040FFFFFFFE404040404040'                      16250017
         DC    X'404040404007FFFFFFFFE04040404040'                      16260017
         DC    X'40404040403FFFFFFFFFF84040404040'                      16270017
         DC    X'4040404040FFFFFFFFFFFE4040404040'                      16280017
         DC    X'4040404003FFFFF81803FF8040404040'                      16290017
         DC    X'404040400FFFFF400E406FE040404040'                      16300017
         DC    X'404040403FFFF0400F8030F840404040'                      16310017
         DC    X'404040407FFF80400FC0183C40404040'                      16320017
         DC    X'40404040FFFE40400FE00C0E40404040'                      16330017
         DC    X'40404001FFF840401FF0060340404040'                      16340017
         DC    X'40404003FFFFFFFFFFFFFF4040404040'                      16350017
         DC    X'40404007FFBFFFFFFFFFFF8040404040'                      16360017
         DC    X'4040400FFF1FFFFFFFFFFFC040404040'                      16370017
         DC    X'4040400FFE1FFFFFFFFFFFF040404040'                      16380017
         DC    X'4040401FFC1EFFFFFFFFFFF840404040'                      16390017
         DC    X'4040401FF81F0FFFFFFFFFFE40404040'                      16400017
         DC    X'4040403FF01F80404040400380404040'                      16410017
         DC    X'4040401FE03F804040404007E0404040'                      16420017
         DC    X'40404007C07FC0404040400FFC404040'                      16430017
         DC    X'40404003C1FFC0404040401FFFC04040'                      16440017
         DC    X'40404001C7FF80404040401FFF804040'                      16450017
         DC    X'40404040FFFF40404040403FFF404040'                      16460017
         DC    X'40404001FFFC40404040407FFF404040'                      16470017
         DC    X'40404007FFF84040404040FFFE404040'                      16480017
         DC    X'4040400FFFE04040404003FFFC404040'                      16490017
         DC    X'4040401FFF804040404007FFF8404040'                      16500017
         DC    X'4040403FFEF0404040400FFFF0404040'                      16510017
         DC    X'4040403FF87E404040403FFFE0404040'                      16520017
         DC    X'4040403FE01FC0404001FFFF80404040'                      16530017
         DC    X'4040403FC007F840400FFFFE40404040'                      16540017
         DC    X'4040403FC001FFC040FFFFF840404040'                      16550017
         DC    X'4040403FC0407FFFFFFFFFC040404040'                      16560017
         DC    X'4040401FC0400FFFFFFFFF4040404040'                      16570017
         DC    X'4040400FC04003FFFFFFF84040404040'                      16580017
         DC    X'40404007C040407FFFFFC04040404040'                      16590017
         DC    X'40404003C040400FFFFE404040404040'                      16600017
         DC    X'40404001E04040407FC0404040404040'                      16610017
         DC    X'40404040E04040404040404040404040'                      16620017
         DC    X'40404040304040404040404040404040'                      16630017
         DC    X'404040400C4040404040404040404040'                      16640017
PATRU    DC    X'4040403840404040404001E040404040'                      16650017
         DC    X'4040400F404040404040407E40404040'                      16660017
         DC    X'40404007C04040404040400FC0404040'                      16670017
         DC    X'40404007F040401040404007F0404040'                      16680017
         DC    X'40404007F840400E40404003F8404040'                      16690017
         DC    X'40404003FC404007C0404001FC404040'                      16700017
         DC    X'40404003FC404003F0404001FE404040'                      16710017
         DC    X'40404003FE404003F8404001FE404040'                      16720017
         DC    X'40404003FE404003FC404001FE404040'                      16730017
         DC    X'40404007FC404003FE404003FC404040'                      16740017
         DC    X'40404007FC404003FF404003FC404040'                      16750017
         DC    X'40404007F8404007FF404003FC404040'                      16760017
         DC    X'40404007FFFFFFFFFFFFFFFDFE404040'                      16770017
         DC    X'4040400FF7FFFFFFFFFFFFFEFE404040'                      16780017
         DC    X'4040401FF3FFFFFFFFFFFFFF7F404040'                      16790017
         DC    X'4040401FE0FFFFFFFFFFFFFF9F404040'                      16800017
         DC    X'4040403FC03FFFFFFFFFFFFFE3804040'                      16810017
         DC    X'4040403FC003FFFFFFFFFFFFFCC04040'                      16820017
         DC    X'4040403FC040400180404003FFC04040'                      16830017
         DC    X'4040403FC040400180404003FF804040'                      16840017
         DC    X'4040403FC040400180404003FF804040'                      16850017
         DC    X'4040403FC0404040C0404003FF404040'                      16860017
         DC    X'4040403FC0404040C0404003FF404040'                      16870017
         DC    X'4040401FE0404040C0404003FE404040'                      16880017
         DC    X'4040400FE0404040E0404007FE404040'                      16890017
         DC    X'40404003F0404040F0404007FE404040'                      16900017
         DC    X'4040404078404001F8404007FC404040'                      16910017
         DC    X'404040400E404003FC40400FFC404040'                      16920017
         DC    X'404040404040400FFE40400FFC404040'                      16930017
         DC    X'404040404040403FFF40401FF8404040'                      16940017
         DC    X'40404003FFFFFFFFFF80401FF8404040'                      16950017
         DC    X'4040400FFFFFFFFFFEC0403FF0404040'                      16960017
         DC    X'4040401FFFFFFFFFFE60407FF0404040'                      16970017
         DC    X'4040403FFFFFFFFFF83801FFE0404040'                      16980017
         DC    X'4040403FFFFFFFFFE00F07FFE0404040'                      16990017
         DC    X'4040403FFFFFFFFE4007FFFF80404040'                      17000017
         DC    X'4040403E404040404001FFFE40404040'                      17010017
         DC    X'4040403C4040404040407FF840404040'                      17020017
         DC    X'4040403C4040404040400FC040404040'                      17030017
         DC    X'4040401C404040404040404040404040'                      17040017
         DC    X'4040400E404040404040404040404040'                      17050017
         DC    X'40404001C04040404040404040404040'                      17060017
PATSU    DC    X'40404038404040404040404040404040'                      17070017
         DC    X'4040400F404040404040404040404040'                      17080017
         DC    X'40404003C04040404040404040404040'                      17090017
         DC    X'40404040F04040404040404040404040'                      17100017
         DC    X'404040407C4040404040404040404040'                      17110017
         DC    X'404040403E4040404040304040404040'                      17120017
         DC    X'404040401F4040404040F84040404040'                      17130017
         DC    X'404040401F8040404003FC4040404040'                      17140017
         DC    X'404040400FC04040400FFE4040404040'                      17150017
         DC    X'404040400FE04040401FFF4040404040'                      17160017
         DC    X'4040404007F04040403FFF8040404040'                      17170017
         DC    X'4040404007F04040407FFFC040404040'                      17180017
         DC    X'4040404007F8404040FFFFE040404040'                      17190017
         DC    X'4040404007F8404001FFFF3840404040'                      17200017
         DC    X'4040404007FC406003FFFC0E40404040'                      17210017
         DC    X'404040400FFC408007FFF80380404040'                      17220017
         DC    X'404040400FFC01400FFFF003E0404040'                      17230017
         DC    X'404040401FFC01400FFFE007FC404040'                      17240017
         DC    X'404040403FFC40801FFFC00FFFC04040'                      17250017
         DC    X'404040407FF840603FFF801FFF404040'                      17260017
         DC    X'40404040FFF8400C3FFF401FFC404040'                      17270017
         DC    X'40404001FFF04001FFFE403FF8404040'                      17280017
         DC    X'40404007FFE040407FFC403FE0404040'                      17290017
         DC    X'4040403FFFE04040FFF8407FE0404040'                      17300017
         DC    X'4040401FFF804040FFF040FFE0404040'                      17310017
         DC    X'4040401FFF404001FFEC40FFE0404040'                      17320017
         DC    X'4040400FFE404001FFE1C1FFE0404040'                      17330017
         DC    X'40404007F8404003FFC031FFC0404040'                      17340017
         DC    X'40404003F0404003FFC007FFC0404040'                      17350017
         DC    X'40404003E0404007FF8001FFC0404040'                      17360017
         DC    X'4040400180404007FF8001FFC0404040'                      17370017
         DC    X'40404040C040400FFF4040FFC0404040'                      17380017
         DC    X'404040406040401FFE4040FFC0404040'                      17390017
         DC    X'404040403040403FFE40407FD8404040'                      17400017
         DC    X'404040401C40407FFC40403FC3404040'                      17410017
         DC    X'404040400E4001FFF040401FC0804040'                      17420017
         DC    X'4040404007800FFFC0404007E0404040'                      17430017
         DC    X'4040404001FFFFFF40404001F0404040'                      17440017
         DC    X'40404040407FFFF84040404078804040'                      17450017
         DC    X'404040404001FF80404040400E004040'                      17460017
PATTU    DC    X'404040404040401FF040401040404040'                      17470017
         DC    X'40404040404007FFFFC0400C40404040'                      17480017
         DC    X'404040404040FFFFFFFE400340404040'                      17490017
         DC    X'404040404007FFFFFFFFC001C0404040'                      17500017
         DC    X'40404040403FFFFFFFFFF840F0404040'                      17510017
         DC    X'4040404040FFFFFFFFFFFE4078404040'                      17520017
         DC    X'4040404003FFFFF84003FF803C404040'                      17530017
         DC    X'404040400FFFFF4040401FE01E404040'                      17540017
         DC    X'404040403FFFF040304001F01F404040'                      17550017
         DC    X'404040407FFF80401C4040381F804040'                      17560017
         DC    X'40404040FFFE40400F40400E1F804040'                      17570017
         DC    X'40404001FFF840400F8040031FC04040'                      17580017
         DC    X'40404003FFE040400FC040019FC04040'                      17590017
         DC    X'40404007FFC040400FE04040FFC04040'                      17600017
         DC    X'4040400FFF4040401FE040407FC04040'                      17610017
         DC    X'4040401FFFFFFFFFFFFFFE40FFC04040'                      17620017
         DC    X'4040401FFDFFFFFFFFFFFF01FF804040'                      17630017
         DC    X'4040401FF8FFFFFFFFFFFFC3FF404040'                      17640017
         DC    X'4040403FF07FFFFFFFFFFFC7FF404040'                      17650017
         DC    X'4040403FE03FFFFFFFFFFFEFFE404040'                      17660017
         DC    X'4040403FC01FFFFFFFFFFFFFFE404040'                      17670017
         DC    X'4040403FC04040404040401FFC404040'                      17680017
         DC    X'4040403F804040404040401FFC404040'                      17690017
         DC    X'4040403F804040404040403FF8404040'                      17700017
         DC    X'4040403F404040404040403FF8404040'                      17710017
         DC    X'4040403F404040404040403FF8404040'                      17720017
         DC    X'4040403E404040404040401FF0404040'                      17730017
         DC    X'4040403E404040404040401FF0404040'                      17740017
         DC    X'4040403E404040404040401FF0404040'                      17750017
         DC    X'4040401E404040404040400FF0404040'                      17760017
         DC    X'4040401E404040404040400FF0404040'                      17770017
         DC    X'4040400E4040404040404007F8404040'                      17780017
         DC    X'4040400F4040404040404003F8404040'                      17790017
         DC    X'404040074040404040404003F8404040'                      17800017
         DC    X'404040038040404040404001F8404040'                      17810017
         DC    X'404040018040404040404040FC404040'                      17820017
         DC    X'40404040C0404040404040407C404040'                      17830017
         DC    X'4040404060404040404040401E404040'                      17840017
         DC    X'40404040404040404040404001C04040'                      17850017
PATUU    DC    X'4040403040404040E0404040C0404040'                      17860017
         DC    X'4040401E404040407C40404038404040'                      17870017
         DC    X'4040400F804040403F4040401E404040'                      17880017
         DC    X'40404007C04040401F8040401F404040'                      17890017
         DC    X'40404007E04040401FC040401F804040'                      17900017
         DC    X'40404007F04040401FE040401FC04040'                      17910017
         DC    X'40404003F84040403FF040403FC04040'                      17920017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      17930017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      17940017
         DC    X'40404003FFFFFFFFFFFFFFFFFF804040'                      17950017
         DC    X'40404003FFFFFFFFFFFFFFFFFF404040'                      17960017
         DC    X'40404007FFFFFFFFFFFFFFFFFC404040'                      17970017
         DC    X'4040400FFFFFFFFFFFFFFFFFE0404040'                      17980017
         DC    X'4040400FFF4040404040404040404040'                      17990017
         DC    X'4040401FFF4040404040404040404040'                      18000017
         DC    X'4040403FFF4040404040404040404040'                      18010017
         DC    X'4040401FFE4040404040404040404040'                      18020017
         DC    X'4040400FFE4040404040404040404040'                      18030017
         DC    X'40404007FC4040404040404040404040'                      18040017
         DC    X'40404003F84040404040404040404040'                      18050017
         DC    X'40404001F84040404040404030404040'                      18060017
         DC    X'40404040F0404040404040401E404040'                      18070017
         DC    X'4040404060404040404040400F404040'                      18080017
         DC    X'4040404030404040404040400F804040'                      18090017
         DC    X'4040404018404040404040401FC04040'                      18100017
         DC    X'404040400FFFFFFFFFFFFFFFFFC04040'                      18110017
         DC    X'404040403FFFFFFFFFFFFFFFFFC04040'                      18120017
         DC    X'40404040FFFFFFFFFFFFFFFFFFC04040'                      18130017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      18140017
         DC    X'4040400FFFFFFFFFFFFFFFFFFF804040'                      18150017
         DC    X'4040403FFFFFFFFFFFFFFFFFFF404040'                      18160017
         DC    X'4040401FFF404040404040407F404040'                      18170017
         DC    X'4040400FFC404040404040403F404040'                      18180017
         DC    X'40404007F0404040404040401F404040'                      18190017
         DC    X'40404003C04040404040404007804040'                      18200017
         DC    X'40404001804040404040404040C04040'                      18210017
         DC    X'40404040C04040404040404040404040'                      18220017
         DC    X'40404040604040404040404040404040'                      18230017
PATVU    DC    X'4040403040404040E040404030404040'                      18240017
         DC    X'4040401E404040407C4040401E404040'                      18250017
         DC    X'4040400F804040403F4040400F404040'                      18260017
         DC    X'40404007C04040403F8040400F804040'                      18270017
         DC    X'40404007E04040407FC040400FC04040'                      18280017
         DC    X'40404007FFFFFFFFFFFFFFFFFFC04040'                      18290017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      18300017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      18310017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      18320017
         DC    X'40404003FFFFFFFFFFFFFFFFFF804040'                      18330017
         DC    X'40404003FFFFFFFFFFFFFFFFFF404040'                      18340017
         DC    X'40404007FE404040404040407F404040'                      18350017
         DC    X'4040400FFE404040404040403F404040'                      18360017
         DC    X'4040400FFF404040404040401F404040'                      18370017
         DC    X'4040401FFF4040404040404007804040'                      18380017
         DC    X'4040403FFF4040404040404040C04040'                      18390017
         DC    X'4040401FFE4040404040404040404040'                      18400017
         DC    X'4040400FFE4040404040404040404040'                      18410017
         DC    X'40404007FC4040404040404040404040'                      18420017
         DC    X'40404003F84040404040404040404040'                      18430017
         DC    X'40404001F84040404040404040404040'                      18440017
         DC    X'40404040F04040404040404040404040'                      18450017
         DC    X'40404040604040404040404040404040'                      18460017
         DC    X'40404040304040404040404040404040'                      18470017
         DC    X'4040404018404040404040FF80404040'                      18480017
         DC    X'404040400E40404040FFFFFFF0404040'                      18490017
         DC    X'4040404007FFFFFFFFFFFFFFFC404040'                      18500017
         DC    X'4040404001FFFFFFFFFFFFFFFE404040'                      18510017
         DC    X'40404040407FFFFFFFFFFFFFFF404040'                      18520017
         DC    X'40404040401FFFFFFFFFFFFFFF804040'                      18530017
         DC    X'404040404003FFFFFFFE40407F804040'                      18540017
         DC    X'4040404040407FFE404040401FC04040'                      18550017
         DC    X'40404040404040404040404007C04040'                      18560017
         DC    X'40404040404040404040404003804040'                      18570017
         DC    X'40404040404040404040404001804040'                      18580017
         DC    X'40404040404040404040404001004040'                      18590017
PATWU    DC    X'4040403040404040E0404040C0404040'                      18600017
         DC    X'4040401E404040407C40404038404040'                      18610017
         DC    X'4040400F804040403F4040401E404040'                      18620017
         DC    X'40404007C04040401F8040401F404040'                      18630017
         DC    X'40404007E04040401FC040401F804040'                      18640017
         DC    X'40404007F04040401FE040401FC04040'                      18650017
         DC    X'40404003F84040403FF040403FC04040'                      18660017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      18670017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      18680017
         DC    X'40404003FFFFFFFFFFFFFFFFFF804040'                      18690017
         DC    X'40404003FFFFFFFFFFFFFFFFFF404040'                      18700017
         DC    X'40404007FFFFFFFFFFFFFFFFFC404040'                      18710017
         DC    X'4040400FFFFFFFFFFFFFFFFFE0404040'                      18720017
         DC    X'4040400FFF8040404040404040404040'                      18730017
         DC    X'4040401FFF8040404040404040404040'                      18740017
         DC    X'4040403FFF8040404040404040404040'                      18750017
         DC    X'4040401FFE404040E040404040404040'                      18760017
         DC    X'4040400FFE4040407C40404040404040'                      18770017
         DC    X'40404007FC4040403F40404030404040'                      18780017
         DC    X'40404003F84040401F8040401E404040'                      18790017
         DC    X'40404001F84040401FC040400F404040'                      18800017
         DC    X'40404040F04040401FE040400F804040'                      18810017
         DC    X'40404040704040403FF040401FC04040'                      18820017
         DC    X'404040403FFFFFFFFFFFFFFFFFC04040'                      18830017
         DC    X'40404040FFFFFFFFFFFFFFFFFFC04040'                      18840017
         DC    X'40404003FFFFFFFFFFFFFFFFFFC04040'                      18850017
         DC    X'4040400FFFFFFFFFFFFFFFFFFFC04040'                      18860017
         DC    X'4040403FFFFFFFFFFFFFFFFFFFC04040'                      18870017
         DC    X'4040403FFFFFFFFFFFFFFFFFFF804040'                      18880017
         DC    X'4040401FE0404001FF804040FF404040'                      18890017
         DC    X'4040400F80404040FF4040407F404040'                      18900017
         DC    X'40404006404040407F4040403F404040'                      18910017
         DC    X'40404003404040403F4040401F404040'                      18920017
         DC    X'40404001804040401F80404007804040'                      18930017
         DC    X'40404040C040404007C0404040C04040'                      18940017
         DC    X'404040407040404040E0404040404040'                      18950017
         DC    X'404040403C404040404001F840404040'                      18960017
         DC    X'404040401FC0404040401FFF80404040'                      18970017
         DC    X'404040400FFE404007FFFFFFF0404040'                      18980017
         DC    X'4040404007FFFFFFFFFFFFFFFC404040'                      18990017
         DC    X'4040404001FFFFFFFFFFFFFFFE404040'                      19000017
         DC    X'40404040407FFFFFFFFFFFFFFF404040'                      19010017
         DC    X'40404040401FFFFFFFFFFFFFFF804040'                      19020017
         DC    X'404040404003FFFFFFFE40407F804040'                      19030017
         DC    X'4040404040407FFE404040401FC04040'                      19040017
         DC    X'40404040404007E04040404007C04040'                      19050017
         DC    X'40404040404040404040404003804040'                      19060017
         DC    X'40404040404040404040404001804040'                      19070017
         DC    X'40404040404040404040404001004040'                      19080017
PATXU    DC    X'40404038404040404040400780404040'                      19090017
         DC    X'4040401F4040404040404001F0404040'                      19100017
         DC    X'4040400FC0404040404040407E404040'                      19110017
         DC    X'4040400FE0404040404040407F404040'                      19120017
         DC    X'40404007F0400380404040407F804040'                      19130017
         DC    X'40404007F84001F0404040407FC04040'                      19140017
         DC    X'4040400FF84040FC40404040FFC04040'                      19150017
         DC    X'4040400FF840407F40404001FFC04040'                      19160017
         DC    X'4040400FFC40403FC0404007FFC04040'                      19170017
         DC    X'4040401FFC40401FF040403FFF804040'                      19180017
         DC    X'4040401FFC40401FF84001FFFF404040'                      19190017
         DC    X'4040403FFC40401FFE401FFFFE404040'                      19200017
         DC    X'40404040FC40400FFF01FFFFF8404040'                      19210017
         DC    X'4040404007E0400FFF1FFFFFE0404040'                      19220017
         DC    X'40404040401F800FFFFFFFFF40404040'                      19230017
         DC    X'4040404040407E1FFFFFFFF040404040'                      19240017
         DC    X'40404040404001FFFFFFFF4040404040'                      19250017
         DC    X'404040404040401FFFFFE04040404040'                      19260017
         DC    X'40404040404040FFFFFE404040404040'                      19270017
         DC    X'4040404040400FFFFFE0404040404040'                      19280017
         DC    X'404040404040FFFFFFF8404040404040'                      19290017
         DC    X'40404040400FFFFFFFC7E04040404040'                      19300017
         DC    X'4040404040FFFFFFFF401F8040404040'                      19310017
         DC    X'404040400FFFFFFFFF40407E40404040'                      19320017
         DC    X'40404001FFFFFE07FF804003F0404040'                      19330017
         DC    X'40404007FFFFC001FF804003FFC04040'                      19340017
         DC    X'4040400FFFF84040FF804003FF804040'                      19350017
         DC    X'4040401FFFC040403FC04003FF804040'                      19360017
         DC    X'4040403FFE4040400FE04003FF404040'                      19370017
         DC    X'4040403FF840404003F04001FF404040'                      19380017
         DC    X'4040403FF040404040F84001FF404040'                      19390017
         DC    X'4040403FE0404040401C4001FE404040'                      19400017
         DC    X'4040401FE040404040404040FE404040'                      19410017
         DC    X'4040400FE0404040404040407F404040'                      19420017
         DC    X'40404007E0404040404040403F404040'                      19430017
         DC    X'40404041F8404040404040400F804040'                      19440017
         DC    X'404040403E4040404040404001C04040'                      19450017
PATYU    DC    X'404040204040400E40404040C0404040'                      19460017
         DC    X'4040403840404003C040404078404040'                      19470017
         DC    X'4040401E40404001F04040403E404040'                      19480017
         DC    X'4040400F40404001FC4040403F404040'                      19490017
         DC    X'6040400FC0404001FE4040403F804040'                      19500017
         DC    X'1C40400FE0404001FF4040407FC04040'                      19510017
         DC    X'0F404007F0404003FF804040FFC04040'                      19520017
         DC    X'07C04007FFFFFFFFFFFFFFFFFFC04040'                      19530017
         DC    X'03E04007FFFFFFFFFFFFFFFFFFC04040'                      19540017
         DC    X'03F04007FFFFFFFFFFFFFFFFFFC04040'                      19550017
         DC    X'01F84007FFFFFFFFFFFFFFFFFF804040'                      19560017
         DC    X'01F84007FFFFFFFFFFFFFFFFFF404040'                      19570017
         DC    X'01FC400FFFFFFFFFFFFFFFFFF8404040'                      19580017
         DC    X'01FC400FFE4040404040401C40404040'                      19590017
         DC    X'01FE401FFE4040404040400740404040'                      19600017
         DC    X'01FE403FFC40404040404001C0404040'                      19610017
         DC    X'01FF400FFC40404040404040F0404040'                      19620017
         DC    X'03FF4003FC40404040404001FC404040'                      19630017
         DC    X'03FF4040F840404040404001FF404040'                      19640017
         DC    X'03FF40403840404040404003FFC04040'                      19650017
         DC    X'07FF40400E40404040404003FF804040'                      19660017
         DC    X'07FF40400380404040404003FF404040'                      19670017
         DC    X'0FFE404040E0404040404007FF404040'                      19680017
         DC    X'0FFE40404038404040404007FE404040'                      19690017
         DC    X'1FFE4040400E404040404007FE404040'                      19700017
         DC    X'3FFC40403FFFFFFFFFFFFFFFFE404040'                      19710017
         DC    X'7FFC4003FFFFFFFFFFFFFFFFFC404040'                      19720017
         DC    X'3FF8400FFFFFFFFFFFFFFFFFFC404040'                      19730017
         DC    X'1FF0403FFFFFFFFFFFFFFFFFFC404040'                      19740017
         DC    X'0FE040FFFFFFFFFFFFFFFFFFFC404040'                      19750017
         DC    X'07C003FFFFFFFFFFFFFFFFFFFC404040'                      19760017
         DC    X'03800FFFF040404040404040FE404040'                      19770017
         DC    X'01C03FFFC0404040404040407E404040'                      19780017
         DC    X'407FFFFF40404040404040403F404040'                      19790017
         DC    X'401FFFF840404040404040400F804040'                      19800017
         DC    X'4001FFC0404040404040404001C04040'                      19810017
         DC    X'40404040404040404040404000C04040'                      19820017
PATZU    DC    X'404040384040404040407C4040404040'                      19830017
         DC    X'4040400E404040404007FFE040404040'                      19840017
         DC    X'4040400780404040401FFFFC40404040'                      19850017
         DC    X'40404003E0404040403E07FF40404040'                      19860017
         DC    X'40404003F0404040407001FFC0404040'                      19870017
         DC    X'40404001FC404040406040FFF0404040'                      19880017
         DC    X'40404001FF8040404040407FFC404040'                      19890017
         DC    X'40404001FFC040404040407FFF404040'                      19900017
         DC    X'40404040FF3040404040407FFFC04040'                      19910017
         DC    X'40404040FF8C40404040407FFF804040'                      19920017
         DC    X'40404040FFC34040404040FFFF404040'                      19930017
         DC    X'40404040FFC0C007C04040FFFE404040'                      19940017
         DC    X'40404040FFC03001FC4001FFFC404040'                      19950017
         DC    X'40404040FFE00C40FF4001FFF8404040'                      19960017
         DC    X'40404040FFE00340FF8003FFF0404040'                      19970017
         DC    X'40404040FFE040C0FF8003FFF0404040'                      19980017
         DC    X'40404040FFE04030FF8003FFF0404040'                      19990017
         DC    X'40404040FFF0400CFF8003FFE0404040'                      20000017
         DC    X'40404040FFF04003FF8007FFE0404040'                      20010017
         DC    X'40404040FFF04040FF8007FFE0404040'                      20020017
         DC    X'40404040FFF04040FF8007FFE0404040'                      20030017
         DC    X'40404040FFF04040FF8007FFE0404040'                      20040017
         DC    X'40404001FFF04040FF8003FFE0404040'                      20050017
         DC    X'40404001FFF04040FFC003FFE0404040'                      20060017
         DC    X'40404001FFF04040FFB003FFE0404040'                      20070017
         DC    X'40404003FFF04040FF8C01FFE0404040'                      20080017
         DC    X'40404007FFF04040FFC301FFE0404040'                      20090017
         DC    X'40404007FFF04040FF80C1FFE0404040'                      20100017
         DC    X'4040400FFFE040407F8030FFE0404040'                      20110017
         DC    X'4040401FFFE040401FC00CFFE0404040'                      20120017
         DC    X'4040403FFFE0404001F0037FE0404040'                      20130017
         DC    X'4040401FFFC04040404040FFF0404040'                      20140017
         DC    X'4040400FFFC003404040403FF0404040'                      20150017
         DC    X'40404003FFC001804040400FF8404040'                      20160017
         DC    X'40404040FFE003C040404003F8404040'                      20170017
         DC    X'404040403FF007C040404040FC404040'                      20180017
         DC    X'404040400FFC1F80404040403C404040'                      20190017
         DC    X'4040404003FFFF40404040400E404040'                      20200017
         DC    X'4040404040FFFC404040404003404040'                      20210017
         DC    X'40404040403FF0404040404040404040'                      20220017
PAT0     DC    X'404040400FFFFFFFFFFF404040404040'                      20230017
         DC    X'404040401FFFFFFFFFFF804040404040'                      20240017
         DC    X'404040403FFFFFFFFFFFC04040404040'                      20250017
         DC    X'404040407FFFFFFFFFFFE04040404040'                      20260017
         DC    X'40404040FFFFFFFFFFFFF04040404040'                      20270017
         DC    X'40404001FE4040404040184040404040'                      20280017
         DC    X'40404003FC40404040400C4040404040'                      20290017
         DC    X'40404007F84040404040064040404040'                      20300017
         DC    X'4040400FF040404040400F4040404040'                      20310017
         DC    X'4040401FE040404040401F8040404040'                      20320017
         DC    X'4040403FC040404040403FC040404040'                      20330017
         DC    X'4040401F8040404040407F8040404040'                      20340017
         DC    X'4040400F404040404040FF4040404040'                      20350017
         DC    X'40404006404040404001FE4040404040'                      20360017
         DC    X'40404003404040404003FC4040404040'                      20370017
         DC    X'40404001FFFFFFFFFFFFF84040404040'                      20380017
         DC    X'40404040FFFFFFFFFFFFF04040404040'                      20390017
         DC    X'404040407FFFFFFFFFFFE04040404040'                      20400017
         DC    X'404040403FFFFFFFFFFFC04040404040'                      20410017
         DC    X'404040401FFFFFFFFFFF804040404040'                      20420017
PAT1     DC    X'40404030404040404040044040404040'                      20430017
         DC    X'40404018404040404040024040404040'                      20440017
         DC    X'4040400C404040404040034040404040'                      20450017
         DC    X'40404007FFFFFFFFFFFFFF8040404040'                      20460017
         DC    X'40404003FFFFFFFFFFFFFFC040404040'                      20470017
         DC    X'40404001FFFFFFFFFFFFFF8040404040'                      20480017
         DC    X'40404040FFFFFFFFFFFFFF4040404040'                      20490017
         DC    X'404040407FFFFFFFFFFFFE4040404040'                      20500017
         DC    X'40404040304040404040404040404040'                      20510017
         DC    X'40404040184040404040404040404040'                      20520017
         DC    X'404040400C4040404040404040404040'                      20530017
PAT2     DC    X'4040403F804040401FFFC04040404040'                      20540017
         DC    X'4040401FBC4040400FFFE04040404040'                      20550017
         DC    X'4040401FC3C0404007FFF04040404040'                      20560017
         DC    X'4040400FE038404003FFF84040404040'                      20570017
         DC    X'4040400FE007404001FFFC4040404040'                      20580017
         DC    X'40404007F040C04040401E4040404040'                      20590017
         DC    X'40404007F040304040400F4040404040'                      20600017
         DC    X'4040400FE0400C4040401F8040404040'                      20610017
         DC    X'4040400FE040064040403FC040404040'                      20620017
         DC    X'4040401FC040018040407F8040404040'                      20630017
         DC    X'4040401FC04040C04040FF4040404040'                      20640017
         DC    X'4040403F804040604001FE4040404040'                      20650017
         DC    X'4040403F804040304003FC4040404040'                      20660017
         DC    X'4040403F404040184007F84040404040'                      20670017
         DC    X'4040403F4040400C400FF04040404040'                      20680017
         DC    X'4040403F40404007FFFFE04040404040'                      20690017
         DC    X'4040401F80404003FFFFC04040404040'                      20700017
         DC    X'4040400FC0404001FFFF804040404040'                      20710017
         DC    X'40404007E0404040FFFF404040404040'                      20720017
         DC    X'40404001F04040407FFE404040404040'                      20730017
PAT3     DC    X'40404040084040404040204040404040'                      20740017
         DC    X'404040401E4040404040304040404040'                      20750017
         DC    X'404040403F8040404040384040404040'                      20760017
         DC    X'404040407F80404040403C4040404040'                      20770017
         DC    X'40404040FF40401040403E4040404040'                      20780017
         DC    X'40404001FE40403840403F4040404040'                      20790017
         DC    X'40404003FC40407C40403F8040404040'                      20800017
         DC    X'40404007F84040FE40403FC040404040'                      20810017
         DC    X'4040400FF04001FF40403FC040404040'                      20820017
         DC    X'4040401FE04003FD80403FC040404040'                      20830017
         DC    X'4040403FC04007F8C0403FC040404040'                      20840017
         DC    X'4040401F80400FF060403FC040404040'                      20850017
         DC    X'4040400F40401FE030403FC040404040'                      20860017
         DC    X'4040400640403FC018403FC040404040'                      20870017
         DC    X'4040400340407F800C407FC040404040'                      20880017
         DC    X'40404001FFFFFF4007FFFFC040404040'                      20890017
         DC    X'40404040FFFFFE4003FFFF8040404040'                      20900017
         DC    X'404040407FFFFC4001FFFF4040404040'                      20910017
         DC    X'404040403FFFF84040FFFE4040404040'                      20920017
         DC    X'404040401FFFF040407FFC4040404040'                      20930017
PAT4     DC    X'40404040404001404040404040404040'                      20940017
         DC    X'40404040404001C04040404040404040'                      20950017
         DC    X'40404040404001F04040404040404040'                      20960017
         DC    X'40404040404040FC4040404040404040'                      20970017
         DC    X'40404040404040FF4040404040404040'                      20980017
         DC    X'40404040404040FFC040404040404040'                      20990017
         DC    X'404040404040407F7040404040404040'                      21000017
         DC    X'404040404040407F1C40404040404040'                      21010017
         DC    X'404040404040407F0740404040404040'                      21020017
         DC    X'404040404040403FC1C0404040404040'                      21030017
         DC    X'404040404040403F8070404040404040'                      21040017
         DC    X'404040404040403F801C404040404040'                      21050017
         DC    X'404040404040403F8007404040404040'                      21060017
         DC    X'404040404040407F4001C04040404040'                      21070017
         DC    X'40404002404040FF4040704040404040'                      21080017
         DC    X'40404007404040FE40401C4040404040'                      21090017
         DC    X'4040400FFFFFFFFFFFFFFF4040404040'                      21100017
         DC    X'4040401FFFFFFFFFFFFFFFC040404040'                      21110017
         DC    X'4040403FFFFFFFFFFFFFFFC040404040'                      21120017
         DC    X'4040401FFFFFFFFFFFFFFFC040404040'                      21130017
         DC    X'4040400FFFFFFFFFFFFFFFC040404040'                      21140017
         DC    X'40404007404040FE4040404040404040'                      21150017
         DC    X'404040024040403E4040404040404040'                      21160017
         DC    X'404040404040400F4040404040404040'                      21170017
PAT5     DC    X'4040404008400FFFFFFFFFC040404040'                      21180017
         DC    X'404040401E4007FFFFFFFF8040404040'                      21190017
         DC    X'404040403F8003FC40403F4040404040'                      21200017
         DC    X'404040407F8001FE40407F4040404040'                      21210017
         DC    X'40404040FF4040FF4040FE4040404040'                      21220017
         DC    X'40404001FE40407F8040FE4040404040'                      21230017
         DC    X'40404003FC40403FC040FC4040404040'                      21240017
         DC    X'40404007F840401FE001FC4040404040'                      21250017
         DC    X'4040400FF040400FF001FC4040404040'                      21260017
         DC    X'4040401FE0404007F801FC4040404040'                      21270017
         DC    X'4040403FC0404003FC01FC4040404040'                      21280017
         DC    X'4040401F80404007F801FC4040404040'                      21290017
         DC    X'4040400F4040400FF001FC4040404040'                      21300017
         DC    X'404040064040401FE040FC4040404040'                      21310017
         DC    X'404040034040403FC040FC4040404040'                      21320017
         DC    X'40404001FFFFFFFF80407C4040404040'                      21330017
         DC    X'40404040FFFFFFFF40403E4040404040'                      21340017
         DC    X'404040407FFFFFFE40400F4040404040'                      21350017
         DC    X'404040403FFFFFFC4040038040404040'                      21360017
         DC    X'404040401FFFFFF8404000C040404040'                      21370017
PAT6     DC    X'404040400FFFFFFFFFFF404040404040'                      21380017
         DC    X'404040401FFFFFFFFFFF804040404040'                      21390017
         DC    X'404040403FFFFFFFFFFFC04040404040'                      21400017
         DC    X'404040407FFFFFFFFFFFE04040404040'                      21410017
         DC    X'40404040FFFFFFFFFFFFF04040404040'                      21420017
         DC    X'40404001FE404040C040184040404040'                      21430017
         DC    X'40404003FC40404060400C4040404040'                      21440017
         DC    X'40404007F84040403040064040404040'                      21450017
         DC    X'4040400FF040404018400F4040404040'                      21460017
         DC    X'4040401FE04040403C401F8040404040'                      21470017
         DC    X'4040403FC04040407E403FC040404040'                      21480017
         DC    X'4040401F80404040FF407F8040404040'                      21490017
         DC    X'4040400F40404001FF40FF4040404040'                      21500017
         DC    X'4040400640404003FC01FE4040404040'                      21510017
         DC    X'4040400340404007F803FC4040404040'                      21520017
         DC    X'40404001FFFFFFFFF007F84040404040'                      21530017
         DC    X'40404040FFFFFFFFE00FF04040404040'                      21540017
         DC    X'404040407FFFFFFFC00FE04040404040'                      21550017
         DC    X'404040403FFFFFFF8003C04040404040'                      21560017
         DC    X'404040401FFFFFFE4000804040404040'                      21570017
PAT7     DC    X'40404030404040404040204040404040'                      21580017
         DC    X'40404018404040404040384040404040'                      21590017
         DC    X'4040400C4040404040403E4040404040'                      21600017
         DC    X'40404007C040404040403F8040404040'                      21610017
         DC    X'40404003FFC0404040403FC040404040'                      21620017
         DC    X'40404001FFFFC04040403F8040404040'                      21630017
         DC    X'40404040FFFFFE4040403F8040404040'                      21640017
         DC    X'404040407FFFFFFC40403F4040404040'                      21650017
         DC    X'404040403FFFFFFF80403F4040404040'                      21660017
         DC    X'404040401801FFFFF0401F4040404040'                      21670017
         DC    X'404040400C4003FFFE401F4040404040'                      21680017
         DC    X'404040400640400FFFC01F4040404040'                      21690017
         DC    X'40404040404040407FF00F4040404040'                      21700017
         DC    X'404040404040404003FE0F4040404040'                      21710017
         DC    X'4040404040404040403FC78040404040'                      21720017
         DC    X'40404040404040404007E78040404040'                      21730017
         DC    X'40404040404040404040FF8040404040'                      21740017
         DC    X'404040404040404040400F8040404040'                      21750017
         DC    X'4040404040404040404001C040404040'                      21760017
         DC    X'4040404040404040404040C040404040'                      21770017
PAT8     DC    X'404040401FFFE040FFFF404040404040'                      21780017
         DC    X'404040403FFFF801FFFF804040404040'                      21790017
         DC    X'404040407FFFFE03FFFFC04040404040'                      21800017
         DC    X'40404040FFFFFF07FFFFE04040404040'                      21810017
         DC    X'40404001FFFFFF8FFFFFF04040404040'                      21820017
         DC    X'40404003FC4001DFE040184040404040'                      21830017
         DC    X'40404007F840407FC0400C4040404040'                      21840017
         DC    X'4040400FF040407F8040064040404040'                      21850017
         DC    X'4040401FE04040FF40400F4040404040'                      21860017
         DC    X'4040403FC04001FE40401F8040404040'                      21870017
         DC    X'4040401F804003FC40403FC040404040'                      21880017
         DC    X'4040400F404007F840407F8040404040'                      21890017
         DC    X'4040400640400FF04040FF4040404040'                      21900017
         DC    X'4040400340401FF04001FE4040404040'                      21910017
         DC    X'4040400180403FDC4003FC4040404040'                      21920017
         DC    X'40404040FFFFFF8FFFFFF84040404040'                      21930017
         DC    X'404040407FFFFF07FFFFF04040404040'                      21940017
         DC    X'404040403FFFFE03FFFFE04040404040'                      21950017
         DC    X'404040401FFFFC40FFFFC04040404040'                      21960017
         DC    X'404040400FFFF8407FFF804040404040'                      21970017
PAT9     DC    X'40404040104040FFFFFF804040404040'                      21980017
         DC    X'404040403C4001FFFFFFC04040404040'                      21990017
         DC    X'404040407F4003FFFFFFE04040404040'                      22000017
         DC    X'40404040FF4007FFFFFFF04040404040'                      22010017
         DC    X'40404001FE400FFFFFFFF84040404040'                      22020017
         DC    X'40404003FC401FE040400C4040404040'                      22030017
         DC    X'40404007F8403FC04040064040404040'                      22040017
         DC    X'4040400FF0407F8040400F4040404040'                      22050017
         DC    X'4040401FE040FF4040401F8040404040'                      22060017
         DC    X'4040403FC0407E4040403FC040404040'                      22070017
         DC    X'4040401F80403C4040407F8040404040'                      22080017
         DC    X'4040400F404018404040FF4040404040'                      22090017
         DC    X'4040400640400C404001FE4040404040'                      22100017
         DC    X'40404003404006404003FC4040404040'                      22110017
         DC    X'40404001804003404007F84040404040'                      22120017
         DC    X'40404040FFFFFFFFFFFFF04040404040'                      22130017
         DC    X'404040407FFFFFFFFFFFE04040404040'                      22140017
         DC    X'404040403FFFFFFFFFFFC04040404040'                      22150017
         DC    X'404040401FFFFFFFFFFF804040404040'                      22160017
         DC    X'404040400FFFFFFFFFFF404040404040'                      22170017
         DC    X'40404040404040404040404040404040'                      22180017
PATBLK   DC    X'40404040404040404040404040404040'                      22190017
         DC    X'40404040404040404040404040404040'                      22200017
         DC    X'40404040404040404040404040404040'                      22210017
         DC    X'40404040404040404040404040404040'                      22220017
         DC    X'40404040404040404040404040404040'                      22230017
         DC    X'40404040404040404040404040404040'                      22240017
         DC    X'40404040404040404040404040404040'                      22250017
         DC    X'40404040404040404040404040404040'                      22260017
         DC    X'40404040404040404040404040404040'                      22270017
         DC    X'40404040404040404040404040404040'                      22280017
         DC    X'40404040404040404040404040404040'                      22290017
         DC    X'40404040404040404040404040404040'                      22300017
         DC    X'40404040404040404040404040404040'                      22310017
         DC    X'40404040404040404040404040404040'                      22320017
         DC    X'40404040404040404040404040404040'                      22330017
         DC    X'40404040404040404040404040404040'                      22340017
         DC    X'40404040404040404040404040404040'                      22350017
         DC    X'40404040404040404040404040404040'                      22360017
         DC    X'40404040404040404040404040404040'                      22370017
         DC    X'40404040404040404040404040404040'                      22380017
PATSP    DC    X'40404040404040404040404040404040'                      22390017
         DC    X'40404040404040404040404040404040'                      22400017
         DC    X'40404040404040404040404040404040'                      22410017
PATUNLIN DC    0D'+0'                                                   22420017
PATUCNT  DC    X'000000000000FFFFF800000000000000'                      22430017
         DC    X'000000000001FFFFFC00000000000000'                      22440017
         DC    X'000000000003FFFFFE00000000000000'                      22450017
         DC    X'000000000007FFFFFF00000000000000'                      22460017
         DC    X'00000000000FFFFFFF80000000000000'                      22470017
         DC    X'00000000001FE00000C0000000000000'                      22480017
         DC    X'00000000003FC0000060000000000000'                      22490017
         DC    X'00000000007F80000030000000000000'                      22500017
         DC    X'0000000000FF00000018000000000000'                      22510017
         DC    X'0000000001FE0000000C000000000000'                      22520017
         DC    X'0000000003FC0000001E000000000000'                      22530017
         DC    X'0000003FFFF80000003FFFC000000000'                      22540017
         DC    X'0000003FFFF00000007FFFC000000000'                      22550017
         DC    X'0000000007F8000000FF000000000000'                      22560017
         DC    X'0000000003FC000001FE000000000000'                      22570017
         DC    X'0000000001FE000003FC000000000000'                      22580017
         DC    X'0000000000FF000007F8000000000000'                      22590017
         DC    X'00000000007F800007F0000000000000'                      22600017
         DC    X'00000000003E000001E0000000000000'                      22610017
         DC    X'00000000001800000040000000000000'                      22620017
PATUPER  DC    X'00000001000000000000000000000000'                      22630017
         DC    X'00000001800000000000000000000000'                      22640017
         DC    X'00000003F00000000000000000000000'                      22650017
         DC    X'0000000FFC0000000000000000000000'                      22660017
         DC    X'0000003FFE0000000000000000000000'                      22670017
         DC    X'0000003FFE0000000000000000000000'                      22680017
         DC    X'0000001FF80000000000000000000000'                      22690017
         DC    X'00000007E00000000000000000000000'                      22700017
         DC    X'00000001800000000000000000000000'                      22710017
PATULP   DC    X'00000000000000000000002000000000'                      22720017
         DC    X'0000000000FFFFFFFFFFFFF000000000'                      22730017
         DC    X'0000000001FFFFFFFFFFFFF800000000'                      22740017
         DC    X'0000000003FFFFFFFFFFFFFC00000000'                      22750017
         DC    X'0000000007FFFFFFFFFFFFFE00000000'                      22760017
         DC    X'000000000FFFFFFFFFFFFFFF00000000'                      22770017
         DC    X'00000000180000000000000180000000'                      22780017
         DC    X'000000003000000000000000C0000000'                      22790017
         DC    X'00000000600000000000000060000000'                      22800017
         DC    X'00000000C00000000000000030000000'                      22810017
         DC    X'00000001800000000000000018000000'                      22820017
         DC    X'0000000300000000000000000C000000'                      22830017
         DC    X'00000006000000000000000006000000'                      22840017
         DC    X'0000000C000000000000000003000000'                      22850017
         DC    X'00000018000000000000000001800000'                      22860017
         DC    X'00000030000000000000000000C00000'                      22870017
PATUAMP  DC    X'00000000000000000020001000000000'                      22880017
         DC    X'0000000001FFFFF0003FFFF800000000'                      22890017
         DC    X'0000000003FFFFF8003FFFFC00000000'                      22900017
         DC    X'0000000007FFFFFC007FFFFE00000000'                      22910017
         DC    X'000000000FFFFFFE00FFFFFF00000000'                      22920017
         DC    X'000000001FFFFFFF00FFFFFF80000000'                      22930017
         DC    X'000000003FFFFFFF81FFFFFFC0000000'                      22940017
         DC    X'000000007FE00000C3FE000060000000'                      22950017
         DC    X'00000000FFC0000067FC0001F0000000'                      22960017
         DC    X'00000001FF8000003FF80007F8000000'                      22970017
         DC    X'00000003FF0000007FF0000FFC000000'                      22980017
         DC    X'00000007FE000001FFE0003FFE000000'                      22990017
         DC    X'0000000FFC00000FFFC0007FFF000000'                      23000017
         DC    X'0000001FF80000FFFF8000FFFF800000'                      23010017
         DC    X'0000003FF0000FFFFE0000FFFFC00000'                      23020017
         DC    X'0000001FE001FFFFF80001FFF8000000'                      23030017
         DC    X'0000000FC01FFFFFC00001FFE0000000'                      23040017
         DC    X'00000007C1FFFFFF000001FF80000000'                      23050017
         DC    X'000000031FFFFFC0000003FE00000000'                      23060017
         DC    X'00000001FFFFFC00000003FC00000000'                      23070017
         DC    X'00000003FFFFC000000003F800000000'                      23080017
         DC    X'0000000FFFF80000000003F000000000'                      23090017
         DC    X'0000003FFF800000000001E000000000'                      23100017
         DC    X'0000003FF8000000000001C000000000'                      23110017
         DC    X'0000003FEFFFFE000000008000000000'                      23120017
         DC    X'0000003FC7FFFF000000000000000000'                      23130017
         DC    X'0000003FC3FFFF800000000000000000'                      23140017
         DC    X'0000003FC1FFFFC00000000000000000'                      23150017
         DC    X'0000000F80FFFFE00000000000000000'                      23160017
         DC    X'00000007800000000000000000000000'                      23170017
         DC    X'00000001800000000000000000000000'                      23180017
PATUEXC  DC    X'000000010000000000000001E0000000'                      23190017
         DC    X'00000001C000000000000000FC000000'                      23200017
         DC    X'00000003F000000000000000FF000000'                      23210017
         DC    X'0000000FFC0000000003FFFFFF800000'                      23220017
         DC    X'0000003FFE1FFFFFFFFFFFFFFFC00000'                      23230017
         DC    X'0000003FFE1FFFFFFFFFFFFFFFC00000'                      23240017
         DC    X'0000001FF8001FFFFFFFFFFFFF800000'                      23250017
         DC    X'00000007E00000003FFFFFFFFF800000'                      23260017
         DC    X'00000001C000000000001FFFFF000000'                      23270017
         DC    X'00000000000000000000007FFC000000'                      23280017
PATUDOL  DC    X'000000000E00001FF000000000000000'                      23290017
         DC    X'0000000003C0007FFE00000000000000'                      23300017
         DC    X'0000000001F001FFFFC0000000000000'                      23310017
         DC    X'0000000000F801FF0030000000000000'                      23320017
         DC    X'0000000000FC01FE007C000000000000'                      23330017
         DC    X'0000000000FE03FC00FE000000000000'                      23340017
         DC    X'0000000000FE03FC01FF800000000000'                      23350017
         DC    X'0000003FFFFFFFFFFFFFFFC000000000'                      23360017
         DC    X'0000003FFFFFFFFFFFFFFFC000000000'                      23370017
         DC    X'0000000000FF03FC07FC000000000000'                      23380017
         DC    X'0000000001FF03FC07F8000000000000'                      23390017
         DC    X'0000003FFFFFFFFFFFFFFFC000000000'                      23400017
         DC    X'0000003FFFFFFFFFFFFFFFC000000000'                      23410017
         DC    X'000000000FFC03FC03F8000000000000'                      23420017
         DC    X'0000000003F803FC03F8000000000000'                      23430017
         DC    X'0000000001F007F801F8000000000000'                      23440017
         DC    X'0000000000600FF800F8000000000000'                      23450017
         DC    X'00000000001FFFF8007C000000000000'                      23460017
         DC    X'000000000003FFF0001E000000000000'                      23470017
         DC    X'000000000000FF800007000000000000'                      23480017
PATURP   DC    X'00000030000000000000000000C00000'                      23490017
         DC    X'00000018000000000000000001800000'                      23500017
         DC    X'0000000C000000000000000003000000'                      23510017
         DC    X'00000006000000000000000006000000'                      23520017
         DC    X'0000000300000000000000000C000000'                      23530017
         DC    X'00000001800000000000000018000000'                      23540017
         DC    X'00000000C00000000000000030000000'                      23550017
         DC    X'00000000600000000000000060000000'                      23560017
         DC    X'000000003000000000000000C0000000'                      23570017
         DC    X'00000000180000000000000180000000'                      23580017
         DC    X'000000000FFFFFFFFFFFFFFF00000000'                      23590017
         DC    X'0000000007FFFFFFFFFFFFFE00000000'                      23600017
         DC    X'0000000003FFFFFFFFFFFFFC00000000'                      23610017
         DC    X'0000000001FFFFFFFFFFFFF800000000'                      23620017
         DC    X'0000000000FFFFFFFFFFFFF000000000'                      23630017
         DC    X'00000000000000000000002000000000'                      23640017
PATUSEM  DC    X'00000000800000010000000000000000'                      23650017
         DC    X'0000000040000001C000000000000000'                      23660017
         DC    X'0000000060000003F000000000000000'                      23670017
         DC    X'000008007000000FFC00000000000000'                      23680017
         DC    X'00000C00F800003FFE00000000000000'                      23690017
         DC    X'00000701FC00003FFE00000000000000'                      23700017
         DC    X'000003FFFE00001FF800000000000000'                      23710017
         DC    X'000001FFFC000007E000000000000000'                      23720017
         DC    X'000000FFF8000001C000000000000000'                      23730017
         DC    X'0000003FF00000000000000000000000'                      23740017
         DC    X'00000007E00000000000000000000000'                      23750017
PATUDSH  DC    X'0000000000003E000000000000000000'                      23760017
         DC    X'0000000000000FC00000000000000000'                      23770017
         DC    X'00000000000007F00000000000000000'                      23780017
         DC    X'00000000000007F80000000000000000'                      23790017
         DC    X'00000000000007F80000000000000000'                      23800017
         DC    X'00000000000007F80000000000000000'                      23810017
         DC    X'00000000000007F80000000000000000'                      23820017
         DC    X'00000000000007F80000000000000000'                      23830017
         DC    X'00000000000007F80000000000000000'                      23840017
         DC    X'00000000000007F80000000000000000'                      23850017
         DC    X'00000000000007F80000000000000000'                      23860017
         DC    X'00000000000007F80000000000000000'                      23870017
         DC    X'00000000000007F80000000000000000'                      23880017
         DC    X'00000000000007F80000000000000000'                      23890017
         DC    X'00000000000003F80000000000000000'                      23900017
         DC    X'00000000000000FC0000000000000000'                      23910017
         DC    X'000000000000001F0000000000000000'                      23920017
PATUCOM  DC    X'00000000800000000000000000000000'                      23930017
         DC    X'00000000400000000000000000000000'                      23940017
         DC    X'00000000600000000000000000000000'                      23950017
         DC    X'00000800700000000000000000000000'                      23960017
         DC    X'00000C00F80000000000000000000000'                      23970017
         DC    X'00000701FC0000000000000000000000'                      23980017
         DC    X'000003FFFE0000000000000000000000'                      23990017
         DC    X'000001FFFC0000000000000000000000'                      24000017
         DC    X'000000FFF80000000000000000000000'                      24010017
         DC    X'0000003FF00000000000000000000000'                      24020017
         DC    X'00000007E00000000000000000000000'                      24030017
PATUQUE  DC    X'00000000000000000000000400000000'                      24040017
         DC    X'00000000000000000007FFFE00000000'                      24050017
         DC    X'0000000000000000000FFFFF00000000'                      24060017
         DC    X'0000000000000000001FFFFF80000000'                      24070017
         DC    X'0000000000000000003FFFFFC0000000'                      24080017
         DC    X'0000000000000000007FFFFFE0000000'                      24090017
         DC    X'0000000000000000003FFFFFF0000000'                      24100017
         DC    X'00000001000003F8001FC00018000000'                      24110017
         DC    X'0000000180003FFF800F80000C000000'                      24120017
         DC    X'00000003F001FFFFF00700001E000000'                      24130017
         DC    X'0000000FFC07FFFFF80200003F000000'                      24140017
         DC    X'0000003FFE1FFFFFFE0000007F800000'                      24150017
         DC    X'0000003FFE38007FFF000000FFC00000'                      24160017
         DC    X'0000001FF860001FFF800001FF800000'                      24170017
         DC    X'00000007E0000007FF800003FF000000'                      24180017
         DC    X'0000000180000001FFC00007FE000000'                      24190017
         DC    X'0000000000000000FFE0000FFC000000'                      24200017
         DC    X'00000000000000007FE0001FF8000000'                      24210017
         DC    X'00000000000000003FFFFFFFF0000000'                      24220017
         DC    X'00000000000000001FFFFFFFE0000000'                      24230017
         DC    X'00000000000000001FFFFFFFC0000000'                      24240017
         DC    X'00000000000000000FFFFFFF80000000'                      24250017
         DC    X'00000000000000000FFFFFFF00000000'                      24260017
         DC    X'00000000000000000000000200000000'                      24270017
PATUCOL  DC    X'00000001000000010000000000000000'                      24280017
         DC    X'00000001C0000001C000000000000000'                      24290017
         DC    X'00000003F0000003F000000000000000'                      24300017
         DC    X'0000000FFC00000FFC00000000000000'                      24310017
         DC    X'0000003FFE00003FFE00000000000000'                      24320017
         DC    X'0000003FFE00003FFE00000000000000'                      24330017
         DC    X'0000001FF800001FF800000000000000'                      24340017
         DC    X'00000007E0000007E000000000000000'                      24350017
         DC    X'00000001C0000001C000000000000000'                      24360017
PATUQUO  DC    X'00000000000000000000000008000000'                      24370017
         DC    X'0000000000000000000000000C000000'                      24380017
         DC    X'0000000000000000000001000E000000'                      24390017
         DC    X'0000000000000000000001801F000000'                      24400017
         DC    X'0000000000000000000000E03F800000'                      24410017
         DC    X'00000000000000000000007FFFC00000'                      24420017
         DC    X'00000000000000000000003FFF800000'                      24430017
         DC    X'00000000000000000000001FFF000000'                      24440017
         DC    X'000000000000000000000007FE000000'                      24450017
         DC    X'000000000000000000000001FC000000'                      24460017
PATUDQU  DC    X'000000000000000000000001F8000000'                      24470017
         DC    X'000000000000000000000007FE000000'                      24480017
         DC    X'00000000000000000000001FFF000000'                      24490017
         DC    X'00000000000000000000003FFF800000'                      24500017
         DC    X'00000000000000000000007FFFC00000'                      24510017
         DC    X'0000000000000000000000E03F800000'                      24520017
         DC    X'0000000000000000000001801F000000'                      24530017
         DC    X'0000000000000000000001000E000000'                      24540017
         DC    X'0000000000000000000000000C000000'                      24550017
         DC    X'00000000000000000000000008000000'                      24560017
         DC    X'00000000000000000000000000000000'                      24570017
         DC    X'000000000000000000000001F8000000'                      24580017
         DC    X'000000000000000000000007FE000000'                      24590017
         DC    X'00000000000000000000001FFF000000'                      24600017
         DC    X'00000000000000000000003FFF800000'                      24610017
         DC    X'00000000000000000000007FFFC00000'                      24620017
         DC    X'0000000000000000000000E03F800000'                      24630017
         DC    X'0000000000000000000001801F000000'                      24640017
         DC    X'0000000000000000000001000E000000'                      24650017
         DC    X'0000000000000000000000000C000000'                      24660017
         DC    X'00000000000000000000000008000000'                      24670017
PATUAL   DC    X'000000007FFF80060000000000000000'                      24680017
         DC    X'00000000FFFF80030000000000000000'                      24690017
         DC    X'00000001FFFFC0018000000000000000'                      24700017
         DC    X'00000003FFFFC000C000000000000000'                      24710017
         DC    X'00000007FFFFE0006000000000000000'                      24720017
         DC    X'0000000FF00020003000000000000000'                      24730017
         DC    X'0000001FE00030007800000000000000'                      24740017
         DC    X'0000003FC0001000FC00000000000000'                      24750017
         DC    X'0000001F80001801FE00000000000000'                      24760017
         DC    X'0000000F00000803FC00000000000000'                      24770017
         DC    X'0000000700000C07F800000000000000'                      24780017
         DC    X'000000038000040FF000000000000000'                      24790017
         DC    X'00000001FFFFFFFFE000000000000000'                      24800017
         DC    X'00000003FFFFFFFFC000000000000000'                      24810017
         DC    X'00000007FFFFFFFF8000000000000000'                      24820017
         DC    X'0000000FFFFFFFFF0000000000000000'                      24830017
         DC    X'0000001FFFFFFFFE0000000000000000'                      24840017
         DC    X'0000003FC00000000000000000000000'                      24850017
         DC    X'0000000F800000000000000000000000'                      24860017
         DC    X'00000003000000000000000000000000'                      24870017
PATUBL   DC    X'00000000000000000000001000000000'                      24880017
         DC    X'00000000000000000000003800000000'                      24890017
         DC    X'000000007FFFFFFFFFFFFFFC00000000'                      24900017
         DC    X'00000000FFFFFFFFFFFFFFFE00000000'                      24910017
         DC    X'00000001FFFFFFFFFFFFFFFF00000000'                      24920017
         DC    X'00000003FFFFFFFFFFFFFFFE00000000'                      24930017
         DC    X'00000007FFFFFFFFFFFFFFFC00000000'                      24940017
         DC    X'0000000FF0000000C000003800000000'                      24950017
         DC    X'0000001FE00000006000001000000000'                      24960017
         DC    X'0000003FC00000003000000000000000'                      24970017
         DC    X'0000001F800000007800000000000000'                      24980017
         DC    X'0000000F00000000FC00000000000000'                      24990017
         DC    X'0000000600000001FE00000000000000'                      25000017
         DC    X'0000000300000003FC00000000000000'                      25010017
         DC    X'0000000180000007F800000000000000'                      25020017
         DC    X'00000000FFFFFFFFF000000000000000'                      25030017
         DC    X'000000007FFFFFFFE000000000000000'                      25040017
         DC    X'000000003FFFFFFFC000000000000000'                      25050017
         DC    X'000000001FFFFFFF8000000000000000'                      25060017
         DC    X'000000000FFFFFFF0000000000000000'                      25070017
PATUCL   DC    X'0000000003FFFFE00000000000000000'                      25080017
         DC    X'0000000007FFFFF00000000000000000'                      25090017
         DC    X'000000000FFFFFF80000000000000000'                      25100017
         DC    X'000000001FFFFFFC0000000000000000'                      25110017
         DC    X'000000003FFFFFFE0000000000000000'                      25120017
         DC    X'000000007F8000030000000000000000'                      25130017
         DC    X'00000000FF0000018000000000000000'                      25140017
         DC    X'00000001FE000000C000000000000000'                      25150017
         DC    X'00000003FC0000006000000000000000'                      25160017
         DC    X'00000007F80000003000000000000000'                      25170017
         DC    X'0000000FF00000007800000000000000'                      25180017
         DC    X'0000001FE0000000FC00000000000000'                      25190017
         DC    X'0000003FC0000001FE00000000000000'                      25200017
         DC    X'0000001FE0000003FC00000000000000'                      25210017
         DC    X'0000000FF0000007F800000000000000'                      25220017
         DC    X'00000007F800000FF000000000000000'                      25230017
         DC    X'00000003FC00001FE000000000000000'                      25240017
         DC    X'00000001FE00001FC000000000000000'                      25250017
         DC    X'00000000F80000078000000000000000'                      25260017
         DC    X'00000000600000010000000000000000'                      25270017
PATUDL   DC    X'000000007FFFFFF80000000000000000'                      25280017
         DC    X'00000000FFFFFFFC0000002000000000'                      25290017
         DC    X'00000001FFFFFFFE000000F800000000'                      25300017
         DC    X'00000003FFFFFFFF000003FE00000000'                      25310017
         DC    X'00000007FFFFFFFF80000FFF00000000'                      25320017
         DC    X'0000000FF0000000C0003FFE00000000'                      25330017
         DC    X'0000001FE00000006000FFF800000000'                      25340017
         DC    X'0000003FC00000003003FFE000000000'                      25350017
         DC    X'0000001F80000000180FFF8000000000'                      25360017
         DC    X'0000000F000000000C3FFE0000000000'                      25370017
         DC    X'000000060000000006FFF80000000000'                      25380017
         DC    X'000000030000000003FFE00000000000'                      25390017
         DC    X'00000001800000000FFF800000000000'                      25400017
         DC    X'00000003FFFFFFFFFFFE000000000000'                      25410017
         DC    X'00000007FFFFFFFFFFF8000000000000'                      25420017
         DC    X'0000000FFFFFFFFFFFE0000000000000'                      25430017
         DC    X'0000001FFFFFFFFFFF80000000000000'                      25440017
         DC    X'0000003FFFFFFFFFFE00000000000000'                      25450017
         DC    X'0000000F000000000000000000000000'                      25460017
         DC    X'00000002000000000000000000000000'                      25470017
PATUEL   DC    X'0000000003FFFFE00000000000000000'                      25480017
         DC    X'0000000007FFFFF00000000000000000'                      25490017
         DC    X'000000000FFFFFF80000000000000000'                      25500017
         DC    X'000000001FFFFFFC0000000000000000'                      25510017
         DC    X'000000003FFFFFFE0000000000000000'                      25520017
         DC    X'000000007F80C0030000000000000000'                      25530017
         DC    X'00000000FF0060018000000000000000'                      25540017
         DC    X'00000001FE003000C000000000000000'                      25550017
         DC    X'00000003FC0018006000000000000000'                      25560017
         DC    X'00000007F8000C003000000000000000'                      25570017
         DC    X'0000000FF00006007800000000000000'                      25580017
         DC    X'0000001FE0000300FC00000000000000'                      25590017
         DC    X'0000003FC0000181FE00000000000000'                      25600017
         DC    X'0000001FE00000C3FC00000000000000'                      25610017
         DC    X'0000000FF0000067F800000000000000'                      25620017
         DC    X'00000007F800003FF000000000000000'                      25630017
         DC    X'00000003FC00001FE000000000000000'                      25640017
         DC    X'00000001FE00000FC000000000000000'                      25650017
         DC    X'00000000F80000078000000000000000'                      25660017
         DC    X'00000000300000010000000000000000'                      25670017
PATUFL   DC    X'00000000000000040000000000000000'                      25680017
         DC    X'00000000000000070000000000000000'                      25690017
         DC    X'0000000000000007C000000000000000'                      25700017
         DC    X'0000000000000007F000000000000000'                      25710017
         DC    X'0000000400000007F800000000000000'                      25720017
         DC    X'0000000FFFFFFFFFFFFFFE0000000000'                      25730017
         DC    X'0000001FFFFFFFFFFFFFFF0000000000'                      25740017
         DC    X'0000003FFFFFFFFFFFFFFF8000000000'                      25750017
         DC    X'0000001FFFFFFFFFFFFFFFC000000000'                      25760017
         DC    X'0000000FFFFFFFFFFFFFFFE000000000'                      25770017
         DC    X'0000000400000007F800003000000000'                      25780017
         DC    X'0000000000000007F800001800000000'                      25790017
         DC    X'0000000000000003F800003C00000000'                      25800017
         DC    X'0000000000000000F800007E00000000'                      25810017
         DC    X'0000000000000000380000FF00000000'                      25820017
         DC    X'000000000000000008003FFE00000000'                      25830017
         DC    X'000000000000000000003FFC00000000'                      25840017
         DC    X'000000000000000000003FF800000000'                      25850017
         DC    X'000000000000000000003FF000000000'                      25860017
         DC    X'000000000000000000003FE000000000'                      25870017
PATUGL   DC    X'003F00007FFFFFF80000000000000000'                      25880017
         DC    X'007F0000FFFFFFFC0000000000000000'                      25890017
         DC    X'00FF0001FFFFFFFE0000000000000000'                      25900017
         DC    X'01FF0003FFFFFFFF0000000000000000'                      25910017
         DC    X'03FF0007FFFFFFFF8000000000000000'                      25920017
         DC    X'07F0000FF0000000C000000000000000'                      25930017
         DC    X'0FE0001FE00000006000000000000000'                      25940017
         DC    X'1FC0003FC00000003000000000000000'                      25950017
         DC    X'3F80001F800000007800000000000000'                      25960017
         DC    X'7F00000F00000000FC00000000000000'                      25970017
         DC    X'3E00000600000001FE00000000000000'                      25980017
         DC    X'1C00000300000003FC00000000000000'                      25990017
         DC    X'0C00000180000007F800000000000000'                      26000017
         DC    X'07FFFFFFFFFFFFFFF000000000000000'                      26010017
         DC    X'03FFFFFFFFFFFFFFE000000000000000'                      26020017
         DC    X'01FFFFFFFFFFFFFFC000000000000000'                      26030017
         DC    X'00FFFFFFFFFFFFFF8000000000000000'                      26040017
         DC    X'007FFFFFFFFFFFFF0000000000000000'                      26050017
PATUHL   DC    X'00000000000000000000001000000000'                      26060017
         DC    X'00000004000000000000003800000000'                      26070017
         DC    X'0000000FFFFFFFFFFFFFFFFC00000000'                      26080017
         DC    X'0000001FFFFFFFFFFFFFFFFE00000000'                      26090017
         DC    X'0000003FFFFFFFFFFFFFFFFF00000000'                      26100017
         DC    X'0000001FFFFFFFFFFFFFFFFE00000000'                      26110017
         DC    X'0000000FFFFFFFFFFFFFFFFC00000000'                      26120017
         DC    X'00000004000000018000003800000000'                      26130017
         DC    X'00000000000000006000001000000000'                      26140017
         DC    X'00000000000000003000000000000000'                      26150017
         DC    X'00000000000000007800000000000000'                      26160017
         DC    X'0000000000000000FC00000000000000'                      26170017
         DC    X'0000000000000001FE00000000000000'                      26180017
         DC    X'0000000400000003FC00000000000000'                      26190017
         DC    X'0000000FFFFFFFFFF800000000000000'                      26200017
         DC    X'0000001FFFFFFFFFF000000000000000'                      26210017
         DC    X'0000003FFFFFFFFFE000000000000000'                      26220017
         DC    X'0000001FFFFFFFFFC000000000000000'                      26230017
         DC    X'0000000FFFFFFFFF8000000000000000'                      26240017
         DC    X'00000004000000000000000000000000'                      26250017
PATUIL   DC    X'00000000000000001004000000000000'                      26260017
         DC    X'00000003FFFFFFFFF80E000000000000'                      26270017
         DC    X'00000007FFFFFFFFFC1F000000000000'                      26280017
         DC    X'0000000FFFFFFFFFFE3F800000000000'                      26290017
         DC    X'0000001FFFFFFFFFFC1F000000000000'                      26300017
         DC    X'0000003FFFFFFFFFF80E000000000000'                      26310017
         DC    X'0000001FC00000001004000000000000'                      26320017
         DC    X'0000000F800000000000000000000000'                      26330017
         DC    X'00000007000000000000000000000000'                      26340017
         DC    X'00000003000000000000000000000000'                      26350017
PATUJL   DC    X'007F0000000000000000000000000000'                      26360017
         DC    X'00FF0000000000000000000000000000'                      26370017
         DC    X'01FF0000000000000000000000000000'                      26380017
         DC    X'03FF0000000000000000000000000000'                      26390017
         DC    X'07FF0000000000000000000000000000'                      26400017
         DC    X'0FE00000000000000000000000000000'                      26410017
         DC    X'1FC00000000000000000000000000000'                      26420017
         DC    X'3F800000000000000000000000000000'                      26430017
         DC    X'7F000000000000000000000000000000'                      26440017
         DC    X'3E000000000000000000000000000000'                      26450017
         DC    X'1C000000000000000000000000000000'                      26460017
         DC    X'0C000000000000000000000000000000'                      26470017
         DC    X'06000000000000001004000000000000'                      26480017
         DC    X'03FFFFFFFFFFFFFFF80E000000000000'                      26490017
         DC    X'01FFFFFFFFFFFFFFFC1F000000000000'                      26500017
         DC    X'00FFFFFFFFFFFFFFFE3F800000000000'                      26510017
         DC    X'007FFFFFFFFFFFFFFC1F000000000000'                      26520017
         DC    X'003FFFFFFFFFFFFFF80E000000000000'                      26530017
         DC    X'00000000000000001004000000000000'                      26540017
PATUKL   DC    X'00000000000000000000001000000000'                      26550017
         DC    X'00000004000000000000003800000000'                      26560017
         DC    X'0000000FFFFFFFFFFFFFFFFC00000000'                      26570017
         DC    X'0000001FFFFFFFFFFFFFFFFE00000000'                      26580017
         DC    X'0000003FFFFFFFFFFFFFFFFF00000000'                      26590017
         DC    X'0000001FFFFFFFFFFFFFFFFE00000000'                      26600017
         DC    X'0000000FFFFFFFFFFFFFFFFC00000000'                      26610017
         DC    X'0000000400008000C000003800000000'                      26620017
         DC    X'00000000000040006000001000000000'                      26630017
         DC    X'000000000000E0003000000000000000'                      26640017
         DC    X'000000000001E0007800000000000000'                      26650017
         DC    X'000000000003F000FC00000000000000'                      26660017
         DC    X'000000000007F001FE00000000000000'                      26670017
         DC    X'00000004000FF803FC00000000000000'                      26680017
         DC    X'0000000FFFFFE807F800000000000000'                      26690017
         DC    X'0000001FFFFFCFFFF000000000000000'                      26700017
         DC    X'0000003FFFFFC7FFE000000000000000'                      26710017
         DC    X'0000001FFFFF07FFC000000000000000'                      26720017
         DC    X'0000000FFFFE03FF8000000000000000'                      26730017
         DC    X'00000004000003FF0000000000000000'                      26740017
PATULL   DC    X'00000004000000000000000800000000'                      26750017
         DC    X'0000000FFFFFFFFFFFFFFFFC00000000'                      26760017
         DC    X'0000001FFFFFFFFFFFFFFFFE00000000'                      26770017
         DC    X'0000003FFFFFFFFFFFFFFFFF00000000'                      26780017
         DC    X'0000001FFFFFFFFFFFFFFFFE00000000'                      26790017
         DC    X'0000000FFFFFFFFFFFFFFFFC00000000'                      26800017
         DC    X'00000004000000000000000800000000'                      26810017
PATUML   DC    X'00000000000000008000000000000000'                      26820017
         DC    X'0000000400000000E000000000000000'                      26830017
         DC    X'0000000FFFFFFFFFF800000000000000'                      26840017
         DC    X'0000001FFFFFFFFFFE00000000000000'                      26850017
         DC    X'0000003FFFFFFFFFFE00000000000000'                      26860017
         DC    X'0000001FFFFFFFFFF800000000000000'                      26870017
         DC    X'0000000FFFFFFFFFE000000000000000'                      26880017
         DC    X'00000004000000018000000000000000'                      26890017
         DC    X'0000000000000000C000000000000000'                      26900017
         DC    X'00000000000000006000000000000000'                      26910017
         DC    X'00000000000000003000000000000000'                      26920017
         DC    X'00000000000000007800000000000000'                      26930017
         DC    X'0000000000000000FC00000000000000'                      26940017
         DC    X'0000000400000001FE00000000000000'                      26950017
         DC    X'0000000FFFFFFFFFFC00000000000000'                      26960017
         DC    X'0000001FFFFFFFFFF800000000000000'                      26970017
         DC    X'0000003FFFFFFFFFF000000000000000'                      26980017
         DC    X'0000001FFFFFFFFFE000000000000000'                      26990017
         DC    X'0000000FFFFFFFFFC000000000000000'                      27000017
         DC    X'00000004000000006000000000000000'                      27010017
         DC    X'00000000000000003000000000000000'                      27020017
         DC    X'00000000000000007800000000000000'                      27030017
         DC    X'0000000000000000FC00000000000000'                      27040017
         DC    X'0000000400000001FE00000000000000'                      27050017
         DC    X'0000000FFFFFFFFFFC00000000000000'                      27060017
         DC    X'0000001FFFFFFFFFF800000000000000'                      27070017
         DC    X'0000003FFFFFFFFFF000000000000000'                      27080017
         DC    X'0000001FFFFFFFFFE000000000000000'                      27090017
         DC    X'0000000FFFFFFFFFC000000000000000'                      27100017
         DC    X'00000004000000000000000000000000'                      27110017
PATUNL   DC    X'00000000000000008000000000000000'                      27120017
         DC    X'0000000400000000E000000000000000'                      27130017
         DC    X'0000000FFFFFFFFFF800000000000000'                      27140017
         DC    X'0000001FFFFFFFFFFE00000000000000'                      27150017
         DC    X'0000003FFFFFFFFFFE00000000000000'                      27160017
         DC    X'0000001FFFFFFFFFF800000000000000'                      27170017
         DC    X'0000000FFFFFFFFFE000000000000000'                      27180017
         DC    X'00000004000000018000000000000000'                      27190017
         DC    X'0000000000000000C000000000000000'                      27200017
         DC    X'00000000000000006000000000000000'                      27210017
         DC    X'00000000000000003000000000000000'                      27220017
         DC    X'00000000000000007800000000000000'                      27230017
         DC    X'0000000000000000FC00000000000000'                      27240017
         DC    X'0000000400000001FE00000000000000'                      27250017
         DC    X'0000000FFFFFFFFFFC00000000000000'                      27260017
         DC    X'0000001FFFFFFFFFF800000000000000'                      27270017
         DC    X'0000003FFFFFFFFFF000000000000000'                      27280017
         DC    X'0000001FFFFFFFFFE000000000000000'                      27290017
         DC    X'0000000FFFFFFFFFC000000000000000'                      27300017
         DC    X'00000004000000000000000000000000'                      27310017
PATUOL   DC    X'000000001FFFFFF80000000000000000'                      27320017
         DC    X'000000003FFFFFFC0000000000000000'                      27330017
         DC    X'000000007FFFFFFE0000000000000000'                      27340017
         DC    X'00000000FFFFFFFF0000000000000000'                      27350017
         DC    X'00000001FFFFFFFF8000000000000000'                      27360017
         DC    X'00000003FC000000C000000000000000'                      27370017
         DC    X'00000007F80000006000000000000000'                      27380017
         DC    X'0000000FF00000003000000000000000'                      27390017
         DC    X'0000001FE00000007800000000000000'                      27400017
         DC    X'0000003FC0000000FC00000000000000'                      27410017
         DC    X'0000001F80000001FE00000000000000'                      27420017
         DC    X'0000000F00000003FC00000000000000'                      27430017
         DC    X'0000000600000007F800000000000000'                      27440017
         DC    X'000000030000000FF000000000000000'                      27450017
         DC    X'000000018000001FE000000000000000'                      27460017
         DC    X'00000000FFFFFFFFC000000000000000'                      27470017
         DC    X'000000007FFFFFFF8000000000000000'                      27480017
         DC    X'000000003FFFFFFF0000000000000000'                      27490017
         DC    X'000000001FFFFFFE0000000000000000'                      27500017
         DC    X'000000000FFFFFFC0000000000000000'                      27510017
PATUPL   DC    X'04000000000000002000000000000000'                      27520017
         DC    X'0E000000000000007000000000000000'                      27530017
         DC    X'1FFFFFFFFFFFFFFFF800000000000000'                      27540017
         DC    X'3FFFFFFFFFFFFFFFFC00000000000000'                      27550017
         DC    X'7FFFFFFFFFFFFFFFFE00000000000000'                      27560017
         DC    X'3FFFFFFFFFFFFFFFF800000000000000'                      27570017
         DC    X'1FFFFFFFFFFFFFFFE000000000000000'                      27580017
         DC    X'0E00000FF0000000C000000000000000'                      27590017
         DC    X'0400001FE00000006000000000000000'                      27600017
         DC    X'0000003FC00000003000000000000000'                      27610017
         DC    X'0000001F800000007800000000000000'                      27620017
         DC    X'0000000F00000000FC00000000000000'                      27630017
         DC    X'0000000600000001FE00000000000000'                      27640017
         DC    X'0000000300000003FC00000000000000'                      27650017
         DC    X'0000000180000007F800000000000000'                      27660017
         DC    X'00000000FFFFFFFFF000000000000000'                      27670017
         DC    X'000000007FFFFFFFE000000000000000'                      27680017
         DC    X'000000003FFFFFFFC000000000000000'                      27690017
         DC    X'000000001FFFFFFF8000000000000000'                      27700017
         DC    X'000000000FFFFFFF0000000000000000'                      27710017
PATUQL   DC    X'000000007FFFFFF80000000000000000'                      27720017
         DC    X'00000000FFFFFFFC0000000000000000'                      27730017
         DC    X'00000001FFFFFFFE0000000000000000'                      27740017
         DC    X'00000003FFFFFFFF0000000000000000'                      27750017
         DC    X'00000007FFFFFFFF8000000000000000'                      27760017
         DC    X'0000000FF0000000C000000000000000'                      27770017
         DC    X'0000001FE00000006000000000000000'                      27780017
         DC    X'0000003FC00000003000000000000000'                      27790017
         DC    X'0000001F800000007800000000000000'                      27800017
         DC    X'0000000F00000000FC00000000000000'                      27810017
         DC    X'0000000600000001FE00000000000000'                      27820017
         DC    X'0400000300000003FC00000000000000'                      27830017
         DC    X'0E00000180000007F800000000000000'                      27840017
         DC    X'1FFFFFFFFFFFFFFFF000000000000000'                      27850017
         DC    X'3FFFFFFFFFFFFFFFE000000000000000'                      27860017
         DC    X'7FFFFFFFFFFFFFFFC000000000000000'                      27870017
         DC    X'3FFFFFFFFFFFFFFF8000000000000000'                      27880017
         DC    X'1FFFFFFFFFFFFFFF0000000000000000'                      27890017
         DC    X'0E000000000000000000000000000000'                      27900017
         DC    X'04000000000000000000000000000000'                      27910017
PATURL   DC    X'00000000000000008000000000000000'                      27920017
         DC    X'0000000400000000E000000000000000'                      27930017
         DC    X'0000000FFFFFFFFFF800000000000000'                      27940017
         DC    X'0000001FFFFFFFFFFE00000000000000'                      27950017
         DC    X'0000003FFFFFFFFFFE00000000000000'                      27960017
         DC    X'0000001FFFFFFFFFF800000000000000'                      27970017
         DC    X'0000000FFFFFFFFFE000000000000000'                      27980017
         DC    X'00000004000000018000000000000000'                      27990017
         DC    X'0000000000000000C000000000000000'                      28000017
         DC    X'00000000000000006000000000000000'                      28010017
         DC    X'00000000000000003000000000000000'                      28020017
         DC    X'00000000000000007800000000000000'                      28030017
         DC    X'0000000000000000FC00000000000000'                      28040017
         DC    X'0000000000000001FE00000000000000'                      28050017
         DC    X'0000000000000003FC00000000000000'                      28060017
         DC    X'000000000000003FF800000000000000'                      28070017
         DC    X'000000000000003FF000000000000000'                      28080017
         DC    X'000000000000003FE000000000000000'                      28090017
         DC    X'000000000000003FC000000000000000'                      28100017
         DC    X'000000000000003F8000000000000000'                      28110017
PATUSL   DC    X'0000003800007FC00000000000000000'                      28120017
         DC    X'0000000F0001FFF80000000000000000'                      28130017
         DC    X'00000007C007FFFF0000000000000000'                      28140017
         DC    X'00000003E007FC00C000000000000000'                      28150017
         DC    X'00000003F007F801F000000000000000'                      28160017
         DC    X'00000003F80FF003F800000000000000'                      28170017
         DC    X'00000003F80FF007FE00000000000000'                      28180017
         DC    X'00000003FC0FF00FFC00000000000000'                      28190017
         DC    X'00000003FC0FF00FF800000000000000'                      28200017
         DC    X'00000003FC0FF01FF000000000000000'                      28210017
         DC    X'00000007FC0FF01FE000000000000000'                      28220017
         DC    X'0000000FF80FF01FE000000000000000'                      28230017
         DC    X'0000001FF80FF01FE000000000000000'                      28240017
         DC    X'0000003FF00FF00FE000000000000000'                      28250017
         DC    X'0000000FE00FF00FE000000000000000'                      28260017
         DC    X'00000007C01FE007E000000000000000'                      28270017
         DC    X'00000001803FE003E000000000000000'                      28280017
         DC    X'000000007FFFE001F000000000000000'                      28290017
         DC    X'000000000FFFC0007800000000000000'                      28300017
         DC    X'0000000001FF80000C00000000000000'                      28310017
PATUTL   DC    X'00000000000000000400000000000000'                      28320017
         DC    X'00000000000000000600000000000000'                      28330017
         DC    X'00000000000000000700000000000000'                      28340017
         DC    X'00000000000000000780000000000000'                      28350017
         DC    X'000000000000000007C0000000000000'                      28360017
         DC    X'000000000000000007E0000000000000'                      28370017
         DC    X'000000000000000007F0000000000000'                      28380017
         DC    X'00000003FFFFFFFFFFFFF00000000000'                      28390017
         DC    X'00000007FFFFFFFFFFFFF80000000000'                      28400017
         DC    X'0000000FFFFFFFFFFFFFFC0000000000'                      28410017
         DC    X'0000001FFFFFFFFFFFFFFE0000000000'                      28420017
         DC    X'0000003FFFFFFFFFFFFFFF0000000000'                      28430017
         DC    X'0000001F8000000007F0000000000000'                      28440017
         DC    X'0000000F0000000003F0000000000000'                      28450017
         DC    X'000000060000000001F0000000000000'                      28460017
         DC    X'000000030000000000F0000000000000'                      28470017
         DC    X'00000001800000000070000000000000'                      28480017
         DC    X'00000000000000000030000000000000'                      28490017
         DC    X'00000000000000000010000000000000'                      28500017
PATUUL   DC    X'00000000000000002000000000000000'                      28510017
         DC    X'00000000000000007800000000000000'                      28520017
         DC    X'00000003FFFFFFFFFE00000000000000'                      28530017
         DC    X'00000007FFFFFFFFFC00000000000000'                      28540017
         DC    X'0000000FFFFFFFFFF800000000000000'                      28550017
         DC    X'0000001FFFFFFFFFF000000000000000'                      28560017
         DC    X'0000003FFFFFFFFFE000000000000000'                      28570017
         DC    X'0000001F800000000000000000000000'                      28580017
         DC    X'0000000F000000000000000000000000'                      28590017
         DC    X'00000006000000000000000000000000'                      28600017
         DC    X'00000003000000000000000000000000'                      28610017
         DC    X'00000001800000002000000000000000'                      28620017
         DC    X'00000001C00000007800000000000000'                      28630017
         DC    X'00000003FFFFFFFFFE00000000000000'                      28640017
         DC    X'0000000FFFFFFFFFFC00000000000000'                      28650017
         DC    X'0000003FFFFFFFFFF800000000000000'                      28660017
         DC    X'0000003FFFFFFFFFF000000000000000'                      28670017
         DC    X'0000000FFFFFFFFFE000000000000000'                      28680017
         DC    X'00000003800000000000000000000000'                      28690017
         DC    X'00000001000000000000000000000000'                      28700017
PATUVL   DC    X'00000000000000002000000000000000'                      28710017
         DC    X'00000000000000007800000000000000'                      28720017
         DC    X'000000003FFFFFFFFE00000000000000'                      28730017
         DC    X'000000007FFFFFFFFC00000000000000'                      28740017
         DC    X'00000000FFFFFFFFF800000000000000'                      28750017
         DC    X'00000001FFFFFFFFF000000000000000'                      28760017
         DC    X'00000003FFFFFFFFE000000000000000'                      28770017
         DC    X'00000007F80000001000000000000000'                      28780017
         DC    X'0000000FF00000000800000000000000'                      28790017
         DC    X'0000001FE00000000C00000000000000'                      28800017
         DC    X'0000003FC00000001E00000000000000'                      28810017
         DC    X'0000001F800000003F00000000000000'                      28820017
         DC    X'0000000F000000007F80000000000000'                      28830017
         DC    X'0000000300000000FFC0000000000000'                      28840017
         DC    X'00000001E0000003FFE0000000000000'                      28850017
         DC    X'000000007800001FFFC0000000000000'                      28860017
         DC    X'000000001F8001FFFF80000000000000'                      28870017
         DC    X'0000000007FFFFFFFE00000000000000'                      28880017
         DC    X'0000000000FFFFFFF800000000000000'                      28890017
         DC    X'00000000001FFFFFC000000000000000'                      28900017
         DC    X'000000000003FFFE0000000000000000'                      28910017
PATUWL   DC    X'00000000000000001000000000000000'                      28920017
         DC    X'00000001FFFFFFFFF800000000000000'                      28930017
         DC    X'00000003FFFFFFFFFC00000000000000'                      28940017
         DC    X'00000007FFFFFFFFFE00000000000000'                      28950017
         DC    X'0000000FFFFFFFFFFC00000000000000'                      28960017
         DC    X'0000001FFFFFFFFFF800000000000000'                      28970017
         DC    X'0000003FC00000001000000000000000'                      28980017
         DC    X'0000001F800000000000000000000000'                      28990017
         DC    X'0000000F000000000000000000000000'                      29000017
         DC    X'00000006000000000000000000000000'                      29010017
         DC    X'00000003000000001000000000000000'                      29020017
         DC    X'00000001FFFFFFFFF800000000000000'                      29030017
         DC    X'00000003FFFFFFFFFC00000000000000'                      29040017
         DC    X'00000007FFFFFFFFFE00000000000000'                      29050017
         DC    X'0000000FFFFFFFFFFC00000000000000'                      29060017
         DC    X'0000001FFFFFFFFFF800000000000000'                      29070017
         DC    X'0000003FC00000001000000000000000'                      29080017
         DC    X'0000000F000000000000000000000000'                      29090017
         DC    X'00000006000000000000000000000000'                      29100017
         DC    X'00000003000000001000000000000000'                      29110017
         DC    X'00000001FFFFFFFFF800000000000000'                      29120017
         DC    X'00000000FFFFFFFFFC00000000000000'                      29130017
         DC    X'000000007FFFFFFFFE00000000000000'                      29140017
         DC    X'000000003FFFFFFFFC00000000000000'                      29150017
         DC    X'000000001FFFFFFFF800000000000000'                      29160017
         DC    X'00000000000000001000000000000000'                      29170017
PATUXL   DC    X'00000020000000000800000000000000'                      29180017
         DC    X'00000018000000000C00000000000000'                      29190017
         DC    X'0000000E000000000E00000000000000'                      29200017
         DC    X'0000001F000000001E00000000000000'                      29210017
         DC    X'0000003F000000003E00000000000000'                      29220017
         DC    X'00000007E0000000FC00000000000000'                      29230017
         DC    X'000000003E000007F800000000000000'                      29240017
         DC    X'0000000007C00FFFF000000000000000'                      29250017
         DC    X'00000000007FFFFFE000000000000000'                      29260017
         DC    X'000000001FFFFFFF8000000000000000'                      29270017
         DC    X'00000000FFFFFFFC0000000000000000'                      29280017
         DC    X'00000003FFFFFF800000000000000000'                      29290017
         DC    X'00000007FFFC01F00000000000000000'                      29300017
         DC    X'0000000FF800003E0000000000000000'                      29310017
         DC    X'0000001F80000003F000000000000000'                      29320017
         DC    X'0000003E000000007E00000000000000'                      29330017
         DC    X'0000003C000000007C00000000000000'                      29340017
         DC    X'00000038000000003800000000000000'                      29350017
         DC    X'00000018000000000C00000000000000'                      29360017
         DC    X'00000004000000000400000000000000'                      29370017
PATUYL   DC    X'00000000000000002000000000000000'                      29380017
         DC    X'00000000000000007800000000000000'                      29390017
         DC    X'00FF0003FFFFFFFFFE00000000000000'                      29400017
         DC    X'01FF0007FFFFFFFFFC00000000000000'                      29410017
         DC    X'03FF000FFFFFFFFFF800000000000000'                      29420017
         DC    X'07FF001FFFFFFFFFF000000000000000'                      29430017
         DC    X'0FFF003FFFFFFFFFE000000000000000'                      29440017
         DC    X'1FC0001E000000000000000000000000'                      29450017
         DC    X'3F80000C000000000000000000000000'                      29460017
         DC    X'7F000006000000000000000000000000'                      29470017
         DC    X'3E000003000000000000000000000000'                      29480017
         DC    X'1C000001800000002000000000000000'                      29490017
         DC    X'0C000000C00000007800000000000000'                      29500017
         DC    X'07FFFFFFFFFFFFFFFE00000000000000'                      29510017
         DC    X'03FFFFFFFFFFFFFFFC00000000000000'                      29520017
         DC    X'01FFFFFFFFFFFFFFF800000000000000'                      29530017
         DC    X'00FFFFFFFFFFFFFFF000000000000000'                      29540017
         DC    X'007FFFFFFFFFFFFFE000000000000000'                      29550017
PATUZL   DC    X'00000038000000010000000000000000'                      29560017
         DC    X'0000003E00000001C000000000000000'                      29570017
         DC    X'0000001F80000001F000000000000000'                      29580017
         DC    X'0000001F60000003FC00000000000000'                      29590017
         DC    X'0000000F8C000003FE00000000000000'                      29600017
         DC    X'0000000FC3000003FC00000000000000'                      29610017
         DC    X'0000000FC0C00003F800000000000000'                      29620017
         DC    X'0000000FC0180003F800000000000000'                      29630017
         DC    X'0000000FE0060003F800000000000000'                      29640017
         DC    X'0000000FE0018003F800000000000000'                      29650017
         DC    X'0000000FE0003003F800000000000000'                      29660017
         DC    X'0000000FE0000C03F800000000000000'                      29670017
         DC    X'0000000FE00001C1F800000000000000'                      29680017
         DC    X'0000000FE0000061F800000000000000'                      29690017
         DC    X'0000001FE0000018F800000000000000'                      29700017
         DC    X'0000003FE0000006F800000000000000'                      29710017
         DC    X'0000001FE0000001FC00000000000000'                      29720017
         DC    X'00000007C00000003C00000000000000'                      29730017
         DC    X'00000001C00000000E00000000000000'                      29740017
         DC    X'00000000800000000200000000000000'                      29750017
PATUAU   DC    X'0000003C000000000000000000000000'                      29760017
         DC    X'0000000F000000000000000000000000'                      29770017
         DC    X'00000007C00000000000000000000000'                      29780017
         DC    X'00000003E00000000000000000000000'                      29790017
         DC    X'00000003F00000000000000000000000'                      29800017
         DC    X'00000003F80000000000000000000000'                      29810017
         DC    X'00000003F80000000600000000000000'                      29820017
         DC    X'00000007FC0000000380000000000000'                      29830017
         DC    X'0000000FFFE0000001E0000000000000'                      29840017
         DC    X'0000000FF07F000000F8000000000000'                      29850017
         DC    X'0000001FE003FC0000FE000000000000'                      29860017
         DC    X'0000001FE0000FF000FF000000000000'                      29870017
         DC    X'0000003FC000003FC0FF800000000000'                      29880017
         DC    X'0000003FC0000007FFFFC00020000000'                      29890017
         DC    X'0000003FC0000007FFFFE00018000000'                      29900017
         DC    X'0000003FC0000007F87FE0000E000000'                      29910017
         DC    X'0000001FC0000007F801FF800F000000'                      29920017
         DC    X'00000007E0000007F80007FC0F800000'                      29930017
         DC    X'00000000F0000007F800001FFFC00000'                      29940017
         DC    X'000000000C000007F8000000FFC00000'                      29950017
         DC    X'0000000000000007F800000FFFC00000'                      29960017
         DC    X'0000000000000007F80007FFFF800000'                      29970017
         DC    X'0000000000000007F803FFFFFF000000'                      29980017
         DC    X'0000000000000007F9FFFFFFFC000000'                      29990017
         DC    X'0000000000000007FFFFFFFFE0000000'                      30000017
         DC    X'000000000000007FFFFFFFF800000000'                      30010017
         DC    X'0000000000003FFFFFFFFC0000000000'                      30020017
         DC    X'00000000001FFFFFFFFE000000000000'                      30030017
         DC    X'000000000FFFFFFFFF00000000000000'                      30040017
         DC    X'00000000FFFFFFFFC000000000000000'                      30050017
         DC    X'00000003FFFFFFC00000000000000000'                      30060017
         DC    X'0000000FFFFFE0000000000000000000'                      30070017
         DC    X'0000001FFFF000000000000000000000'                      30080017
         DC    X'0000003FFC0000000000000000000000'                      30090017
         DC    X'0000003FC00000000000000000000000'                      30100017
         DC    X'0000003F800000000000000000000000'                      30110017
         DC    X'0000003F800000000000000000000000'                      30120017
         DC    X'0000001F800000000000000000000000'                      30130017
         DC    X'00000007C00000000000000000000000'                      30140017
         DC    X'00000001F00000000000000000000000'                      30150017
PATUBU   DC    X'0000002000000000000001E000000000'                      30160017
         DC    X'0000001C000000000000007E00000000'                      30170017
         DC    X'0000000E000000000000000FC0000000'                      30180017
         DC    X'0000000F8000001000000007F0000000'                      30190017
         DC    X'00000007C000000E00000003F8000000'                      30200017
         DC    X'00000007E0000007C0000001FC000000'                      30210017
         DC    X'00000007F0000003F0000001FE000000'                      30220017
         DC    X'00000003F8000003F8000001FE000000'                      30230017
         DC    X'00000003F8000003FC000001FE000000'                      30240017
         DC    X'00000003FC000003FE000003FC000000'                      30250017
         DC    X'00000003FC000003FF000003FC000000'                      30260017
         DC    X'00000003FE000007FF000003FC000000'                      30270017
         DC    X'00000003FFFFFFFFFFFFFFFDFE000000'                      30280017
         DC    X'00000003FEFFFFFFFFFFFFFEFE000000'                      30290017
         DC    X'00000003FF7FFFFFFFFFFFFF7F000000'                      30300017
         DC    X'00000003FF1FFFFFFFFFFFFF9F000000'                      30310017
         DC    X'00000003FF87FFFFFFFFFFFFE3800000'                      30320017
         DC    X'00000003FF80FFFFFFFFFFFFFCC00000'                      30330017
         DC    X'00000003FF80000000300003FFC00000'                      30340017
         DC    X'00000003FFC0000000300003FFC00000'                      30350017
         DC    X'00000003FFC0000000300003FFC00000'                      30360017
         DC    X'00000003FFC0000000300003FF800000'                      30370017
         DC    X'00000003FFC0000000300003FF800000'                      30380017
         DC    X'00000003FFC0000000700007FF800000'                      30390017
         DC    X'00000003FF80000000F00007FF000000'                      30400017
         DC    X'00000003FF80000001F00007FE000000'                      30410017
         DC    X'00000003FF80000003F0000FFE000000'                      30420017
         DC    X'00000007FF80000007F0000FFC000000'                      30430017
         DC    X'00000007FF0000000FF0001FFC000000'                      30440017
         DC    X'0000000FFF0000001FF0001FF8000000'                      30450017
         DC    X'0000000FFF0000007FB0003FF0000000'                      30460017
         DC    X'0000001FFE000000FFB0003FE0000000'                      30470017
         DC    X'0000003FFE000003FF18007FC0000000'                      30480017
         DC    X'0000001FFE00000FFE1C01FF80000000'                      30490017
         DC    X'00000007FC00003FFE1F03FF00000000'                      30500017
         DC    X'00000001FC0000FFFC0FFFFE00000000'                      30510017
         DC    X'00000000F80003FFF807FFFC00000000'                      30520017
         DC    X'0000000038001FFFF003FFF000000000'                      30530017
         DC    X'000000000707FFFFC001FFC000000000'                      30540017
         DC    X'0000000001FFFFFF00003E0000000000'                      30550017
         DC    X'00000000003FFFFC0000000000000000'                      30560017
         DC    X'000000000007FFE00000000000000000'                      30570017
PATUCU   DC    X'000000000000001FF000000000000000'                      30580017
         DC    X'00000000000007FFFFC0000000000000'                      30590017
         DC    X'000000000000FFFFFFFE000000000000'                      30600017
         DC    X'000000000007FFFFFFFFC00000000000'                      30610017
         DC    X'00000000003FFFFFFFFFF80000000000'                      30620017
         DC    X'0000000000FFFFFFFFFFFE0000000000'                      30630017
         DC    X'0000000003FFFFF83003FF8000000000'                      30640017
         DC    X'000000000FFFFF001E001FE000000000'                      30650017
         DC    X'000000003FFFF0000F8001F000000000'                      30660017
         DC    X'000000007FFF80000FE000B800000000'                      30670017
         DC    X'00000000FFFE00000FF0000E00000000'                      30680017
         DC    X'00000001FFF800001FF8002300000000'                      30690017
         DC    X'00000003FFFFFFFFFFFFFFF180000000'                      30700017
         DC    X'00000007FFDFFFFFFFFFFFF8C0000000'                      30710017
         DC    X'0000000FFF0FFFFFFFFFFFFC20000000'                      30720017
         DC    X'0000001FFE07FFFFFFFFFFFE00000000'                      30730017
         DC    X'0000001FFC03FFFFFFFFFFFF00000000'                      30740017
         DC    X'0000001FF801FFFFFFFFFFFF80000000'                      30750017
         DC    X'0000003FF000000000000001E0000000'                      30760017
         DC    X'0000003FE000000000000003F8000000'                      30770017
         DC    X'0000003FC000000000000007FE000000'                      30780017
         DC    X'0000003FC00000000000000FFFC00000'                      30790017
         DC    X'0000003F800000000000001FFF800000'                      30800017
         DC    X'0000003F800000000000003FFF000000'                      30810017
         DC    X'0000003F000000000000007FFE000000'                      30820017
         DC    X'0000003F00000000000000FFFC000000'                      30830017
         DC    X'0000003E00000000000001FFF8000000'                      30840017
         DC    X'0000003E00000000000003FFF0000000'                      30850017
         DC    X'0000003E00000000000007FFE0000000'                      30860017
         DC    X'0000001E00000000000007FFC0000000'                      30870017
         DC    X'0000001E00000000000007FF80000000'                      30880017
         DC    X'0000000E00000000000007FF80000000'                      30890017
         DC    X'0000000F00000000000007FF00000000'                      30900017
         DC    X'0000000700000000000003FE00000000'                      30910017
         DC    X'0000000380000000000001FE00000000'                      30920017
         DC    X'0000000180000000000000FE00000000'                      30930017
         DC    X'00000000C00000000000007E00000000'                      30940017
         DC    X'00000000600000000000001E00000000'                      30950017
         DC    X'00000000100000000000000700000000'                      30960017
PATUDU   DC    X'0000002000000000000001E000000000'                      30970017
         DC    X'0000001C000000000000007E00000000'                      30980017
         DC    X'0000000E000000000000000FC0000000'                      30990017
         DC    X'0000000F8000001000000007F0000000'                      31000017
         DC    X'00000007C000000E00000003F8000000'                      31010017
         DC    X'00000007E0000007C0000001FC000000'                      31020017
         DC    X'00000007F0000003F0000001FE000000'                      31030017
         DC    X'00000003F8000003F8000001FE000000'                      31040017
         DC    X'00000003F8000003FC000001FE000000'                      31050017
         DC    X'00000003FC000003FE000003FC000000'                      31060017
         DC    X'00000003FC000003FF000003FC000000'                      31070017
         DC    X'00000003FE000007FF000003FC000000'                      31080017
         DC    X'00000003FFFFFFFFFFFFFFFDFE000000'                      31090017
         DC    X'00000003FEFFFFFFFFFFFFFEFE000000'                      31100017
         DC    X'00000003FF7FFFFFFFFFFFFF7F000000'                      31110017
         DC    X'00000003FF1FFFFFFFFFFFFF9F000000'                      31120017
         DC    X'00000003FFC7FFFFFFFFFFFFE3800000'                      31130017
         DC    X'00000003FF80FFFFFFFFFFFFFCC00000'                      31140017
         DC    X'00000003FF80000000000003FFC00000'                      31150017
         DC    X'00000003FFC0000000000003FFC00000'                      31160017
         DC    X'00000003FFC0000000000007FF800000'                      31170017
         DC    X'00000003FFC000000000000FFF800000'                      31180017
         DC    X'00000003FFC000000000000FFF000000'                      31190017
         DC    X'00000003FFC000000000001FFF000000'                      31200017
         DC    X'00000003FF8000000000003FFF000000'                      31210017
         DC    X'00000003FF8000000000007FFE000000'                      31220017
         DC    X'00000003FF800000000000FFFC000000'                      31230017
         DC    X'00000007FF800000000001FFF8000000'                      31240017
         DC    X'00000007FF000000000007FFF0000000'                      31250017
         DC    X'0000000FFF00000000000FFFE0000000'                      31260017
         DC    X'0000000FFF00000000003FFFC0000000'                      31270017
         DC    X'0000001FFE00000000007FFF00000000'                      31280017
         DC    X'0000003FFE0000000001FFFE00000000'                      31290017
         DC    X'0000001FFE0000000007FFF800000000'                      31300017
         DC    X'00000007FC000000001FFFF000000000'                      31310017
         DC    X'00000001FC000000007FFFC000000000'                      31320017
         DC    X'00000000F800000003FFFF0000000000'                      31330017
         DC    X'00000000380000001FFFFC0000000000'                      31340017
         DC    X'0000000007000001FFFFE00000000000'                      31350017
         DC    X'0000000000F8007FFFFC000000000000'                      31360017
         DC    X'000000000007FFFFFF80000000000000'                      31370017
         DC    X'0000000000003FFFF000000000000000'                      31380017
PATUEU   DC    X'0000002000000000000001E000000000'                      31390017
         DC    X'00000038000000000000007E00000000'                      31400017
         DC    X'0000001E000000000000000FC0000000'                      31410017
         DC    X'0000000F0000001000000007F0000000'                      31420017
         DC    X'000000078000000E00000003F8000000'                      31430017
         DC    X'00000003E0000007C0000001FC000000'                      31440017
         DC    X'00000003F0000003F0000001FE000000'                      31450017
         DC    X'00000003F8000003F8000001FE000000'                      31460017
         DC    X'00000003FC000003FC000001FE000000'                      31470017
         DC    X'00000003FE000003FE000003FC000000'                      31480017
         DC    X'00000001FE000003FF000003FC000000'                      31490017
         DC    X'00000001FF000007FF000003FC000000'                      31500017
         DC    X'00000001FFFFFFFFFFFFFFFDFE000000'                      31510017
         DC    X'00000003FFFFFFFFFFFFFFFEFE000000'                      31520017
         DC    X'00000003FFBFFFFFFFFFFFFF7F000000'                      31530017
         DC    X'00000003FF8FFFFFFFFFFFFF9F000000'                      31540017
         DC    X'00000007FFC3FFFFFFFFFFFFE3800000'                      31550017
         DC    X'0000000FFF007FFFFFFFFFFFFCC00000'                      31560017
         DC    X'0000000FFF000000E0000003FFC00000'                      31570017
         DC    X'0000001FFF00000078000007FF800000'                      31580017
         DC    X'0000001FFE000000FE000007FF000000'                      31590017
         DC    X'0000001FFE000001FF800007FE000000'                      31600017
         DC    X'0000003FFE000003FF000007FE000000'                      31610017
         DC    X'0000003FFC000007FE000007FE000000'                      31620017
         DC    X'0000003FFC00000FFC000003FC000000'                      31630017
         DC    X'0000003FFC00001FF8000003FC000000'                      31640017
         DC    X'0000003FF8000007F8000001FC000000'                      31650017
         DC    X'0000003FF8000001F8000001FC000000'                      31660017
         DC    X'0000003FF8000000F0000000FC000000'                      31670017
         DC    X'0000003FF800000030000000FC000000'                      31680017
         DC    X'0000003FF8000000000000007E000000'                      31690017
         DC    X'0000003FF8000000000000003E000000'                      31700017
         DC    X'0000000FF8000000000000001E000000'                      31710017
         DC    X'00000003F8000000000000000F000000'                      31720017
         DC    X'00000000FC0000000000000003800000'                      31730017
         DC    X'000000003E0000000000000000C00000'                      31740017
         DC    X'000000000E0000000000000000000000'                      31750017
         DC    X'00000000030000000000000000000000'                      31760017
         DC    X'0000000000C000000000000000000000'                      31770017
PATUFU   DC    X'0000002000000000000001E000000000'                      31780017
         DC    X'00000038000000000000007E00000000'                      31790017
         DC    X'0000001E000000000000000FC0000000'                      31800017
         DC    X'0000000F0000001000000007F0000000'                      31810017
         DC    X'000000078000000E00000003F8000000'                      31820017
         DC    X'00000003E0000007C0000001FC000000'                      31830017
         DC    X'00000003F0000003F0000001FE000000'                      31840017
         DC    X'00000003F8000003F8000001FE000000'                      31850017
         DC    X'00000003FC000003FC000001FE000000'                      31860017
         DC    X'00000003FE000003FE000003FC000000'                      31870017
         DC    X'00000003FF000003FF000003FC000000'                      31880017
         DC    X'00000001FF000007FF000003FC000000'                      31890017
         DC    X'00000001FFFFFFFFFFFFFFFDFE000000'                      31900017
         DC    X'00000000FFFFFFFFFFFFFFFEFE000000'                      31910017
         DC    X'000000007FFFFFFFFFFFFFFF7F000000'                      31920017
         DC    X'000000003FFFFFFFFFFFFFFF9F000000'                      31930017
         DC    X'000000000FFFFFFFFFFFFFFFE3800000'                      31940017
         DC    X'0000000003FFFFFFFFFFFFFFFCC00000'                      31950017
         DC    X'0000000000000000E0000003FFC00000'                      31960017
         DC    X'000000000000000078000007FF800000'                      31970017
         DC    X'0000000000000000FE000007FF000000'                      31980017
         DC    X'0000000000000001FF800007FE000000'                      31990017
         DC    X'0000000000000003FF000007FE000000'                      32000017
         DC    X'0000000000000007FE000007FE000000'                      32010017
         DC    X'000000000000000FFC000003FC000000'                      32020017
         DC    X'000000000000001FF8000003FC000000'                      32030017
         DC    X'0000000000000007F8000001FC000000'                      32040017
         DC    X'0000000000000001F8000001FC000000'                      32050017
         DC    X'0000000000000000F0000000FC000000'                      32060017
         DC    X'000000000000000060000000FC000000'                      32070017
         DC    X'0000000000000000000000007E000000'                      32080017
         DC    X'0000000000000000000000003E000000'                      32090017
         DC    X'0000000000000000000000001E000000'                      32100017
         DC    X'0000000000000000000000000F000000'                      32110017
         DC    X'00000000000000000000000003800000'                      32120017
         DC    X'00000000000000000000000000C00000'                      32130017
PATUGU   DC    X'000000000000001FF000000000000000'                      32140017
         DC    X'00000000000007FFFFC0000000000000'                      32150017
         DC    X'000000000000FFFFFFFE000000000000'                      32160017
         DC    X'000000000007FFFFFFFFC00000000000'                      32170017
         DC    X'00000000003FFFFFFFFFF80000000000'                      32180017
         DC    X'0000000000FFFFFFFFFFFE0000000000'                      32190017
         DC    X'0000000003FFFFF83003FF8000000000'                      32200017
         DC    X'000000000FFFFF001E001FE000000000'                      32210017
         DC    X'000000003FFFF0000F8001F000000000'                      32220017
         DC    X'000000007FFF80000FE000B800000000'                      32230017
         DC    X'00000000FFFE00000FF0000E00000000'                      32240017
         DC    X'00000001FFF800001FF8002300000000'                      32250017
         DC    X'00000003FFFFFFFFFFFFFFF180000000'                      32260017
         DC    X'00000007FFDFFFFFFFFFFFF8C0000000'                      32270017
         DC    X'0000000FFF0FFFFFFFFFFFFC20000000'                      32280017
         DC    X'0000001FFE07FFFFFFFFFFFE00000000'                      32290017
         DC    X'0000001FFC03FFFFFFFFFFFF00000000'                      32300017
         DC    X'0000001FF801FFFFFFFFFFFF80000000'                      32310017
         DC    X'0000003FF000000300000001E0000000'                      32320017
         DC    X'0000003FE0000001C0000003F8000000'                      32330017
         DC    X'0000003FC0000000F8000007FE000000'                      32340017
         DC    X'0000003FC00000007E00000FFFC00000'                      32350017
         DC    X'0000003F800000003EC0001FFF800000'                      32360017
         DC    X'0000003F800000003F30003FFF000000'                      32370017
         DC    X'0000003F000000001F9C007FFE000000'                      32380017
         DC    X'0000003F000000001FCE00FFFC000000'                      32390017
         DC    X'0000003E000000001FC701FFF8000000'                      32400017
         DC    X'0000003E000000001FE3C3FFF0000000'                      32410017
         DC    X'0000001E000000001FE1C7FFE0000000'                      32420017
         DC    X'0000001E000000001FE1C7FFC0000000'                      32430017
         DC    X'0000000E000000001FE1C7FF80000000'                      32440017
         DC    X'0000000F000000003FC1C7FF00000000'                      32450017
         DC    X'00000007000000003FC0E7FE00000000'                      32460017
         DC    X'00000003000000007F80E3FE00000000'                      32470017
         DC    X'0000000180000000FF00E1FE00000000'                      32480017
         DC    X'00000000C0000003FE0070FE00000000'                      32490017
         DC    X'000000002000000FFC00387E00000000'                      32500017
         DC    X'000000001800003FF0000E1E00000000'                      32510017
         DC    X'00000000060001FFC00003C600000000'                      32520017
         DC    X'0000000001C07FFF8000007300000000'                      32530017
         DC    X'00000000003FFFF80000000C00000000'                      32540017
         DC    X'000000000001FF800000000000000000'                      32550017
PATUHU   DC    X'0000003800000000000001E000000000'                      32560017
         DC    X'0000000F000000000000007E00000000'                      32570017
         DC    X'00000007C00000000000000FC0000000'                      32580017
         DC    X'00000007F000001000000007F0000000'                      32590017
         DC    X'00000007F800000E00000003F8000000'                      32600017
         DC    X'00000003FC000007C0000001FC000000'                      32610017
         DC    X'00000003FC000003F0000001FE000000'                      32620017
         DC    X'00000003FE000003F8000001FE000000'                      32630017
         DC    X'00000003FE000003FC000001FE000000'                      32640017
         DC    X'00000007FC000003FE000003FC000000'                      32650017
         DC    X'00000007FC000003FF000003FC000000'                      32660017
         DC    X'00000007F8000007FF000003FC000000'                      32670017
         DC    X'00000007FFFFFFFFFFFFFFFDFE000000'                      32680017
         DC    X'0000000FF7FFFFFFFFFFFFFEFE000000'                      32690017
         DC    X'0000001FF3FFFFFFFFFFFFFF7F000000'                      32700017
         DC    X'0000001FE0FFFFFFFFFFFFFF9F000000'                      32710017
         DC    X'0000003FC03FFFFFFFFFFFFFE3800000'                      32720017
         DC    X'3000003FC003FFFFFFFF8003FFC00000'                      32730017
         DC    X'1C00003FC0000000000C0007FF800000'                      32740017
         DC    X'0E00003FC000000000060007FF000000'                      32750017
         DC    X'0F80003FC000000000070007FE000000'                      32760017
         DC    X'07C0003FC0000000000F8007FE000000'                      32770017
         DC    X'03E0001FE0000000001FC007FE000000'                      32780017
         DC    X'01F8000FE0000000003FE003FC000000'                      32790017
         DC    X'00FE0003F0000000003FF003FC000000'                      32800017
         DC    X'007F800078000000007FF801FC000000'                      32810017
         DC    X'003FE0000E000000007FF001FC000000'                      32820017
         DC    X'001FFC0000000000007FE000FC000000'                      32830017
         DC    X'0007FF800000000000FFE000FC000000'                      32840017
         DC    X'0003FFFFFFFFFFFFFFFFC0007E000000'                      32850017
         DC    X'0000FFFFFFFFFFFFFFFFC0003E000000'                      32860017
         DC    X'00001FFFFFFFFFFFFFFF80001E000000'                      32870017
         DC    X'000007FFFFFFFFFFFFFF80000F000000'                      32880017
         DC    X'000001FFFFFFFFFFFFFF800003800000'                      32890017
         DC    X'0000001FFFFFFFFFFFFF800000C00000'                      32900017
         DC    X'0000000000000000000FC00000000000'                      32910017
         DC    X'00000000000000000003E00000000000'                      32920017
         DC    X'00000000000000000000700000000000'                      32930017
         DC    X'00000000000000000000080000000000'                      32940017
PATUIU   DC    X'0000002000000000000001E000000000'                      32950017
         DC    X'00000038000000000000007E00000000'                      32960017
         DC    X'0000001E000000000000000FC0000000'                      32970017
         DC    X'0000000F0000001000000007F0000000'                      32980017
         DC    X'000000078000000E00000003F8000000'                      32990017
         DC    X'00000003E0000007C0000001FC000000'                      33000017
         DC    X'00000003F0000003F0000001FE000000'                      33010017
         DC    X'00000003F8000003F8000001FE000000'                      33020017
         DC    X'00000003FC000003FC000001FE000000'                      33030017
         DC    X'00000003FE000003FE000003FC000000'                      33040017
         DC    X'00000007FF000003FF000003FC000000'                      33050017
         DC    X'00000007FF000007FF000003FC000000'                      33060017
         DC    X'0000000FFFFFFFFFFFFFFFFDFE000000'                      33070017
         DC    X'0000001FFFFFFFFFFFFFFFFEFE000000'                      33080017
         DC    X'0000001FFFFFFFFFFFFFFFFF7F000000'                      33090017
         DC    X'0000003FFFFFFFFFFFFFFFFF9F000000'                      33100017
         DC    X'0000000FFFFFFFFFFFFFFFFFE3800000'                      33110017
         DC    X'00000001FFFFFFFFFFFFFFFFF8C00000'                      33120017
PATUJU   DC    X'000000001FFF00000000000000000000'                      33130017
         DC    X'00000001FFFFE0000000000000000000'                      33140017
         DC    X'00000007FFFFF8000000000000000000'                      33150017
         DC    X'0000000FFFFFFE00000001E000000000'                      33160017
         DC    X'0000000FFFE3FF000000007E00000000'                      33170017
         DC    X'0000001FFE001F800000000FC0000000'                      33180017
         DC    X'0000001FF00003E010000007F0000000'                      33190017
         DC    X'0000003FC00000F860000003F8000000'                      33200017
         DC    X'0000003F8000003FC0000001FC000000'                      33210017
         DC    X'0000003F0000000F00000001FE000000'                      33220017
         DC    X'0000001E0000000000000001FE000000'                      33230017
         DC    X'0000001E0000000000000001FE000000'                      33240017
         DC    X'0000000F000000000003FC03FC000000'                      33250017
         DC    X'000000078000000007FFFFC3FC000000'                      33260017
         DC    X'00000003C0000000FFFFFFFBFC000000'                      33270017
         DC    X'00000001F00000FFFFFFFFFDFE000000'                      33280017
         DC    X'000000007FFFFFFFFFFFFFFEFE000000'                      33290017
         DC    X'000000001FFFFFFFFFFFFFFF7F000000'                      33300017
         DC    X'0000000007FFFFFFFF80007F9F000000'                      33310017
         DC    X'0000000000FFFFFFC000000FE3800000'                      33320017
         DC    X'000000000007FFE000000001F8C00000'                      33330017
         DC    X'0000000000000000000000003E000000'                      33340017
         DC    X'00000000000000000000000003000000'                      33350017
PATUKU   DC    X'0000003800000000000001E000000000'                      33360017
         DC    X'0000000F000000000000007E00000000'                      33370017
         DC    X'00000007C00000000000000FC0000000'                      33380017
         DC    X'00000007F000001000000007F0000000'                      33390017
         DC    X'00000007F800000E00000003F8000000'                      33400017
         DC    X'00000003FC000007C0000001FC000000'                      33410017
         DC    X'00000003FC000003F0000001FE000000'                      33420017
         DC    X'00000003FE000003F8000001FE000000'                      33430017
         DC    X'00000003FE000003FC000001FE000000'                      33440017
         DC    X'00000007FC000003FE000003FC000000'                      33450017
         DC    X'00000007FC000003FF000003FC000000'                      33460017
         DC    X'00000007F8000007FF000003FC000000'                      33470017
         DC    X'00000007FFFFFFFFFFFFFFFDFE000000'                      33480017
         DC    X'0000000FF7FFFFFFFFFFFFFEFE000000'                      33490017
         DC    X'0000001FF3FFFFFFFFFFFFFF7F000000'                      33500017
         DC    X'0000001FE0FFFFFFFFFFFFFF9F000000'                      33510017
         DC    X'0000003FC03FFFFFFFFFFFFFE3800000'                      33520017
         DC    X'0000003FC003FFFFFFFFFFFFFCC00000'                      33530017
         DC    X'0000003FC000001800060003FFC00000'                      33540017
         DC    X'0000003FC000000C00030007FF800000'                      33550017
         DC    X'0000003FC000000E00018007FF000000'                      33560017
         DC    X'0000003FC000000F0003C007FE000000'                      33570017
         DC    X'0000003FC000000F800FE007FE000000'                      33580017
         DC    X'0000001FE000000FC03FF007FE000000'                      33590017
         DC    X'0000000FE000001FE0FFF803FC000000'                      33600017
         DC    X'00000003F000003FF3FFFC03FC000000'                      33610017
         DC    X'00000000780000FFDFFFF001FC000000'                      33620017
         DC    X'000000000E0007FF8FFFC001FC000000'                      33630017
         DC    X'000000000007FFFFC7FF0000FC000000'                      33640017
         DC    X'000000000FFFFFFF03FC0000FC000000'                      33650017
         DC    X'00000000FFFFFFFE01F000007E000000'                      33660017
         DC    X'00000003FFFFFFFC00C000003E000000'                      33670017
         DC    X'00000007FFFFFFE0000000001E000000'                      33680017
         DC    X'0000000FFFFFE000000000000F000000'                      33690017
         DC    X'0000001FFFE000000000000003800000'                      33700017
         DC    X'0000001FFC0000000000000000C00000'                      33710017
         DC    X'0000003FE00000000000000000000000'                      33720017
         DC    X'0000003F800000000000000000000000'                      33730017
         DC    X'0000003F000000000000000000000000'                      33740017
         DC    X'0000001E000000000000000000000000'                      33750017
         DC    X'00000003000000000000000000000000'                      33760017
PATULU   DC    X'0000002000000000000001E000000000'                      33770017
         DC    X'00000038000000000000007E00000000'                      33780017
         DC    X'0000001E000000000000000FC0000000'                      33790017
         DC    X'0000000F0000001000000007F0000000'                      33800017
         DC    X'000000078000000E00000003F8000000'                      33810017
         DC    X'00000007E0000007C0000001FC000000'                      33820017
         DC    X'00000003F0000003F0000001FE000000'                      33830017
         DC    X'00000001F8000003F8000001FE000000'                      33840017
         DC    X'00000001FC000003FC000001FE000000'                      33850017
         DC    X'00000000FE000003FE000003FC000000'                      33860017
         DC    X'00000000FF000003FF000003FC000000'                      33870017
         DC    X'00000000FF000007FF000003FC000000'                      33880017
         DC    X'00000000FFFFFFFFFFFFFFFDFE000000'                      33890017
         DC    X'00000001FF7FFFFFFFFFFFFEFE000000'                      33900017
         DC    X'00000001FFBFFFFFFFFFFFFF7F000000'                      33910017
         DC    X'00000003FF8FFFFFFFFFFFFF9F000000'                      33920017
         DC    X'00000003FFC3FFFFFFFFFFFFE3800000'                      33930017
         DC    X'00000007FF007FFFFFFFFFFFFCC00000'                      33940017
         DC    X'00000007FF00000000000003FFC00000'                      33950017
         DC    X'0000000FFF00000000000007FE000000'                      33960017
         DC    X'0000000FFE00000000000007FC000000'                      33970017
         DC    X'0000001FFE00000000000003F8000000'                      33980017
         DC    X'0000001FFC00000000000001F0000000'                      33990017
         DC    X'0000001FF800000000000000F0000000'                      34000017
         DC    X'0000003FF00000000000000070000000'                      34010017
         DC    X'0000003FF00000000000000038000000'                      34020017
         DC    X'0000003FE0000000000000000C000000'                      34030017
         DC    X'0000003FE00000000000000000000000'                      34040017
         DC    X'0000001FE00000000000000000000000'                      34050017
         DC    X'0000001FE00000000000000000000000'                      34060017
         DC    X'0000000FE00000000000000000000000'                      34070017
         DC    X'0000000FE00000000000000000000000'                      34080017
         DC    X'00000007E00000000000000000000000'                      34090017
         DC    X'00000003E00000000000000000000000'                      34100017
         DC    X'00000001E00000000000000000000000'                      34110017
         DC    X'00000000700000000000000000000000'                      34120017
         DC    X'00000000180000000000000000000000'                      34130017
         DC    X'00000000060000000000000000000000'                      34140017
PATUMU   DC    X'0000003000000000000001E000000000'                      34150017
         DC    X'0000000E000000000000007E00000000'                      34160017
         DC    X'00000007800000000000000FC0000000'                      34170017
         DC    X'00000003C000001000000007F0000000'                      34180017
         DC    X'00000003F000000E00000003F8000000'                      34190017
         DC    X'00000003F8000007C0000001FC000000'                      34200017
         DC    X'00000003FC000003F0000001FE000000'                      34210017
         DC    X'00000003FE000003F8000001FE000000'                      34220017
         DC    X'00000003FE000003FC000001FE000000'                      34230017
         DC    X'00000003FF000003FE000003FC000000'                      34240017
         DC    X'00000003FF000003FF000003FC000000'                      34250017
         DC    X'00000007FF000007FF000003FC000000'                      34260017
         DC    X'0000000FFFFFFFFFFFFFFFFDFE000000'                      34270017
         DC    X'0000003FFFFFFFFFFFFFFFFEFE000000'                      34280017
         DC    X'0000001FFFFFFFFFFFFFFFFF7F000000'                      34290017
         DC    X'00000007FFFFFFFFFFFFFFFF9F000000'                      34300017
         DC    X'00000001FFFFFFFFFFFFFFFFE3800000'                      34310017
         DC    X'000000001FFFFFFFFFFFFFFFFCC00000'                      34320017
         DC    X'000000000000000000000003FFC00000'                      34330017
         DC    X'000000000000000000000007FF800000'                      34340017
         DC    X'00000000000000100000000FFF000000'                      34350017
         DC    X'000000000000000E0000001FFE000000'                      34360017
         DC    X'0000000000000007C000003FFC000000'                      34370017
         DC    X'0000000000000003F000007FF8000000'                      34380017
         DC    X'0000000000000003F80000FFF0000000'                      34390017
         DC    X'0000000000000003FC0001FFE0000000'                      34400017
         DC    X'0000000100000003FE0003FFC0000000'                      34410017
         DC    X'0000000380000003FF0007FF80000000'                      34420017
         DC    X'00000007C0000007FF000FFF00000000'                      34430017
         DC    X'0000000FFFFFFFFFFFFFFFFE00000000'                      34440017
         DC    X'0000001FFFFFFFFFFFFFFFFC00000000'                      34450017
         DC    X'0000003FFFFFFFFFFFFFFFF800000000'                      34460017
         DC    X'0000001FFFFFFFFFFFFFFFF000000000'                      34470017
         DC    X'0000000FFFFFFFFFFFFFFFE000000000'                      34480017
         DC    X'00000007FFFFFFFFFFFFFFC000000000'                      34490017
         DC    X'00000003E000000FFC00007000000000'                      34500017
         DC    X'00000001C000000FF800001C00000000'                      34510017
         DC    X'0000000080000007F800000700000000'                      34520017
         DC    X'0000000000000003F8000001C0000000'                      34530017
         DC    X'0000000000000001F8000000F0000000'                      34540017
         DC    X'0000000000000000F8000001FC000000'                      34550017
         DC    X'00000000000000007C000001FF000000'                      34560017
         DC    X'00000000000000000E000003FFC00000'                      34570017
         DC    X'000000010000000001000003FF800000'                      34580017
         DC    X'000000038000000000000007FF000000'                      34590017
         DC    X'00000007C000000000000007FE000000'                      34600017
         DC    X'0000000FFFFFFFFFFFFFFFFFFC000000'                      34610017
         DC    X'0000001FFFFFFFFFFFFFFFFFFC000000'                      34620017
         DC    X'0000003FFFFFFFFFFFFFFFFFFC000000'                      34630017
         DC    X'0000001FFFFFFFFFFFFFFFFFFC000000'                      34640017
         DC    X'0000000FFFFFFFFFFFFFFFFFFE000000'                      34650017
         DC    X'00000007FFFFFFFFFFFFFFFFFE000000'                      34660017
         DC    X'00000003E0000000000000001F000000'                      34670017
         DC    X'00000001C0000000000000000F000000'                      34680017
         DC    X'00000000800000000000000003800000'                      34690017
         DC    X'00000000000000000000000000C00000'                      34700017
PATUNU   DC    X'000000300000000380000000C0000000'                      34710017
         DC    X'0000001C00000000F000000070000000'                      34720017
         DC    X'0000000F000000007C0000003C000000'                      34730017
         DC    X'00000007C00000003F0000003E000000'                      34740017
         DC    X'00000007E00000003F8000003F000000'                      34750017
         DC    X'00000003F00000003FC000007F800000'                      34760017
         DC    X'00000003F80000007FE00000FFC00000'                      34770017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      34780017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      34790017
         DC    X'00000003FFFFFFFFFFFFFFFFFF800000'                      34800017
         DC    X'00000003FF000000000001FFFF000000'                      34810017
         DC    X'00000007FF00000000001FFFFC000000'                      34820017
         DC    X'00000007FF8000000000FFFFF0000000'                      34830017
         DC    X'0000000FFF8000000007FFFF80000000'                      34840017
         DC    X'0000003FFF800000003FFFFC00000000'                      34850017
         DC    X'0000000FFF80000001FFFFE000000000'                      34860017
         DC    X'00000003FF8000000FFFFF0000000000'                      34870017
         DC    X'00000000FF8000007FFFF80000000000'                      34880017
         DC    X'000000007F800003FFFFC00000000000'                      34890017
         DC    X'000000000F00001FFFFE000000000000'                      34900017
         DC    X'00000000020000FFFFF0000400000000'                      34910017
         DC    X'00000000000007FFFF80000F00000000'                      34920017
         DC    X'0000000000003FFFFC00001FC0000000'                      34930017
         DC    X'000000000001FFFFE000001FF0000000'                      34940017
         DC    X'00000000000FFFFF0000001FFC000000'                      34950017
         DC    X'00000000007FFFF80000001FFF000000'                      34960017
         DC    X'0000000003FFFFC00000001FFFC00000'                      34970017
         DC    X'000000001FFFFE000000001FFF000000'                      34980017
         DC    X'00000000FFFFF0000000001FFE000000'                      34990017
         DC    X'00000007FFFF80000000000FFE000000'                      35000017
         DC    X'0000000FFFFC00000000000FFC000000'                      35010017
         DC    X'0000001FFFFFFFFFFFFFFFFFFC000000'                      35020017
         DC    X'0000003FFFFFFFFFFFFFFFFFFC000000'                      35030017
         DC    X'0000003FFFFFFFFFFFFFFFFFFC000000'                      35040017
         DC    X'0000003FF800000000000001FC000000'                      35050017
         DC    X'0000003FF000000000000000FC000000'                      35060017
         DC    X'0000001FE0000000000000007E000000'                      35070017
         DC    X'00000007E0000000000000003E000000'                      35080017
         DC    X'00000001E0000000000000000F000000'                      35090017
         DC    X'00000000700000000000000003800000'                      35100017
         DC    X'000000000C0000000000000000C00000'                      35110017
PATUOU   DC    X'000000000000001FF000000000000000'                      35120017
         DC    X'00000000000003FFFFE0000000000000'                      35130017
         DC    X'000000000000FFFFFFFE000000000000'                      35140017
         DC    X'000000000007FFFFFFFFE00000000000'                      35150017
         DC    X'00000000003FFFFFFFFFF80000000000'                      35160017
         DC    X'0000000000FFFFFFFFFFFE0000000000'                      35170017
         DC    X'0000000003FFFFF81803FF8000000000'                      35180017
         DC    X'000000000FFFFF000E006FE000000000'                      35190017
         DC    X'000000003FFFF0000F8030F800000000'                      35200017
         DC    X'000000007FFF80000FC0183C00000000'                      35210017
         DC    X'00000000FFFE00000FE00C0E00000000'                      35220017
         DC    X'00000001FFF800001FF0060300000000'                      35230017
         DC    X'00000003FFFFFFFFFFFFFF0000000000'                      35240017
         DC    X'00000007FF8FFFFFFFFFFF8000000000'                      35250017
         DC    X'0000000FFF07FFFFFFFFFFC000000000'                      35260017
         DC    X'0000000FFE03FFFFFFFFFFF000000000'                      35270017
         DC    X'0000001FFC00FFFFFFFFFFF800000000'                      35280017
         DC    X'0000001FF8000FFFFFFFFFFE00000000'                      35290017
         DC    X'0000003FF00000000000000380000000'                      35300017
         DC    X'0000001FE000000000000007E0000000'                      35310017
         DC    X'00000007C00000000000000FFC000000'                      35320017
         DC    X'00000003800000000000001FFFC00000'                      35330017
         DC    X'00000001800000000000001FFF800000'                      35340017
         DC    X'00000000C00000000000003FFF000000'                      35350017
         DC    X'00000000300000000000007FFF000000'                      35360017
         DC    X'0000000018000000000000FFFE000000'                      35370017
         DC    X'0000000006000000000003FFFC000000'                      35380017
         DC    X'0000000003800000000007FFF8000000'                      35390017
         DC    X'0000000000F0000000000FFFF0000000'                      35400017
         DC    X'00000000007E000000003FFFE0000000'                      35410017
         DC    X'00000000001FC0000001FFFF80000000'                      35420017
         DC    X'000000000007F800000FFFFE00000000'                      35430017
         DC    X'000000000001FFC000FFFFF800000000'                      35440017
         DC    X'0000000000007FFFFFFFFFC000000000'                      35450017
         DC    X'0000000000000FFFFFFFFF0000000000'                      35460017
         DC    X'00000000000003FFFFFFF80000000000'                      35470017
         DC    X'000000000000007FFFFFC00000000000'                      35480017
         DC    X'000000000000000FFFFE000000000000'                      35490017
         DC    X'00000000000000007FC0000000000000'                      35500017
PATUPU   DC    X'0000003800000000000001E000000000'                      35510017
         DC    X'0000000F000000000000007E00000000'                      35520017
         DC    X'00000007C00000000000000FC0000000'                      35530017
         DC    X'00000007F000001000000007F0000000'                      35540017
         DC    X'00000007F800000E00000003F8000000'                      35550017
         DC    X'00000003FC000007C0000001FC000000'                      35560017
         DC    X'00000003FC000003F0000001FE000000'                      35570017
         DC    X'00000003FE000003F8000001FE000000'                      35580017
         DC    X'00000003FE000003FC000001FE000000'                      35590017
         DC    X'00000007FC000003FE000003FC000000'                      35600017
         DC    X'00000007FC000003FF000003FC000000'                      35610017
         DC    X'00000007F8000007FF000003FC000000'                      35620017
         DC    X'00000007FFFFFFFFFFFFFFFDFE000000'                      35630017
         DC    X'0000000FF7FFFFFFFFFFFFFEFE000000'                      35640017
         DC    X'0000001FF3FFFFFFFFFFFFFF7F000000'                      35650017
         DC    X'0000001FE0FFFFFFFFFFFFFF9F000000'                      35660017
         DC    X'0000003FC03FFFFFFFFFFFFFE3800000'                      35670017
         DC    X'0000003FC003FFFFFFFFFFFFFCC00000'                      35680017
         DC    X'0000003FC000000078000003FFC00000'                      35690017
         DC    X'0000003FC0000000FE000003FF800000'                      35700017
         DC    X'0000003FC0000001FF800007FF000000'                      35710017
         DC    X'0000003FC0000003FFE00007FF000000'                      35720017
         DC    X'0000003FC0000003FF80000FFE000000'                      35730017
         DC    X'0000001FE0000007FE00000FFE000000'                      35740017
         DC    X'0000000FE000000FF800001FFC000000'                      35750017
         DC    X'00000003F000000FF000001FFC000000'                      35760017
         DC    X'000000007800000FE000003FF8000000'                      35770017
         DC    X'000000000E00001FC000003FF0000000'                      35780017
         DC    X'000000000000001F8000007FE0000000'                      35790017
         DC    X'000000000000001F000000FFC0000000'                      35800017
         DC    X'000000000000001F000001FF80000000'                      35810017
         DC    X'000000000000000E000003FF00000000'                      35820017
         DC    X'000000000000000E000007FC00000000'                      35830017
         DC    X'000000000000000E00001FF800000000'                      35840017
         DC    X'000000000000000600007FE000000000'                      35850017
         DC    X'00000000000000030001FF8000000000'                      35860017
         DC    X'00000000000000018007FC0000000000'                      35870017
         DC    X'00000000000000007FFFE00000000000'                      35880017
         DC    X'00000000000000003FFE000000000000'                      35890017
PATUQU   DC    X'000000000000001FF000000000000000'                      35900017
         DC    X'00000000000003FFFFE0000000000000'                      35910017
         DC    X'000000000000FFFFFFFE000000000000'                      35920017
         DC    X'000000000007FFFFFFFFE00000000000'                      35930017
         DC    X'00000000003FFFFFFFFFF80000000000'                      35940017
         DC    X'0000000000FFFFFFFFFFFE0000000000'                      35950017
         DC    X'0000000003FFFFF81803FF8000000000'                      35960017
         DC    X'000000000FFFFF000E006FE000000000'                      35970017
         DC    X'000000003FFFF0000F8030F800000000'                      35980017
         DC    X'000000007FFF80000FC0183C00000000'                      35990017
         DC    X'00000000FFFE00000FE00C0E00000000'                      36000017
         DC    X'00000001FFF800001FF0060300000000'                      36010017
         DC    X'00000003FFFFFFFFFFFFFF0000000000'                      36020017
         DC    X'00000007FFBFFFFFFFFFFF8000000000'                      36030017
         DC    X'0000000FFF1FFFFFFFFFFFC000000000'                      36040017
         DC    X'0000000FFE1FFFFFFFFFFFF000000000'                      36050017
         DC    X'0000001FFC1EFFFFFFFFFFF800000000'                      36060017
         DC    X'0000001FF81F0FFFFFFFFFFE00000000'                      36070017
         DC    X'0000003FF01F80000000000380000000'                      36080017
         DC    X'0000001FE03F800000000007E0000000'                      36090017
         DC    X'00000007C07FC0000000000FFC000000'                      36100017
         DC    X'00000003C1FFC0000000001FFFC00000'                      36110017
         DC    X'00000001C7FF80000000001FFF800000'                      36120017
         DC    X'00000000FFFF00000000003FFF000000'                      36130017
         DC    X'00000001FFFC00000000007FFF000000'                      36140017
         DC    X'00000007FFF80000000000FFFE000000'                      36150017
         DC    X'0000000FFFE00000000003FFFC000000'                      36160017
         DC    X'0000001FFF800000000007FFF8000000'                      36170017
         DC    X'0000003FFEF0000000000FFFF0000000'                      36180017
         DC    X'0000003FF87E000000003FFFE0000000'                      36190017
         DC    X'0000003FE01FC0000001FFFF80000000'                      36200017
         DC    X'0000003FC007F800000FFFFE00000000'                      36210017
         DC    X'0000003FC001FFC000FFFFF800000000'                      36220017
         DC    X'0000003FC0007FFFFFFFFFC000000000'                      36230017
         DC    X'0000001FC0000FFFFFFFFF0000000000'                      36240017
         DC    X'0000000FC00003FFFFFFF80000000000'                      36250017
         DC    X'00000007C000007FFFFFC00000000000'                      36260017
         DC    X'00000003C000000FFFFE000000000000'                      36270017
         DC    X'00000001E00000007FC0000000000000'                      36280017
         DC    X'00000000E00000000000000000000000'                      36290017
         DC    X'00000000300000000000000000000000'                      36300017
         DC    X'000000000C0000000000000000000000'                      36310017
PATURU   DC    X'0000003800000000000001E000000000'                      36320017
         DC    X'0000000F000000000000007E00000000'                      36330017
         DC    X'00000007C00000000000000FC0000000'                      36340017
         DC    X'00000007F000001000000007F0000000'                      36350017
         DC    X'00000007F800000E00000003F8000000'                      36360017
         DC    X'00000003FC000007C0000001FC000000'                      36370017
         DC    X'00000003FC000003F0000001FE000000'                      36380017
         DC    X'00000003FE000003F8000001FE000000'                      36390017
         DC    X'00000003FE000003FC000001FE000000'                      36400017
         DC    X'00000007FC000003FE000003FC000000'                      36410017
         DC    X'00000007FC000003FF000003FC000000'                      36420017
         DC    X'00000007F8000007FF000003FC000000'                      36430017
         DC    X'00000007FFFFFFFFFFFFFFFDFE000000'                      36440017
         DC    X'0000000FF7FFFFFFFFFFFFFEFE000000'                      36450017
         DC    X'0000001FF3FFFFFFFFFFFFFF7F000000'                      36460017
         DC    X'0000001FE0FFFFFFFFFFFFFF9F000000'                      36470017
         DC    X'0000003FC03FFFFFFFFFFFFFE3800000'                      36480017
         DC    X'0000003FC003FFFFFFFFFFFFFCC00000'                      36490017
         DC    X'0000003FC000000180000003FFC00000'                      36500017
         DC    X'0000003FC000000180000003FF800000'                      36510017
         DC    X'0000003FC000000180000003FF800000'                      36520017
         DC    X'0000003FC0000000C0000003FF000000'                      36530017
         DC    X'0000003FC0000000C0000003FF000000'                      36540017
         DC    X'0000001FE0000000C0000003FE000000'                      36550017
         DC    X'0000000FE0000000E0000007FE000000'                      36560017
         DC    X'00000003F0000000F0000007FE000000'                      36570017
         DC    X'0000000078000001F8000007FC000000'                      36580017
         DC    X'000000000E000003FC00000FFC000000'                      36590017
         DC    X'000000000000000FFE00000FFC000000'                      36600017
         DC    X'000000000000003FFF00001FF8000000'                      36610017
         DC    X'00000003FFFFFFFFFF80001FF8000000'                      36620017
         DC    X'0000000FFFFFFFFFFEC0003FF0000000'                      36630017
         DC    X'0000001FFFFFFFFFFE60007FF0000000'                      36640017
         DC    X'0000003FFFFFFFFFF83801FFE0000000'                      36650017
         DC    X'0000003FFFFFFFFFE00F07FFE0000000'                      36660017
         DC    X'0000003FFFFFFFFE0007FFFF80000000'                      36670017
         DC    X'0000003E000000000001FFFE00000000'                      36680017
         DC    X'0000003C0000000000007FF800000000'                      36690017
         DC    X'0000003C0000000000000FC000000000'                      36700017
         DC    X'0000001C000000000000000000000000'                      36710017
         DC    X'0000000E000000000000000000000000'                      36720017
         DC    X'00000001C00000000000000000000000'                      36730017
PATUSU   DC    X'00000038000000000000000000000000'                      36740017
         DC    X'0000000F000000000000000000000000'                      36750017
         DC    X'00000003C00000000000000000000000'                      36760017
         DC    X'00000000F00000000000000000000000'                      36770017
         DC    X'000000007C0000000000000000000000'                      36780017
         DC    X'000000003E0000000000300000000000'                      36790017
         DC    X'000000001F0000000000F80000000000'                      36800017
         DC    X'000000001F8000000003FC0000000000'                      36810017
         DC    X'000000000FC00000000FFE0000000000'                      36820017
         DC    X'000000000FE00000001FFF0000000000'                      36830017
         DC    X'0000000007F00000003FFF8000000000'                      36840017
         DC    X'0000000007F00000007FFFC000000000'                      36850017
         DC    X'0000000007F8000000FFFFE000000000'                      36860017
         DC    X'0000000007F8000001FFFF3800000000'                      36870017
         DC    X'0000000007FC006003FFFC0E00000000'                      36880017
         DC    X'000000000FFC008007FFF80380000000'                      36890017
         DC    X'000000000FFC01000FFFF003E0000000'                      36900017
         DC    X'000000001FFC01000FFFE007FC000000'                      36910017
         DC    X'000000003FFC00801FFFC00FFFC00000'                      36920017
         DC    X'000000007FF800603FFF801FFF000000'                      36930017
         DC    X'00000000FFF8000C3FFF001FFC000000'                      36940017
         DC    X'00000001FFF00001FFFE003FF8000000'                      36950017
         DC    X'00000007FFE000007FFC003FE0000000'                      36960017
         DC    X'0000003FFFE00000FFF8007FE0000000'                      36970017
         DC    X'0000001FFF800000FFF000FFE0000000'                      36980017
         DC    X'0000001FFF000001FFEC00FFE0000000'                      36990017
         DC    X'0000000FFE000001FFE1C1FFE0000000'                      37000017
         DC    X'00000007F8000003FFC031FFC0000000'                      37010017
         DC    X'00000003F0000003FFC007FFC0000000'                      37020017
         DC    X'00000003E0000007FF8001FFC0000000'                      37030017
         DC    X'0000000180000007FF8001FFC0000000'                      37040017
         DC    X'00000000C000000FFF0000FFC0000000'                      37050017
         DC    X'000000006000001FFE0000FFC0000000'                      37060017
         DC    X'000000003000003FFE00007FD8000000'                      37070017
         DC    X'000000001C00007FFC00003FC3000000'                      37080017
         DC    X'000000000E0001FFF000001FC0800000'                      37090017
         DC    X'0000000007800FFFC0000007E0400000'                      37100017
         DC    X'0000000001FFFFFF00000001F0400000'                      37110017
         DC    X'00000000007FFFF80000000078800000'                      37120017
         DC    X'000000000001FF80000000000E000000'                      37130017
PATUTU   DC    X'000000000000001FF000001000000000'                      37140017
         DC    X'00000000000007FFFFC0000C00000000'                      37150017
         DC    X'000000000000FFFFFFFE000300000000'                      37160017
         DC    X'000000000007FFFFFFFFC001C0000000'                      37170017
         DC    X'00000000003FFFFFFFFFF800F0000000'                      37180017
         DC    X'0000000000FFFFFFFFFFFE0078000000'                      37190017
         DC    X'0000000003FFFFF80003FF803C000000'                      37200017
         DC    X'000000000FFFFF0000001FE01E000000'                      37210017
         DC    X'000000003FFFF000300001F01F000000'                      37220017
         DC    X'000000007FFF80001C0000381F800000'                      37230017
         DC    X'00000000FFFE00000F00000E1F800000'                      37240017
         DC    X'00000001FFF800000F8000031FC00000'                      37250017
         DC    X'00000003FFE000000FC000019FC00000'                      37260017
         DC    X'00000007FFC000000FE00000FFC00000'                      37270017
         DC    X'0000000FFF0000001FE000007FC00000'                      37280017
         DC    X'0000001FFFFFFFFFFFFFFE00FFC00000'                      37290017
         DC    X'0000001FFDFFFFFFFFFFFF01FF800000'                      37300017
         DC    X'0000001FF8FFFFFFFFFFFFC3FF000000'                      37310017
         DC    X'0000003FF07FFFFFFFFFFFC7FF000000'                      37320017
         DC    X'0000003FE03FFFFFFFFFFFEFFE000000'                      37330017
         DC    X'0000003FC01FFFFFFFFFFFFFFE000000'                      37340017
         DC    X'0000003FC00000000000001FFC000000'                      37350017
         DC    X'0000003F800000000000001FFC000000'                      37360017
         DC    X'0000003F800000000000003FF8000000'                      37370017
         DC    X'0000003F000000000000003FF8000000'                      37380017
         DC    X'0000003F000000000000003FF8000000'                      37390017
         DC    X'0000003E000000000000001FF0000000'                      37400017
         DC    X'0000003E000000000000001FF0000000'                      37410017
         DC    X'0000003E000000000000001FF0000000'                      37420017
         DC    X'0000001E000000000000000FF0000000'                      37430017
         DC    X'0000001E000000000000000FF0000000'                      37440017
         DC    X'0000000E0000000000000007F8000000'                      37450017
         DC    X'0000000F0000000000000003F8000000'                      37460017
         DC    X'000000070000000000000003F8000000'                      37470017
         DC    X'000000038000000000000001F8000000'                      37480017
         DC    X'000000018000000000000000FC000000'                      37490017
         DC    X'00000000C0000000000000007C000000'                      37500017
         DC    X'0000000060000000000000001E000000'                      37510017
         DC    X'00000000000000000000000001800000'                      37520017
PATUUU   DC    X'0000003000000000E0000000C0000000'                      37530017
         DC    X'0000001E000000007C00000038000000'                      37540017
         DC    X'0000000F800000003F0000001E000000'                      37550017
         DC    X'00000007C00000001F8000001F000000'                      37560017
         DC    X'00000007E00000001FC000001F800000'                      37570017
         DC    X'00000007F00000001FE000001FC00000'                      37580017
         DC    X'00000003F80000003FF000003FC00000'                      37590017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      37600017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      37610017
         DC    X'00000003FFFFFFFFFFFFFFFFFF800000'                      37620017
         DC    X'00000003FFFFFFFFFFFFFFFFFF000000'                      37630017
         DC    X'00000007FFFFFFFFFFFFFFFFFC000000'                      37640017
         DC    X'0000000FFFFFFFFFFFFFFFFFE0000000'                      37650017
         DC    X'0000000FFF0000000000000000000000'                      37660017
         DC    X'0000001FFF0000000000000000000000'                      37670017
         DC    X'0000003FFF0000000000000000000000'                      37680017
         DC    X'0000001FFE0000000000000000000000'                      37690017
         DC    X'0000000FFE0000000000000000000000'                      37700017
         DC    X'00000007FC0000000000000000000000'                      37710017
         DC    X'00000003F80000000000000000000000'                      37720017
         DC    X'00000001F80000000000000030000000'                      37730017
         DC    X'00000000F0000000000000001E000000'                      37740017
         DC    X'0000000060000000000000000F000000'                      37750017
         DC    X'0000000030000000000000000F800000'                      37760017
         DC    X'0000000018000000000000001FC00000'                      37770017
         DC    X'000000000FFFFFFFFFFFFFFFFFC00000'                      37780017
         DC    X'000000003FFFFFFFFFFFFFFFFFC00000'                      37790017
         DC    X'00000000FFFFFFFFFFFFFFFFFFC00000'                      37800017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      37810017
         DC    X'0000000FFFFFFFFFFFFFFFFFFF800000'                      37820017
         DC    X'0000003FFFFFFFFFFFFFFFFFFF000000'                      37830017
         DC    X'0000001FFF000000000000007F000000'                      37840017
         DC    X'0000000FFC000000000000003F000000'                      37850017
         DC    X'00000007F0000000000000001F000000'                      37860017
         DC    X'00000003C00000000000000007800000'                      37870017
         DC    X'00000001800000000000000000C00000'                      37880017
         DC    X'00000000C00000000000000000000000'                      37890017
         DC    X'00000000600000000000000000000000'                      37900017
PATUVU   DC    X'0000003000000000E000000030000000'                      37910017
         DC    X'0000001E000000007C0000001E000000'                      37920017
         DC    X'0000000F800000003F0000000F000000'                      37930017
         DC    X'00000007C00000003F8000000F800000'                      37940017
         DC    X'00000007E00000007FC000000FC00000'                      37950017
         DC    X'00000007FFFFFFFFFFFFFFFFFFC00000'                      37960017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      37970017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      37980017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      37990017
         DC    X'00000003FFFFFFFFFFFFFFFFFF800000'                      38000017
         DC    X'00000003FFFFFFFFFFFFFFFFFF000000'                      38010017
         DC    X'00000007FE000000000000007F000000'                      38020017
         DC    X'0000000FFE000000000000003F000000'                      38030017
         DC    X'0000000FFF000000000000001F000000'                      38040017
         DC    X'0000001FFF0000000000000007800000'                      38050017
         DC    X'0000003FFF0000000000000000C00000'                      38060017
         DC    X'0000001FFE0000000000000000000000'                      38070017
         DC    X'0000000FFE0000000000000000000000'                      38080017
         DC    X'00000007FC0000000000000000000000'                      38090017
         DC    X'00000003F80000000000000000000000'                      38100017
         DC    X'00000001F80000000000000000000000'                      38110017
         DC    X'00000000F00000000000000000000000'                      38120017
         DC    X'00000000600000000000000000000000'                      38130017
         DC    X'00000000300000000000000000000000'                      38140017
         DC    X'0000000018000000000000FF80000000'                      38150017
         DC    X'000000000E00000000FFFFFFF0000000'                      38160017
         DC    X'0000000007FFFFFFFFFFFFFFFC000000'                      38170017
         DC    X'0000000001FFFFFFFFFFFFFFFE000000'                      38180017
         DC    X'00000000007FFFFFFFFFFFFFFF000000'                      38190017
         DC    X'00000000001FFFFFFFFFFFFFFF800000'                      38200017
         DC    X'000000000003FFFFFFFE00007F800000'                      38210017
         DC    X'0000000000007FFE000000001FC00000'                      38220017
         DC    X'00000000000000000000000007C00000'                      38230017
         DC    X'00000000000000000000000003800000'                      38240017
         DC    X'00000000000000000000000001800000'                      38250017
         DC    X'00000000000000000000000001000000'                      38260017
PATUWU   DC    X'0000003000000000E0000000C0000000'                      38270017
         DC    X'0000001E000000007C00000038000000'                      38280017
         DC    X'0000000F800000003F0000001E000000'                      38290017
         DC    X'00000007C00000001F8000001F000000'                      38300017
         DC    X'00000007E00000001FC000001F800000'                      38310017
         DC    X'00000007F00000001FE000001FC00000'                      38320017
         DC    X'00000003F80000003FF000003FC00000'                      38330017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      38340017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      38350017
         DC    X'00000003FFFFFFFFFFFFFFFFFF800000'                      38360017
         DC    X'00000003FFFFFFFFFFFFFFFFFF000000'                      38370017
         DC    X'00000007FFFFFFFFFFFFFFFFFC000000'                      38380017
         DC    X'0000000FFFFFFFFFFFFFFFFFE0000000'                      38390017
         DC    X'0000000FFF8000000000000000000000'                      38400017
         DC    X'0000001FFF8000000000000000000000'                      38410017
         DC    X'0000003FFF8000000000000000000000'                      38420017
         DC    X'0000001FFE000000E000000000000000'                      38430017
         DC    X'0000000FFE0000007C00000000000000'                      38440017
         DC    X'00000007FC0000003F00000030000000'                      38450017
         DC    X'00000003F80000001F8000001E000000'                      38460017
         DC    X'00000001F80000001FC000000F000000'                      38470017
         DC    X'00000000F00000001FE000000F800000'                      38480017
         DC    X'00000000700000003FF000001FC00000'                      38490017
         DC    X'000000003FFFFFFFFFFFFFFFFFC00000'                      38500017
         DC    X'00000000FFFFFFFFFFFFFFFFFFC00000'                      38510017
         DC    X'00000003FFFFFFFFFFFFFFFFFFC00000'                      38520017
         DC    X'0000000FFFFFFFFFFFFFFFFFFFC00000'                      38530017
         DC    X'0000003FFFFFFFFFFFFFFFFFFFC00000'                      38540017
         DC    X'0000003FFFFFFFFFFFFFFFFFFF800000'                      38550017
         DC    X'0000001FE0000001FF800000FF000000'                      38560017
         DC    X'0000000F80000000FF0000007F000000'                      38570017
         DC    X'00000006000000007F0000003F000000'                      38580017
         DC    X'00000003000000003F0000001F000000'                      38590017
         DC    X'00000001800000001F80000007800000'                      38600017
         DC    X'00000000C000000007C0000000C00000'                      38610017
         DC    X'000000007000000000E0000000000000'                      38620017
         DC    X'000000003C000000000001F800000000'                      38630017
         DC    X'000000001FC0000000001FFF80000000'                      38640017
         DC    X'000000000FFE000007FFFFFFF0000000'                      38650017
         DC    X'0000000007FFFFFFFFFFFFFFFC000000'                      38660017
         DC    X'0000000001FFFFFFFFFFFFFFFE000000'                      38670017
         DC    X'00000000007FFFFFFFFFFFFFFF000000'                      38680017
         DC    X'00000000001FFFFFFFFFFFFFFF800000'                      38690017
         DC    X'000000000003FFFFFFFE00007F800000'                      38700017
         DC    X'0000000000007FFE000000001FC00000'                      38710017
         DC    X'00000000000007E00000000007C00000'                      38720017
         DC    X'00000000000000000000000003800000'                      38730017
         DC    X'00000000000000000000000001800000'                      38740017
         DC    X'00000000000000000000000001000000'                      38750017
PATUXU   DC    X'00000038000000000000000780000000'                      38760017
         DC    X'0000001F0000000000000001F0000000'                      38770017
         DC    X'0000000FC0000000000000007E000000'                      38780017
         DC    X'0000000FE0000000000000007F000000'                      38790017
         DC    X'00000007F0000380000000007F800000'                      38800017
         DC    X'00000007F80001F0000000007FC00000'                      38810017
         DC    X'0000000FF80000FC00000000FFC00000'                      38820017
         DC    X'0000000FF800007F00000001FFC00000'                      38830017
         DC    X'0000000FFC00003FC0000007FFC00000'                      38840017
         DC    X'0000001FFC00001FF000003FFF800000'                      38850017
         DC    X'0000001FFC00001FF80001FFFF000000'                      38860017
         DC    X'0000003FFC00001FFE001FFFFE000000'                      38870017
         DC    X'00000000FC00000FFF01FFFFF8000000'                      38880017
         DC    X'0000000007E0000FFF1FFFFFE0000000'                      38890017
         DC    X'00000000001F800FFFFFFFFF00000000'                      38900017
         DC    X'0000000000007E1FFFFFFFF000000000'                      38910017
         DC    X'00000000000001FFFFFFFF0000000000'                      38920017
         DC    X'000000000000001FFFFFE00000000000'                      38930017
         DC    X'00000000000000FFFFFE000000000000'                      38940017
         DC    X'0000000000000FFFFFE0000000000000'                      38950017
         DC    X'000000000000FFFFFFF8000000000000'                      38960017
         DC    X'00000000000FFFFFFFC7E00000000000'                      38970017
         DC    X'0000000000FFFFFFFF001F8000000000'                      38980017
         DC    X'000000000FFFFFFFFF00007E00000000'                      38990017
         DC    X'00000001FFFFFE07FF800003F0000000'                      39000017
         DC    X'00000007FFFFC001FF800003FFC00000'                      39010017
         DC    X'0000000FFFF80000FF800003FF800000'                      39020017
         DC    X'0000001FFFC000003FC00003FF800000'                      39030017
         DC    X'0000003FFE0000000FE00003FF000000'                      39040017
         DC    X'0000003FF800000003F00001FF000000'                      39050017
         DC    X'0000003FF000000000F80001FF000000'                      39060017
         DC    X'0000003FE0000000001C0001FE000000'                      39070017
         DC    X'0000001FE000000000000000FE000000'                      39080017
         DC    X'0000000FE0000000000000007F000000'                      39090017
         DC    X'00000007E0000000000000003F000000'                      39100017
         DC    X'00000001F8000000000000000F800000'                      39110017
         DC    X'000000003E0000000000000001C00000'                      39120017
PATUYU   DC    X'000000200000000E00000000C0000000'                      39130017
         DC    X'0000003800000003C000000078000000'                      39140017
         DC    X'0000001E00000001F00000003E000000'                      39150017
         DC    X'0000000F00000001FC0000003F000000'                      39160017
         DC    X'6000000FC0000001FE0000003F800000'                      39170017
         DC    X'1C00000FE0000001FF0000007FC00000'                      39180017
         DC    X'0F000007F0000003FF800000FFC00000'                      39190017
         DC    X'07C00007FFFFFFFFFFFFFFFFFFC00000'                      39200017
         DC    X'03E00007FFFFFFFFFFFFFFFFFFC00000'                      39210017
         DC    X'03F00007FFFFFFFFFFFFFFFFFFC00000'                      39220017
         DC    X'01F80007FFFFFFFFFFFFFFFFFF800000'                      39230017
         DC    X'01F80007FFFFFFFFFFFFFFFFFF000000'                      39240017
         DC    X'01FC000FFFFFFFFFFFFFFFFFF8000000'                      39250017
         DC    X'01FC000FFE0000000000001C00000000'                      39260017
         DC    X'01FE001FFE0000000000000700000000'                      39270017
         DC    X'01FE003FFC00000000000001C0000000'                      39280017
         DC    X'01FF000FFC00000000000000F0000000'                      39290017
         DC    X'03FF0003FC00000000000001FC000000'                      39300017
         DC    X'03FF0000F800000000000001FF000000'                      39310017
         DC    X'03FF00003800000000000003FFC00000'                      39320017
         DC    X'07FF00000E00000000000003FF800000'                      39330017
         DC    X'07FF00000380000000000003FF000000'                      39340017
         DC    X'0FFE000000E0000000000007FF000000'                      39350017
         DC    X'0FFE00000038000000000007FE000000'                      39360017
         DC    X'1FFE0000000E000000000007FE000000'                      39370017
         DC    X'3FFC00003FFFFFFFFFFFFFFFFE000000'                      39380017
         DC    X'7FFC0003FFFFFFFFFFFFFFFFFC000000'                      39390017
         DC    X'3FF8000FFFFFFFFFFFFFFFFFFC000000'                      39400017
         DC    X'1FF0003FFFFFFFFFFFFFFFFFFC000000'                      39410017
         DC    X'0FE000FFFFFFFFFFFFFFFFFFFC000000'                      39420017
         DC    X'07C003FFFFFFFFFFFFFFFFFFFC000000'                      39430017
         DC    X'03800FFFF000000000000000FE000000'                      39440017
         DC    X'01C03FFFC0000000000000007E000000'                      39450017
         DC    X'007FFFFF00000000000000003F000000'                      39460017
         DC    X'001FFFF800000000000000000F800000'                      39470017
         DC    X'0001FFC0000000000000000001C00000'                      39480017
         DC    X'00000000000000000000000000C00000'                      39490017
PATUZU   DC    X'000000380000000000007C0000000000'                      39500017
         DC    X'0000000E000000000007FFE000000000'                      39510017
         DC    X'0000000780000000001FFFFC00000000'                      39520017
         DC    X'00000003E0000000003E07FF00000000'                      39530017
         DC    X'00000003F0000000007001FFC0000000'                      39540017
         DC    X'00000001FC000000006000FFF0000000'                      39550017
         DC    X'00000001FF8000000000007FFC000000'                      39560017
         DC    X'00000001FFC000000000007FFF000000'                      39570017
         DC    X'00000000FF3000000000007FFFC00000'                      39580017
         DC    X'00000000FF8C00000000007FFF800000'                      39590017
         DC    X'00000000FFC30000000000FFFF000000'                      39600017
         DC    X'00000000FFC0C007C00000FFFE000000'                      39610017
         DC    X'00000000FFC03001FC0001FFFC000000'                      39620017
         DC    X'00000000FFE00C00FF0001FFF8000000'                      39630017
         DC    X'00000000FFE00300FF8003FFF0000000'                      39640017
         DC    X'00000000FFE000C0FF8003FFF0000000'                      39650017
         DC    X'00000000FFE00030FF8003FFF0000000'                      39660017
         DC    X'00000000FFF0000CFF8003FFE0000000'                      39670017
         DC    X'00000000FFF00003FF8007FFE0000000'                      39680017
         DC    X'00000000FFF00000FF8007FFE0000000'                      39690017
         DC    X'00000000FFF00000FF8007FFE0000000'                      39700017
         DC    X'00000000FFF00000FF8007FFE0000000'                      39710017
         DC    X'00000001FFF00000FF8003FFE0000000'                      39720017
         DC    X'00000001FFF00000FFC003FFE0000000'                      39730017
         DC    X'00000001FFF00000FFB003FFE0000000'                      39740017
         DC    X'00000003FFF00000FF8C01FFE0000000'                      39750017
         DC    X'00000007FFF00000FFC301FFE0000000'                      39760017
         DC    X'00000007FFF00000FF80C1FFE0000000'                      39770017
         DC    X'0000000FFFE000007F8030FFE0000000'                      39780017
         DC    X'0000001FFFE000001FC00CFFE0000000'                      39790017
         DC    X'0000003FFFE0000001F0037FE0000000'                      39800017
         DC    X'0000001FFFC00000000000FFF0000000'                      39810017
         DC    X'0000000FFFC003000000003FF0000000'                      39820017
         DC    X'00000003FFC001800000000FF8000000'                      39830017
         DC    X'00000000FFE003C000000003F8000000'                      39840017
         DC    X'000000003FF007C000000000FC000000'                      39850017
         DC    X'000000000FFC1F80000000003C000000'                      39860017
         DC    X'0000000003FFFF00000000000E000000'                      39870017
         DC    X'0000000000FFFC000000000003000000'                      39880017
         DC    X'00000000003FF0000000000000000000'                      39890017
PATU0    DC    X'000000000FFFFFFFFFFF000000000000'                      39900017
         DC    X'000000001FFFFFFFFFFF800000000000'                      39910017
         DC    X'000000003FFFFFFFFFFFC00000000000'                      39920017
         DC    X'000000007FFFFFFFFFFFE00000000000'                      39930017
         DC    X'00000000FFFFFFFFFFFFF00000000000'                      39940017
         DC    X'00000001FE0000000000180000000000'                      39950017
         DC    X'00000003FC00000000000C0000000000'                      39960017
         DC    X'00000007F80000000000060000000000'                      39970017
         DC    X'0000000FF000000000000F0000000000'                      39980017
         DC    X'0000001FE000000000001F8000000000'                      39990017
         DC    X'0000003FC000000000003FC000000000'                      40000017
         DC    X'0000001F8000000000007F8000000000'                      40010017
         DC    X'0000000F000000000000FF0000000000'                      40020017
         DC    X'00000006000000000001FE0000000000'                      40030017
         DC    X'00000003000000000003FC0000000000'                      40040017
         DC    X'00000001FFFFFFFFFFFFF80000000000'                      40050017
         DC    X'00000000FFFFFFFFFFFFF00000000000'                      40060017
         DC    X'000000007FFFFFFFFFFFE00000000000'                      40070017
         DC    X'000000003FFFFFFFFFFFC00000000000'                      40080017
         DC    X'000000001FFFFFFFFFFF800000000000'                      40090017
PATU1    DC    X'00000030000000000000040000000000'                      40100017
         DC    X'00000018000000000000020000000000'                      40110017
         DC    X'0000000C000000000000030000000000'                      40120017
         DC    X'00000007FFFFFFFFFFFFFF8000000000'                      40130017
         DC    X'00000003FFFFFFFFFFFFFFC000000000'                      40140017
         DC    X'00000001FFFFFFFFFFFFFF8000000000'                      40150017
         DC    X'00000000FFFFFFFFFFFFFF0000000000'                      40160017
         DC    X'000000007FFFFFFFFFFFFE0000000000'                      40170017
         DC    X'00000000300000000000000000000000'                      40180017
         DC    X'00000000180000000000000000000000'                      40190017
         DC    X'000000000C0000000000000000000000'                      40200017
PATU2    DC    X'0000003F800000001FFFC00000000000'                      40210017
         DC    X'0000001FBC0000000FFFE00000000000'                      40220017
         DC    X'0000001FC3C0000007FFF00000000000'                      40230017
         DC    X'0000000FE038000003FFF80000000000'                      40240017
         DC    X'0000000FE007000001FFFC0000000000'                      40250017
         DC    X'00000007F000C00000001E0000000000'                      40260017
         DC    X'00000007F000300000000F0000000000'                      40270017
         DC    X'0000000FE0000C0000001F8000000000'                      40280017
         DC    X'0000000FE000060000003FC000000000'                      40290017
         DC    X'0000001FC000018000007F8000000000'                      40300017
         DC    X'0000001FC00000C00000FF0000000000'                      40310017
         DC    X'0000003F800000600001FE0000000000'                      40320017
         DC    X'0000003F800000300003FC0000000000'                      40330017
         DC    X'0000003F000000180007F80000000000'                      40340017
         DC    X'0000003F0000000C000FF00000000000'                      40350017
         DC    X'0000003F00000007FFFFE00000000000'                      40360017
         DC    X'0000001F80000003FFFFC00000000000'                      40370017
         DC    X'0000000FC0000001FFFF800000000000'                      40380017
         DC    X'00000007E0000000FFFF000000000000'                      40390017
         DC    X'00000001F00000007FFE000000000000'                      40400017
PATU3    DC    X'00000000080000000000200000000000'                      40410017
         DC    X'000000001E0000000000300000000000'                      40420017
         DC    X'000000003F8000000000380000000000'                      40430017
         DC    X'000000007F80000000003C0000000000'                      40440017
         DC    X'00000000FF00001000003E0000000000'                      40450017
         DC    X'00000001FE00003800003F0000000000'                      40460017
         DC    X'00000003FC00007C00003F8000000000'                      40470017
         DC    X'00000007F80000FE00003FC000000000'                      40480017
         DC    X'0000000FF00001FF00003FC000000000'                      40490017
         DC    X'0000001FE00003FD80003FC000000000'                      40500017
         DC    X'0000003FC00007F8C0003FC000000000'                      40510017
         DC    X'0000001F80000FF060003FC000000000'                      40520017
         DC    X'0000000F00001FE030003FC000000000'                      40530017
         DC    X'0000000600003FC018003FC000000000'                      40540017
         DC    X'0000000300007F800C007FC000000000'                      40550017
         DC    X'00000001FFFFFF0007FFFFC000000000'                      40560017
         DC    X'00000000FFFFFE0003FFFF8000000000'                      40570017
         DC    X'000000007FFFFC0001FFFF0000000000'                      40580017
         DC    X'000000003FFFF80000FFFE0000000000'                      40590017
         DC    X'000000001FFFF000007FFC0000000000'                      40600017
PATU4    DC    X'00000000000001000000000000000000'                      40610017
         DC    X'00000000000001C00000000000000000'                      40620017
         DC    X'00000000000001F00000000000000000'                      40630017
         DC    X'00000000000000FC0000000000000000'                      40640017
         DC    X'00000000000000FF0000000000000000'                      40650017
         DC    X'00000000000000FFC000000000000000'                      40660017
         DC    X'000000000000007F7000000000000000'                      40670017
         DC    X'000000000000007F1C00000000000000'                      40680017
         DC    X'000000000000007F0700000000000000'                      40690017
         DC    X'000000000000003F81C0000000000000'                      40700017
         DC    X'000000000000003F8070000000000000'                      40710017
         DC    X'000000000000003F801C000000000000'                      40720017
         DC    X'000000000000003F8007000000000000'                      40730017
         DC    X'000000000000007F0001C00000000000'                      40740017
         DC    X'00000002000000FF0000700000000000'                      40750017
         DC    X'00000007000000FE00001C0000000000'                      40760017
         DC    X'0000000FFFFFFFFFFFFFFF0000000000'                      40770017
         DC    X'0000001FFFFFFFFFFFFFFFC000000000'                      40780017
         DC    X'0000003FFFFFFFFFFFFFFFC000000000'                      40790017
         DC    X'0000001FFFFFFFFFFFFFFFC000000000'                      40800017
         DC    X'0000000FFFFFFFFFFFFFFFC000000000'                      40810017
         DC    X'00000007000000FE0000000000000000'                      40820017
         DC    X'000000020000003E0000000000000000'                      40830017
         DC    X'000000000000000F0000000000000000'                      40840017
PATU5    DC    X'0000000008000FFFFFFFFFC000000000'                      40850017
         DC    X'000000001E0007FFFFFFFF8000000000'                      40860017
         DC    X'000000003F8003FC00003F0000000000'                      40870017
         DC    X'000000007F8001FE00007F0000000000'                      40880017
         DC    X'00000000FF0000FF0000FE0000000000'                      40890017
         DC    X'00000001FE00007F8000FE0000000000'                      40900017
         DC    X'00000003FC00003FC000FC0000000000'                      40910017
         DC    X'00000007F800001FE001FC0000000000'                      40920017
         DC    X'0000000FF000000FF001FC0000000000'                      40930017
         DC    X'0000001FE0000007F801FC0000000000'                      40940017
         DC    X'0000003FC0000003FC01FC0000000000'                      40950017
         DC    X'0000001F80000007F801FC0000000000'                      40960017
         DC    X'0000000F0000000FF001FC0000000000'                      40970017
         DC    X'000000060000001FE000FC0000000000'                      40980017
         DC    X'000000030000003FC000FC0000000000'                      40990017
         DC    X'00000001FFFFFFFF80007C0000000000'                      41000017
         DC    X'00000000FFFFFFFF00003E0000000000'                      41010017
         DC    X'000000007FFFFFFE00000F0000000000'                      41020017
         DC    X'000000003FFFFFFC0000038000000000'                      41030017
         DC    X'000000001FFFFFF8000000C000000000'                      41040017
PATU6    DC    X'000000000FFFFFFFFFFF000000000000'                      41050017
         DC    X'000000001FFFFFFFFFFF800000000000'                      41060017
         DC    X'000000003FFFFFFFFFFFC00000000000'                      41070017
         DC    X'000000007FFFFFFFFFFFE00000000000'                      41080017
         DC    X'00000000FFFFFFFFFFFFF00000000000'                      41090017
         DC    X'00000001FE000000C000180000000000'                      41100017
         DC    X'00000003FC00000060000C0000000000'                      41110017
         DC    X'00000007F80000003000060000000000'                      41120017
         DC    X'0000000FF000000018000F0000000000'                      41130017
         DC    X'0000001FE00000003C001F8000000000'                      41140017
         DC    X'0000003FC00000007E003FC000000000'                      41150017
         DC    X'0000001F80000000FF007F8000000000'                      41160017
         DC    X'0000000F00000001FF00FF0000000000'                      41170017
         DC    X'0000000600000003FC01FE0000000000'                      41180017
         DC    X'0000000300000007F803FC0000000000'                      41190017
         DC    X'00000001FFFFFFFFF007F80000000000'                      41200017
         DC    X'00000000FFFFFFFFE00FF00000000000'                      41210017
         DC    X'000000007FFFFFFFC00FE00000000000'                      41220017
         DC    X'000000003FFFFFFF8003C00000000000'                      41230017
         DC    X'000000001FFFFFFE0000800000000000'                      41240017
PATU7    DC    X'00000030000000000000200000000000'                      41250017
         DC    X'00000018000000000000380000000000'                      41260017
         DC    X'0000000C0000000000003E0000000000'                      41270017
         DC    X'00000007C000000000003F8000000000'                      41280017
         DC    X'00000003FFC0000000003FC000000000'                      41290017
         DC    X'00000001FFFFC00000003F8000000000'                      41300017
         DC    X'00000000FFFFFE0000003F8000000000'                      41310017
         DC    X'000000007FFFFFFC00003F0000000000'                      41320017
         DC    X'000000003FFFFFFF80003F0000000000'                      41330017
         DC    X'000000001801FFFFF0001F0000000000'                      41340017
         DC    X'000000000C0003FFFE001F0000000000'                      41350017
         DC    X'000000000600000FFFC01F0000000000'                      41360017
         DC    X'00000000000000007FF00F0000000000'                      41370017
         DC    X'000000000000000003FE0F0000000000'                      41380017
         DC    X'0000000000000000003FC78000000000'                      41390017
         DC    X'00000000000000000007E78000000000'                      41400017
         DC    X'00000000000000000000FF8000000000'                      41410017
         DC    X'000000000000000000000F8000000000'                      41420017
         DC    X'0000000000000000000001C000000000'                      41430017
         DC    X'0000000000000000000000C000000000'                      41440017
PATU8    DC    X'000000001FFFE000FFFF000000000000'                      41450017
         DC    X'000000003FFFF801FFFF800000000000'                      41460017
         DC    X'000000007FFFFE03FFFFC00000000000'                      41470017
         DC    X'00000000FFFFFF07FFFFE00000000000'                      41480017
         DC    X'00000001FFFFFF8FFFFFF00000000000'                      41490017
         DC    X'00000003FC0001DFE000180000000000'                      41500017
         DC    X'00000007F800007FC0000C0000000000'                      41510017
         DC    X'0000000FF000007F8000060000000000'                      41520017
         DC    X'0000001FE00000FF00000F0000000000'                      41530017
         DC    X'0000003FC00001FE00001F8000000000'                      41540017
         DC    X'0000001F800003FC00003FC000000000'                      41550017
         DC    X'0000000F000007F800007F8000000000'                      41560017
         DC    X'0000000600000FF00000FF0000000000'                      41570017
         DC    X'0000000300001FF00001FE0000000000'                      41580017
         DC    X'0000000180003FDC0003FC0000000000'                      41590017
         DC    X'00000000FFFFFF8FFFFFF80000000000'                      41600017
         DC    X'000000007FFFFF07FFFFF00000000000'                      41610017
         DC    X'000000003FFFFE03FFFFE00000000000'                      41620017
         DC    X'000000001FFFFC00FFFFC00000000000'                      41630017
         DC    X'000000000FFFF8007FFF800000000000'                      41640017
PATU9    DC    X'00000000100000FFFFFF800000000000'                      41650017
         DC    X'000000003C0001FFFFFFC00000000000'                      41660017
         DC    X'000000007F0003FFFFFFE00000000000'                      41670017
         DC    X'00000000FF0007FFFFFFF00000000000'                      41680017
         DC    X'00000001FE000FFFFFFFF80000000000'                      41690017
         DC    X'00000003FC001FE000000C0000000000'                      41700017
         DC    X'00000007F8003FC00000060000000000'                      41710017
         DC    X'0000000FF0007F8000000F0000000000'                      41720017
         DC    X'0000001FE000FF0000001F8000000000'                      41730017
         DC    X'0000003FC0007E0000003FC000000000'                      41740017
         DC    X'0000001F80003C0000007F8000000000'                      41750017
         DC    X'0000000F000018000000FF0000000000'                      41760017
         DC    X'0000000600000C000001FE0000000000'                      41770017
         DC    X'00000003000006000003FC0000000000'                      41780017
         DC    X'00000001800003000007F80000000000'                      41790017
         DC    X'00000000FFFFFFFFFFFFF00000000000'                      41800017
         DC    X'000000007FFFFFFFFFFFE00000000000'                      41810017
         DC    X'000000003FFFFFFFFFFFC00000000000'                      41820017
         DC    X'000000001FFFFFFFFFFF800000000000'                      41830017
         DC    X'000000000FFFFFFFFFFF000000000000'                      41840017
         DC    X'00000000000000000000000000000000'                      41850017
PATUBLK  DC    X'00000000000000000000000000000000'                      41860017
         DC    X'00000000000000000000000000000000'                      41870017
         DC    X'00000000000000000000000000000000'                      41880017
         DC    X'00000000000000000000000000000000'                      41890017
         DC    X'00000000000000000000000000000000'                      41900017
         DC    X'00000000000000000000000000000000'                      41910017
         DC    X'00000000000000000000000000000000'                      41920017
         DC    X'00000000000000000000000000000000'                      41930017
         DC    X'00000000000000000000000000000000'                      41940017
         DC    X'00000000000000000000000000000000'                      41950017
         DC    X'00000000000000000000000000000000'                      41960017
         DC    X'00000000000000000000000000000000'                      41970017
         DC    X'00000000000000000000000000000000'                      41980017
         DC    X'00000000000000000000000000000000'                      41990017
         DC    X'00000000000000000000000000000000'                      42000017
         DC    X'00000000000000000000000000000000'                      42010017
         DC    X'00000000000000000000000000000000'                      42020017
         DC    X'00000000000000000000000000000000'                      42030017
         DC    X'00000000000000000000000000000000'                      42040017
         DC    X'00000000000000000000000000000000'                      42050017
PATUSP   DC    X'00000000000000000000000000000000'                      42060017
         DC    X'00000000000000000000000000000000'                      42070017
         DC    X'00000000000000000000000000000000'                      42080017
         END GOTHIC                                                     42090001
